{"data":[{"id":1,"text":"1. Define and explain the three basic types of cloud services and the AWS products that are built based on them?\nThe three basic types of cloud services are:\n\nComputing\nStorage\nNetworking\nHere are some of the AWS products that are built based on the three cloud service types:\n\nComputing - These include EC2, Elastic Beanstalk, Lambda, Auto-Scaling, and Lightsat.\n\nStorage - These include S3, Glacier, Elastic Block Storage, Elastic File System.\n\nNetworking - These include VPC, Amazon CloudFront, Route53"},{"id":2,"text":"2. What is the relation between the Availability Zone and Region?\nAWS regions are separate geographical areas, like the US-West 1 (North California) and Asia South (Mumbai). On the other hand, availability zones are the areas that are present inside the regions. These are generally isolated zones that can replicate themselves whenever required."},{"id":3,"text":"3. What is auto-scaling?\nAuto-scaling is a function that allows you to provision and launch new instances whenever there is a demand. It allows you to automatically increase or decrease resource capacity in relation to the demand."},{"id":4,"text":"4. What is geo-targeting in CloudFront?\nGeo-Targeting is a concept where businesses can show personalized content to their audience based on their geographic location without changing the URL. This helps you create customized content for the audience of a specific geographical area, keeping their needs in the forefront."},{"id":5,"text":"5. What are the steps involved in a CloudFormation Solution?\nHere are the steps involved in a CloudFormation solution:\n\nCreate or use an existing CloudFormation template using JSON or YAML format.\nSave the code in an S3 bucket, which serves as a repository for the code.\nUse AWS CloudFormation to call the bucket and create a stack on your template. \nCloudFormation reads the file and understands the services that are called, their order, the relationship between the services, and provisions the services one after the other."},{"id":6,"text":"6. How do you upgrade or downgrade a system with near-zero downtime?\nYou can upgrade or downgrade a system with near-zero downtime using the following steps of migration:\n\nOpen EC2 console\nChoose Operating System AMI\nLaunch an instance with the new instance type\nInstall all the updates\nInstall applications\nTest the instance to see if it’s working\nIf working, deploy the new instance and replace the older instance\nOnce it’s deployed, you can upgrade or downgrade the system with near-zero downtime.\nTake home these interview Q&As and get much more. Download the complete AWS Interview Guide here:"},{"id":7,"text":"7. What are the tools and techniques that you can use in AWS to identify if you are paying more than you should be, and how to correct it?\nYou can know that you are paying the correct amount for the resources that you are using by employing the following resources:\n\nCheck the Top Services Table\nIt is a dashboard in the cost management console that shows you the top five most used services. This will let you know how much money you are spending on the resources in question.\nCost Explorer\nThere are cost explorer services available that will help you to view and analyze your usage costs for the last 13 months. You can also get a cost forecast for the upcoming three months.\nAWS Budgets\nThis allows you to plan a budget for the services. Also, it will enable you to check if the current plan meets your budget and the details of how you use the services.\nCost Allocation Tags\nThis helps in identifying the resource that has cost more in a particular month. It lets you organize your resources and cost allocation tags to keep track of your AWS costs."},{"id":8,"text":"8. Is there any other alternative tool to log into the cloud environment other than console?\nThe that can help you log into the AWS resources are:\n\nPutty\nAWS CLI for Linux\nAWS CLI for Windows\nAWS CLI for Windows CMD\nAWS SDK\nEclipse"},{"id":9,"text":"9. What services can be used to create a centralized logging solution?\nThe essential services that you can use are Amazon CloudWatch Logs, store them in Amazon S3, and then use Amazon Elastic Search to visualize them. You can use Amazon Kinesis Firehose to move the data from Amazon S3 to Amazon ElasticSearch."},{"id":10,"text":"10. What are the native AWS Security logging capabilities?\nMost of the AWS services have their logging options. Also, some of them have an account level logging, like in AWS CloudTrail, AWS Config, and others. Let’s take a look at two services in specific:\n\nAWS CloudTrail\nThis is a service that provides a history of the AWS API calls for every account. It lets you perform security analysis, resource change tracking, and compliance auditing of your AWS environment as well. The best part about this service is that it enables you to configure it to send notifications via AWS SNS when new logs are delivered.\n\nAWS Config \nThis helps you understand the configuration changes that happen in your environment. This service provides an AWS inventory that includes configuration history, configuration change notification, and relationships between AWS resources. It can also be configured to send information via AWS SNS when new logs are delivered."},{"id":11,"text":"11. What is a DDoS attack, and what services can minimize them?\nDDoS is a cyber-attack in which the perpetrator accesses a website and creates multiple sessions so that the other legitimate users cannot access the service. The native tools that can help you deny the DDoS attacks on your AWS services are:\n\nAWS Shield\nAWS WAF\nAmazon Route53\nAmazon CloudFront\nELB\nVPC"},{"id":12,"text":"12. You are trying to provide a service in a particular region, but you do not see the service in that region. Why is this happening, and how do you fix it?\nNot all Amazon AWS services are available in all regions. When Amazon initially launches a new service, it doesn’t get immediately published in all the regions. They start small and then slowly expand to other regions. So, if you don’t see a specific service in your region, chances are the service hasn’t been published in your region yet. However, if you want to get the service that is not available, you can switch to the nearest region that provides the services."},{"id":13,"text":"13. How do you set up a system to monitor website metrics in real-time in AWS?\nAmazon CloudWatch helps you to monitor the application status of various AWS services and custom events. It helps you to monitor:\n\nState changes in Amazon EC2\nAuto-scaling lifecycle events\nScheduled events\nAWS API calls\nConsole sign-in events"},{"id":14,"text":"14. What are the different types of virtualization in AWS, and what are the differences between them?\nThe three major types of virtualization in AWS are: \n\nHardware Virtual Machine (HVM)\nIt is a fully virtualized hardware, where all the virtual machines act separate from each other. These virtual machines boot by executing a master boot record in the root block device of your image.\nParavirtualization (PV)\nParavirtualization-GRUB is the bootloader that boots the PV AMIs. The PV-GRUB chain loads the kernel specified in the menu.\nParavirtualization on HVM\nPV on HVM helps operating systems take advantage of storage and network I/O available through the host."},{"id":15,"text":"15. Name some of the AWS services that are not region-specific\nAWS services that are not region-specific are:\n\nIAM\nRoute 53\nWeb Application Firewall \nCloudFront"},{"id":16,"text":"16. What are the differences between NAT Gateways and NAT Instances?\nWhile both NAT Gateways and NAT Instances serve the same function, they still have some key differences.\n\nDifferences"},{"id":17,"text":"17. What is CloudWatch?\nThe Amazon CloudWatch has the following features:\n\nDepending on multiple metrics, it participates in triggering alarms.\nHelps in monitoring the AWS environments like CPU utilization, EC2, Amazon RDS instances, Amazon SQS, S3, Load Balancer, SNS, etc."},{"id":18,"text":"18. What is an Elastic Transcoder?\nTo support multiple devices with various resolutions like laptops, tablets, and smartphones, we need to change the resolution and format of the video. This can be done easily by an AWS Service tool called the Elastic Transcoder, which is a media transcoding in the cloud that exactly lets us do the needful. It is easy to use, cost-effective, and highly scalable for businesses and developers.\n\nAWS Interview Questions for Amazon EC2"},{"id":19,"text":"19. What is Amazon EC2?\nEC2 is short for Elastic Compute Cloud, and it provides scalable computing capacity. Using Amazon EC2 eliminates the need to invest in hardware, leading to faster development and deployment of applications. You can use Amazon EC2 to launch as many or as few virtual servers as needed, configure security and networking, and manage storage. It can scale up or down to handle changes in requirements, reducing the need to forecast traffic. EC2 provides virtual computing environments called “instances.”"},{"id":20,"text":"20. What Are Some of the Security Best Practices for Amazon EC2?\nSecurity best practices for Amazon EC2 include using Identity and Access Management (IAM) to control access to AWS resources; restricting access by only allowing trusted hosts or networks to access ports on an instance; only opening up those permissions you require, and disabling password-based logins for instances launched from your AMI."},{"id":21,"text":"21. Can S3 Be Used with EC2 Instances, and If Yes, How?\nAmazon S3 can be used for instances with root devices backed by local instance storage. That way, developers have access to the same highly scalable, reliable, fast, inexpensive data storage infrastructure that Amazon uses to run its own global network of websites. To execute systems in the Amazon EC2 environment, developers load Amazon Machine Images (AMIs) into Amazon S3 and then move them between Amazon S3 and Amazon EC2.\n\nAmazon EC2 and Amazon S3 are two of the best-known web services that make up AWS."},{"id":22,"text":"22. What is the difference between stopping and terminating an EC2 instance? \nWhile you may think that both stopping and terminating are the same, there is a difference. When you stop an EC2 instance, it performs a normal shutdown on the instance and moves to a stopped state. However, when you terminate the instance, it is transferred to a stopped state, and the EBS volumes attached to it are deleted and can never be recovered."},{"id":23,"text":"23. What are the different types of EC2 instances based on their costs?\nThe three types of EC2 instances are:\n\nOn-demand Instance\nIt is cheap for a short time but not when taken for the long term\nSpot Instance\nIt is less expensive than the on-demand instance and can be bought through bidding. \nReserved Instance\nIf you are planning to use an instance for a year or more, then this is the right one for you."},{"id":24,"text":"24. How do you set up SSH agent forwarding so that you do not have to copy the key every time you log in?\nHere’s how you accomplish this:\n\nGo to your PuTTY Configuration\nGo to the category SSH -> Auth\nEnable SSH agent forwarding to your instance"},{"id":25,"text":"25. What are Solaris and AIX operating systems? Are they available with AWS?\nSolaris is an operating system that uses SPARC processor architecture, which is not supported by the public cloud currently. \n\nAIX is an operating system that runs only on Power CPU and not on Intel, which means that you cannot create AIX instances in EC2.\n\nSince both the operating systems have their limitations, they are not currently available with AWS."},{"id":26,"text":"26. How do you configure CloudWatch to recover an EC2 instance?\nHere’s how you can configure them:\n\nCreate an Alarm using Amazon CloudWatch\nIn the Alarm, go to Define Alarm -> Actions tab\nChoose Recover this instance option"},{"id":27,"text":"27. What are the common types of AMI designs?\nThere are many types of AMIs, but some of the common AMIs are:\n\nFully Baked AMI\nJust Enough Baked AMI (JeOS AMI)\nHybrid AMI"},{"id":28,"text":"28. What are Key-Pairs in AWS?\nThe Key-Pairs are password-protected login credentials for the Virtual Machines that are used to prove our identity while connecting the Amazon EC2 instances. The Key-Pairs are made up of a Private Key and a Public Key which lets us connect to the instances."},{"id":29,"text":"29. What is Amazon S3? \nS3 is short for Simple Storage Service, and Amazon S3 is the most supported storage platform available. S3 is object storage that can store and retrieve any amount of data from anywhere. Despite that versatility, it is practically unlimited as well as cost-effective because it is storage available on demand. In addition to these benefits, it offers unprecedented levels of durability and availability. Amazon S3 helps to manage data for cost optimization, access control, and compliance."},{"id":30,"text":"30. How can you recover/login to an EC2 instance for which you have lost the key?\nFollow the steps provided below to recover an EC2 instance if you have lost the key:\n\nVerify that the EC2Config service is running\nDetach the root volume for the instance\nAttach the volume to a temporary instance\nModify the configuration file\nRestart the original instance"},{"id":31,"text":"31. What are some critical differences between AWS S3 and EBS?\nHere are some differences between AWS S3 and EBS"},{"id":32,"text":"32. How do you allow a user to gain access to a specific bucket?\nYou need to follow the four steps provided below to allow access. They are:\n\nCategorize your instances\nDefine how authorized users can manage specific servers.\nLockdown your tags\nAttach your policies to IAM users"},{"id":33,"text":"33. How can you monitor S3 cross-region replication to ensure consistency without actually checking the bucket?\nFollow the flow diagram provided below to monitor S3 cross-region replication:"},{"id":34,"text":"34. What is SnowBall?\nTo transfer terabytes of data outside and inside of the AWS environment, a small application called SnowBall is used. \n\nData transferring using SnowBall is done in the following ways:\n\nA job is created.\nThe SnowBall application is connected.\nThe data is copied into the SnowBall application.\nData is then moved to the AWS S3."},{"id":35,"text":"35. What are the Storage Classes available in Amazon S3?\nThe Storage Classes that are available in the Amazon S3 are the following:\n\nAmazon S3 Glacier Instant Retrieval storage class\nAmazon S3 Glacier Flexible Retrieval (Formerly S3 Glacier) storage class\nAmazon S3 Glacier Deep Archive (S3 Glacier Deep Archive)\nS3 Outposts storage class\nAmazon S3 Standard-Infrequent Access (S3 Standard-IA)\nAmazon S3 One Zone-Infrequent Access (S3 One Zone-IA)\nAmazon S3 Standard (S3 Standard)\nAmazon S3 Reduced Redundancy Storage\nAmazon S3 Intelligent-Tiering (S3 Intelligent-Tiering)"},{"id":36,"text":"AWS Interview Questions for VPC"},{"id":37,"text":"36. What Is Amazon Virtual Private Cloud (VPC) and Why Is It Used?\nA VPC is the best way of connecting to your cloud resources from your own data center. Once you connect your datacenter to the VPC in which your instances are present, each instance is assigned a private IP address that can be accessed from your data center. That way, you can access your public cloud resources as if they were on your own private network."},{"id":38,"text":"37. VPC is not resolving the server through DNS. What might be the issue, and how can you fix it?\nTo fix this problem, you need to enable the DNS hostname resolution, so that the problem resolves itself."},{"id":39,"text":"38. How do you connect multiple sites to a VPC?\nIf you have multiple VPN connections, you can provide secure communication between sites using the AWS VPN CloudHub. Here’s a diagram that will show you how to connect various sites to a VPC:"},{"id":40,"text":"39. Name and explain some security products and features available in VPC?\nHere is a selection of security products and features:\n\nSecurity groups - This acts as a firewall for the EC2 instances, controlling inbound and outbound traffic at the instance level.\nNetwork access control lists - It acts as a firewall for the subnets, controlling inbound and outbound traffic at the subnet level.\nFlow logs - These capture the inbound and outbound traffic from the network interfaces in your VPC."},{"id":41,"text":"40. How do you monitor Amazon VPC?\nYou can monitor VPC by using:\n\nCloudWatch and CloudWatch logs\nVPC Flow Logs"},{"id":42,"text":"41. How many Subnets can you have per VPC?\nWe can have up to 200 Subnets per Amazon Virtual Private Cloud (VPC)."},{"id":43,"text":"General AWS Interview Questions"},{"id":44,"text":"42. When Would You Prefer Provisioned IOPS over Standard Rds Storage?\nYou would use Provisioned IOPS when you have batch-oriented workloads. Provisioned IOPS delivers high IO rates, but it is also expensive. However, batch processing workloads do not require manual intervention."},{"id":45,"text":"43. How Do Amazon Rds, Dynamodb, and Redshift Differ from Each Other?\nAmazon RDS is a database management service for relational databases. It manages patching, upgrading, and data backups automatically. It’s a database management service for structured data only. On the other hand, DynamoDB is a NoSQL database service for dealing with unstructured data. Redshift is a data warehouse product used in data analysis."},{"id":46,"text":"44. What Are the Benefits of AWS’s Disaster Recovery?\nBusinesses use cloud computing in part to enable faster disaster recovery of critical IT systems without the cost of a second physical site. The AWS cloud supports many popular disaster recovery architectures ranging from small customer workload data center failures to environments that enable rapid failover at scale. With data centers all over the world, AWS provides a set of cloud-based disaster recovery services that enable rapid recovery of your IT infrastructure and data."},{"id":47,"text":"45. How can you add an existing instance to a new Auto Scaling group?\nHere’s how you can add an existing instance to a new Auto Scaling group:\n\nOpen EC2 console\nSelect your instance under Instances\nChoose Actions -> Instance Settings -> Attach to Auto Scaling Group\nSelect a new Auto Scaling group\nAttach this group to the Instance\nEdit the Instance if needed\nOnce done, you can successfully add the instance to a new Auto Scaling group"},{"id":48,"text":"46. What are the factors to consider while migrating to Amazon Web Services?\nHere are the factors to consider during AWS migration:\n\nOperational Costs - These include the cost of infrastructure, ability to match demand and supply, transparency, and others.\nWorkforce Productivity \nCost avoidance\nOperational resilience\nBusiness agility\nAWS Solutions Architect Certification Course\nYour Ticket To Becoming A AWS Solutions ArchitectEXPLORE COURSE"},{"id":49,"text":"AWS Solutions Architect Certification Course"},{"id":50,"text":"47. What is RTO and RPO in AWS?\nRTO or Recovery Time Objective is the maximum time your business or organization is willing to wait for a recovery to complete in the wake of an outage. On the other hand, RPO or Recovery Point Objective is the maximum amount of data loss your company is willing to accept as measured in time."},{"id":51,"text":"48. If you would like to transfer vast amounts of data, which is the best option among Snowball, Snowball Edge, and Snowmobile?\nAWS Snowball is basically a data transport solution for moving high volumes of data into and out of a specified AWS region. On the other hand, AWS Snowball Edge adds additional computing functions apart from providing a data transport solution. The snowmobile is an exabyte-scale migration service that allows you to transfer data up to 100 PB."},{"id":52,"text":"49. Explain what T2 instances are?\nThe T2 Instances are intended to give the ability to burst to a higher performance whenever the workload demands it and also provide a moderate baseline performance to the CPU.\n\nThe T2 instances are General Purpose instance types and are low in cost as well. They are usually used wherever workloads do not consistently or often use the CPU."},{"id":53,"text":"50. What are the advantages of AWS IAM?\nAWS IAM allows an administrator to provide multiple users and groups with granular access. Various user groups and users may require varying levels of access to the various resources that have been developed. We may assign roles to users and create roles with defined access levels using IAM.\n\nIt further gives us Federated Access, which allows us to grant applications and users access to resources without having to create IAM Roles."},{"id":54,"text":"51. Explain Connection Draining\nConnection Draining is an AWS service that allows us to serve current requests on the servers that are either being decommissioned or updated.\n\nBy enabling this Connection Draining, we let the Load Balancer make an outgoing instance finish its existing requests for a set length of time before sending it any new requests. A departing instance will immediately go off if Connection Draining is not enabled, and all pending requests will fail."},{"id":55,"text":"52. What is Power User Access in AWS?\nThe AWS Resources owner is identical to an Administrator User. The Administrator User can build, change, delete, and inspect resources, as well as grant permissions to other AWS users.\n\nAdministrator Access without the ability to control users and permissions is provided to a Power User. A Power User Access user cannot provide permissions to other users but has the ability to modify, remove, view, and create resources."},{"id":56,"text":"AWS Interview Questions for CloudFormation"},{"id":57,"text":"53. How is AWS CloudFormation different from AWS Elastic Beanstalk?\nHere are some differences between AWS CloudFormation and AWS Elastic Beanstalk:\n\nAWS CloudFormation helps you provision and describe all of the infrastructure resources that are present in your cloud environment. On the other hand, AWS Elastic Beanstalk provides an environment that makes it easy to deploy and run applications in the cloud.\nAWS CloudFormation supports the infrastructure needs of various types of applications, like legacy applications and existing enterprise applications. On the other hand, AWS Elastic Beanstalk is combined with the developer tools to help you manage the lifecycle of your applications."},{"id":58,"text":"54. What are the elements of an AWS CloudFormation template?\nAWS CloudFormation templates are YAML or JSON formatted text files that are comprised of five essential elements, they are:\n\nTemplate parameters\nOutput values\nData tables\nResources\nFile format version"},{"id":59,"text":"55. What happens when one of the resources in a stack cannot be created successfully?\nIf the resource in the stack cannot be created, then the CloudFormation automatically rolls back and terminates all the resources that were created in the CloudFormation template. This is a handy feature when you accidentally exceed your limit of Elastic IP addresses or don’t have access to an EC2 AMI."},{"id":60,"text":"AWS Interview Questions for Elastic Block Storage"},{"id":61,"text":"56. How can you automate EC2 backup using EBS?\nUse the following steps in order to automate EC2 backup using EBS:\n\nGet the list of instances and connect to AWS through API to list the Amazon EBS volumes that are attached locally to the instance.\nList the snapshots of each volume, and assign a retention period of the snapshot. Later on, create a snapshot of each volume.\nMake sure to remove the snapshot if it is older than the retention period."},{"id":62,"text":"57. What is the difference between EBS and Instance Store?\nEBS is a kind of permanent storage in which the data can be restored at a later point. When you save data in the EBS, it stays even after the lifetime of the EC2 instance. On the other hand, Instance Store is temporary storage that is physically attached to a host machine. With an Instance Store, you cannot detach one instance and attach it to another. Unlike in EBS, data in an Instance Store is lost if any instance is stopped or terminated."},{"id":63,"text":"58. Can you take a backup of EFS like EBS, and if yes, how?\nYes, you can use the EFS-to-EFS backup solution to recover from unintended changes or deletion in Amazon EFS. Follow these steps:\n\nSign in to the AWS Management Console\nClick the launch EFS-to-EFS-restore button\nUse the region selector in the console navigation bar to select region\nVerify if you have chosen the right template on the Select Template page\nAssign a name to your solution stack\nReview the parameters for the template and modify them if necessary"},{"id":64,"text":"59. How do you auto-delete old snapshots?\nHere’s the procedure for auto-deleting old snapshots:\n\nAs per procedure and best practices, take snapshots of the EBS volumes on Amazon S3.\nUse AWS Ops Automator to handle all the snapshots automatically.\nThis allows you to create, copy, and delete Amazon EBS snapshots."},{"id":65,"text":"AWS Interview Questions for Elastic Load Balancing"},{"id":66,"text":"60. What are the different types of load balancers in AWS?\nThere are three types of load balancers that are supported by Elastic Load Balancing:\n\nApplication Load Balancer\nNetwork Load Balancer\nClassic Load Balancer"},{"id":67,"text":"61. What are the different uses of the various load balancers in AWS Elastic Load Balancing?\nApplication Load Balancer\nUsed if you need flexible application management and TLS termination.\n\nNetwork Load Balancer\nUsed if you require extreme performance and static IPs for your applications.\n\nClassic Load Balancer\nUsed if your application is built within the EC2 Classic network"},{"id":68,"text":"AWS Interview Questions for Security"},{"id":69,"text":"62. What Is Identity and Access Management (IAM) and How Is It Used?\nIdentity and Access Management (IAM) is a web service for securely controlling access to AWS services. IAM lets you manage users, security credentials such as access keys, and permissions that control which AWS resources users and applications can access."},{"id":70,"text":"63. How can you use AWS WAF in monitoring your AWS applications?\nAWS WAF or AWS Web Application Firewall protects your web applications from web exploitations. It helps you control the traffic flow to your applications. With WAF, you can also create custom rules that block common attack patterns. It can be used for three cases: allow all requests, prevent all requests, and count all requests for a new policy."},{"id":71,"text":"64. What are the different AWS IAM categories that you can control?\nUsing AWS IAM, you can do the following:\n\nCreate and manage IAM users\nCreate and manage IAM groups\nManage the security credentials of the users\nCreate and manage policies to grant access to AWS services and resources"},{"id":72,"text":"65. What are the policies that you can set for your users’ passwords?\nHere are some of the policies that you can set:\n\nYou can set a minimum length of the password, or you can ask the users to add at least one number or special characters in it.\nYou can assign requirements of particular character types, including uppercase letters, lowercase letters, numbers, and non-alphanumeric characters.\nYou can enforce automatic password expiration, prevent reuse of old passwords, and request for a password reset upon their next AWS sign in.\nYou can have the AWS users contact an account administrator when the user has allowed the password to expire."},{"id":73,"text":"66. What is the difference between an IAM role and an IAM user?\nThe two key differences between the IAM role and IAM user are:\n\nAn IAM role is an IAM entity that defines a set of permissions for making AWS service requests, while an IAM user has permanent long-term credentials and is used to interact with the AWS services directly.  \nIn the IAM role, trusted entities, like IAM users, applications, or an AWS service, assume roles whereas the IAM user has full access to all the AWS IAM functionalities."},{"id":74,"text":"67. What are the managed policies in AWS IAM?\nThere are two types of managed policies; one that is managed by you and one that is managed by AWS. They are IAM resources that express permissions using IAM policy language. You can create, edit, and manage them separately from the IAM users, groups, and roles to which they are attached."},{"id":75,"text":"69. How does AWS IAM help your business?\nIAM enables to:\n\nManage IAM users and their access - AWS IAM provides secure resource access to multiple users\nManage access for federated users – AWS allows you to provide secure access to resources in your AWS account to your employees and applications without creating IAM roles\nAWS Interview Questions for Route 53"},{"id":76,"text":"70. What Is Amazon Route 53?\nAmazon Route 53 is a scalable and highly available Domain Name System (DNS). The name refers to TCP or UDP port 53, where DNS server requests are addressed."},{"id":77,"text":"71. What Is Cloudtrail and How Do Cloudtrail and Route 53 Work Together? \nCloudTrail is a service that captures information about every request sent to the Amazon Route 53 API by an AWS account, including requests that are sent by IAM users. CloudTrail saves log files of these requests to an Amazon S3 bucket. CloudTrail captures information about all requests. You can use information in the CloudTrail log files to determine which requests were sent to Amazon Route 53, the IP address that the request was sent from, who sent the request, when it was sent, and more."},{"id":78,"text":"72. What is the difference between Latency Based Routing and Geo DNS?\nThe Geo Based DNS routing takes decisions based on the geographic location of the request. Whereas, the Latency Based Routing utilizes latency measurements between networks and AWS data centers. Latency Based Routing is used when you want to give your customers the lowest latency possible. On the other hand, Geo Based routing is used when you want to direct the customer to different websites based on the country or region they are browsing from."},{"id":79,"text":"73. What is the difference between a Domain and a Hosted Zone?\nDomain\nA domain is a collection of data describing a self-contained administrative and technical unit. For example, www.simplilearn.com is a domain and a general DNS concept.\n\nHosted zone\nA hosted zone is a container that holds information about how you want to route traffic on the internet for a specific domain. For example, lms.simplilearn.com is a hosted zone."},{"id":80,"text":"74. How does Amazon Route 53 provide high availability and low latency?\nHere’s how Amazon Route 53 provides the resources in question:\n\nGlobally Distributed Servers\nAmazon is a global service and consequently has DNS services globally. Any customer creating a query from any part of the world gets to reach a DNS server local to them that provides low latency. \n\nDependency\nRoute 53 provides a high level of dependability required by critical applications\n\nOptimal Locations\nRoute 53 uses a global anycast network to answer queries from the optimal position automatically."},{"id":81,"text":"AWS Interview Questions for Config"},{"id":82,"text":"75. How does AWS config work with AWS CloudTrail?\nAWS CloudTrail records user API activity on your account and allows you to access information about the activity. Using CloudTrail, you can get full details about API actions such as the identity of the caller, time of the call, request parameters, and response elements. On the other hand, AWS Config records point-in-time configuration details for your AWS resources as Configuration Items (CIs). \n\nYou can use a CI to ascertain what your AWS resource looks like at any given point in time. Whereas, by using CloudTrail, you can quickly answer who made an API call to modify the resource. You can also use Cloud Trail to detect if a security group was incorrectly configured."},{"id":83,"text":"76. Can AWS Config aggregate data across different AWS accounts?\nYes, you can set up AWS Config to deliver configuration updates from different accounts to one S3 bucket, once the appropriate IAM policies are applied to the S3 bucket."},{"id":84,"text":"AWS Interview Questions for Database"},{"id":85,"text":"77. How are reserved instances different from on-demand DB instances?\nReserved instances and on-demand instances are the same when it comes to function. They only differ in how they are billed.\n\nReserved instances are purchased as one-year or three-year reservations, and in return, you get very low hourly based pricing when compared to the on-demand cases that are billed on an hourly basis."},{"id":86,"text":"78. Which type of scaling would you recommend for RDS and why?\nThere are two types of scaling - vertical scaling and horizontal scaling. Vertical scaling lets you vertically scale up your master database with the press of a button. A database can only be scaled vertically, and there are 18 different instances in which you can resize the RDS. On the other hand, horizontal scaling is good for replicas. These are read-only replicas that can only be done through Amazon Aurora."},{"id":87,"text":"79. What is a maintenance window in Amazon RDS? Will your DB instance be available during maintenance events?\nRDS maintenance window lets you decide when DB instance modifications, database engine version upgrades, and software patching have to occur. The automatic scheduling is done only for patches that are related to security and durability. By default, there is a 30-minute value assigned as the maintenance window and the DB instance will still be available during these events though you might observe a minimal effect on performance."},{"id":88,"text":"80. What are the consistency models in DynamoDB?\nThere are two consistency models In DynamoDB. First, there is the Eventual Consistency Model, which maximizes your read throughput. However, it might not reflect the results of a recently completed write. Fortunately, all the copies of data usually reach consistency within a second. The second model is called the Strong Consistency Model. This model has a delay in writing the data, but it guarantees that you will always see the updated data every time you read it."},{"id":89,"text":"81. What type of query functionality does DynamoDB support?\nDynamoDB supports GET/PUT operations by using a user-defined primary key. It provides flexible querying by letting you query on non-primary vital attributes using global secondary indexes and local secondary indexes."},{"id":90,"text":"1. Suppose you are a game designer and want to develop a game with single-digit millisecond latency, which of the following database services would you use?\nAmazon DynamoDB"},{"id":91,"text":"2. If you need to perform real-time monitoring of AWS services and get actionable insights, which services would you use?\nAmazon CloudWatch"},{"id":92,"text":"3. As a web developer, you are developing an app, targeted primarily for the mobile platform. Which of the following lets you add user sign-up, sign-in, and access control to your web and mobile apps quickly and easily?\nAmazon Cognito"},{"id":93,"text":"4. You are a Machine Learning Engineer who is on the lookout for a solution that will discover sensitive information that your enterprise stores in AWS and then use NLP to classify the data and provide business-related insights. Which among the services would you choose?\nAWS Macie"},{"id":94,"text":"5. You are the system administrator in your company, which is running most of its infrastructure on AWS. You are required to track your users and keep tabs on how they are being authenticated. You wish to create and manage AWS users and use permissions to allow and deny their access to AWS resources. Which of the following services suits you best?\nAWS IAM"},{"id":95,"text":"6. Which service do you use if you want to allocate various private and public IP addresses to make them communicate with the internet and other instances?\nAmazon VPC"},{"id":96,"text":"7. This service provides you with cost-efficient and resizable capacity while automating time-consuming administration tasks\nAmazon Relational Database Service"},{"id":97,"text":"8. Which of the following is a means for accessing human researchers or consultants to help solve problems on a contractual or temporary basis?\nAmazon Mechanical Turk"},{"id":98,"text":"9. This service is used to make it easy to deploy, manage, and scale containerized applications using Kubernetes on AWS. Which of the following is this AWS service?\nAmazon Elastic Container Service"},{"id":99,"text":"10. This service lets you run code without provisioning or managing servers. Select the correct service from the below options\nAWS Lambda"},{"id":100,"text":"11. As an AWS Developer, using this pay-per-use service, you can send, store, and receive messages between software components. Which of the following is it?\nAmazon Simple Queue Service"},{"id":101,"text":"12. Which service do you use if you would like to host a real-time audio and video conferencing application on AWS, this service provides you with a secure and easy-to-use application?\nAmazon Chime"}]}