{"data":[{"id":1,"text":"1) Explain what AWS is?\nAWS stands for Amazon Web Service; it is a collection of remote computing services also known as a cloud computing platform.  This new realm of cloud computing is also known as IaaS or Infrastructure as a Service."},{"id":2,"text":"2) Mention what the key components of AWS are?\nThe key components of AWS are\n\nRoute 53: A DNS web service\nSimple E-mail Service: It allows sending e-mail using RESTFUL API call or via regular SMTP\nIdentity and Access Management: It provides enhanced security and identity management for your AWS account\nSimple Storage Device or (S3): It is a storage device and the most widely used AWS service\nElastic Compute Cloud (EC2): It provides on-demand computing resources for hosting applications. It is handy in case of unpredictable workloads\nElastic Block Store (EBS): It offers persistent storage volumes that attach to EC2 to allow you to persist data past the lifespan of a single Amazon EC2 instance\nCloudWatch: To monitor AWS resources, It allows administrators to view and collect keys. \nAlso, one can set a notification alarm in case of trouble."},{"id":3,"text":"3) Explain what S3 is?\nS3 stands for Simple Storage Service. You can use the S3 interface to store and retrieve any amount of data, at any time and from anywhere on the web.  For S3, the payment model is “pay as you go.”"},{"id":4,"text":"4) What is AMI?\nAMI stands for Amazon Machine Image.  It’s a template that provides the information (an operating system, an application server, and applications) required to launch an instance, which is a copy of the AMI running as a virtual server in the cloud.  You can launch instances from as many different AMIs as you need."},{"id":5,"text":"5) Mention what the relationship between an instance and AMI is?\nFrom a single AMI, you can launch multiple types of instances.  An instance type defines the hardware of the host computer used for your instance. Each instance type provides different computer and memory capabilities.  Once you launch an instance, it looks like a traditional host, and we can interact with it as we would with any computer."},{"id":6,"text":"6) What does an AMI include?\nAn AMI includes the following things\n\nA template for the root volume for the instance\nLaunch permissions decide which AWS accounts can avail the AMI to launch instances\nA block device mapping that determines the volumes to attach to the instance when it is launched"},{"id":7,"text":"7) How can you send a request to Amazon S3?\nAmazon S3 is a REST service, and you can send a request by using the REST API or the AWS SDK wrapper libraries that wrap the underlying Amazon S3 REST API."},{"id":8,"text":"8) Mention what the difference between Amazon S3 and EC2 is?\nThe difference between EC2 and Amazon S3 is that\n\nEC2\tS3\nIt is a cloud web service used for hosting your application\nIt is a data storage system where any amount of data can be stored\nIt is like a huge computer machine which can run either Linux or Windows and can handle applications like PHP, Python, Apache, or any databases\nIt has a REST interface and uses secure HMAC-SHA1 authentication keys"},{"id":9,"text":"9) How many buckets can you create in AWS by default?\nBy default, you can create up to 100 buckets in each of your AWS accounts."},{"id":10,"text":"10) Explain can you vertically scale an Amazon instance? How?\nYes, you can vertically scale on the Amazon instance. For that\n\nSpin up a new larger instance than the one you are currently running\nPause that instance and detach the root webs volume from the server and discard\nThen stop your live instance and detach its root volume\nNote the unique device ID and attach that root volume to your new server\nAnd start it again"},{"id":11,"text":"11) Explain what T2 instances is?\nT2 instances are designed to provide moderate baseline performance and the capability to burst to higher performance as required by the workload."},{"id":12,"text":"12) In VPC with private and public subnets, database servers should ideally be launched into which subnet?\nWith private and public subnets in VPC, database servers should ideally launch into private subnets."},{"id":13,"text":"13) Mention what the security best practices for Amazon EC2 are?\nFor secure Amazon EC2 best practices, follow the following steps"},{"id":14,"text":"Use AWS identity and access management to control access to your AWS resources\nRestrict access by allowing only trusted hosts or networks to access ports on your instance\nReview the rules in your security groups regularly\nOnly open up permissions that you require\nDisable password-based login, for example, launched from your AMI"},{"id":15,"text":"14) Explain how the buffer is used in Amazon web services?\nThe buffer is used to make the system more robust to manage traffic or load by synchronizing different components.  Usually, components receive and process the requests in an unbalanced way. With the help of a buffer, the components will be balanced and will work at the same speed to provide faster services."},{"id":16,"text":"15) While connecting to your instance what are the possible connection issues one might face?\nThe possible connection errors one might encounter while connecting instances are\n\nConnection timed out\nUser key not recognized by the server\nHost key not found, permission denied\nAn unprotected private key file\nServer refused our key or No supported authentication method available\nError using MindTerm on Safari Browser\nError using Mac OS X RDP Client"},{"id":17,"text":"16) What are key-pairs in AWS?\nKey-pairs are secure login information for your virtual machines. To connect to the instances, you can use key-pairs which contain a public-key and private-key."},{"id":18,"text":"17)  What are the different types of instances?\nFollowing are the types of instances:\n\nGeneral purpose\nComputer Optimized\nMemory Optimized\nStorage Optimized\nAccelerated Computing"},{"id":19,"text":"18) Is the property of broadcast or multicast supported by Amazon VPC?\nNo, currently Amazon VPI does not provide support for broadcast or multicast."},{"id":20,"text":"19) How many Elastic IPs are allowed to be created by AWS?\n5 VPC Elastic IP addresses are allowed for each AWS account."},{"id":21,"text":"20) Explain default storage class in S3\nThe default storage class is a Standard frequently accessed."},{"id":22,"text":"21) What are the Roles?\nRoles are used to provide permissions to entities which you can trust within your AWS account. Roles are very similar to users. However,  with roles, you do not require to create any username and password to work with the resources."},{"id":23,"text":"22) What are the edge locations?\nEdge location is the area where the contents will be cached. So, when a user is trying to access any content, the content will automatically be searched in the edge location."},{"id":24,"text":"23) What is VPC?\nVPC stands for Virtual Private Cloud. It allows you to customize your networking configuration. It is a network which is logically isolated from another network in the cloud. It allows you to have your IP address range,  internet gateways, subnet, and security groups."},{"id":25,"text":"24) Explain snowball\nSnowball is a data transport option. It used source appliances to a large amount of data into and out of AWS. With the help of snowball, you can transfer a massive amount of data from one place to another. It helps you to reduce networking costs."},{"id":26,"text":"25) What is a redshift?\nRedshift is a big data warehouse product. It is a fast and powerful, fully managed data warehouse service in the cloud."},{"id":27,"text":"26) What are the advantages of auto-scaling?\nFollowing are the advantages of autoscaling\n\nOffers fault tolerance\nBetter availability\nBetter cost management"},{"id":28,"text":"27) What is meant by subnet?\nA large section of IP Addresses divided into chunks is known as subnets."},{"id":29,"text":"28) Can you establish a Peering connection to a VPC in a different region?\nYes, we can establish a peering connection to a VPC in a different region. It is called inter-region VPC peering connection."},{"id":30,"text":"29) What is SQS?\nSimple Queue Service is also known as SQS. It is distributed queuing service which acts as a mediator for two controllers."},{"id":31,"text":"30) How many subnets can you have per VPC?\nYou can have 200 subnets per VPC."},{"id":32,"text":"31) DNS  and Load Balancer service comes under which type of cloud service?\nDNS and Load Balancer and DNS services come under IAAS-storage cloud service."},{"id":33,"text":"32) What is the role of AWS CloudTrail?\nCloudTrail is a specially designed tool for logging and tracking API calls. It helps to audit all S3 bucket accesses."},{"id":34,"text":"33) When was EC2 officially launched?\nEC2 officially launched in the year 2006."},{"id":35,"text":"34) What is SimpleDB?\nSimpleDB is a data repository of structure record which encourages data doubts and indexing both S3 and EC2are called SimpleDB."},{"id":36,"text":"35) Explain Amazon ElasticCache\nAmazon Elasticcache is a web service which makes it easy to deploy, scale and store data in the cloud."},{"id":37,"text":"36) What is AWS Lambda?\nLambda is an Amazon compute service which allows you to run code in the  AWS Cloud without managing servers."},{"id":38,"text":"37) Name the types of AMI provided by AWS\nThe types of AMI provided by AWS are:\n\nInstance store backed\nEBS backed"},{"id":39,"text":"38) Name the AWS service that exists only to redundantly cache data and images?\nAWS Edge locations are services that redundantly cache data and images."},{"id":40,"text":"39) Explain Geo Restriction in CloudFront\nA Geo-restriction feature helps you to prevent users of specific geographic locations from accessing content which you’re distributing through a CloudFront web distribution."},{"id":41,"text":"40) What is Amazon EMR?\nEMR is a survived cluster stage which helps you to interpret the working of data structures before the intimation.  Apache Hadoop and Apache Spark on the Amazon Web Services help you to investigate a large amount of data. You can prepare data for the analytics goals and marketing intellect workloads using Apache Hive and using other relevant open-source designs."},{"id":42,"text":"41) What is the boot time taken for the instance stored backed AMI?\nThe boot time for an Amazon instance store-backend AMI is less than 5 minutes."},{"id":43,"text":"42) Do you need an internet gateway to use peering connections?\nYes, the Internet gateway is needed to use VPC (virtual private cloud peering) connections."},{"id":44,"text":"43) How to connect EBS volume to multiple instances?\nWe can’t be able to connect EBS volume to multiple instances.  However, you can connect various EBS Volumes to a single instance."},{"id":45,"text":"44) List different types of cloud services\nVarious types of cloud services are:\n\nSoftware as a Service (SaaS),\nData as a Service (DaaS)\nPlatform as a Service (PaaS)\nInfrastructure as a Service (IaaS)."},{"id":46,"text":"45) State the difference between An Instance  and AMI\nAMI is a template consisting of software configuration part. For example Operating systems, applications, application servers if you start an instance, a duplicate of the AMI in a row as an attendant in the cloud."},{"id":47,"text":"46) What are the different types of Load Balancers in AWS services?\nTwo types of Load balancers are:\n\nApplication Load Balancer\nClassic Load Balancer"},{"id":48,"text":"47) In which situation you will select provisioned IOPS over Standard RDS storage?\nYou should select provisioned IOPS storage over standard RDS storage if you want to perform batch-related workloads."},{"id":49,"text":"48) What are the important features of Amazon cloud search?\nImportant features of the Amazon cloud are:\n\nBoolean searches\nPrefix Searches\nRange searches\nEntire text search\nAutoComplete advice"},{"id":50,"text":"49) Can vertically scaling is allowed in  Amazon Instance?\nYes, you can vertically estimate one Amazon instance."},{"id":51,"text":"50) What is the use of lifecycle hooks in Autoscaling?\nLifecycle hooks are used for autoscaling to put an additional wait time to a scale in or scale out event."},{"id":52,"text":"51) What are the various layers of Cloud Architecture explained in AWS training?\nDifferent layers of cloud architecture are:\n\nCloud controller\nCluster controller\nStorage Controller\nNode Controller\n52) What are the storage class available in Amazon s3?\nStorage classes available with Amazon s3 are:\n\nAmazon S3 standard\nAmazon S3 standard-infrequent Access\nAmazon S3 Reduced Redundancy Storage\nAmazon Glacier"},{"id":53,"text":"53) Name some of the DB engines which can be used in AWS RDS\nMS-SQL DB\nMariaDB\nMYSQL DB\nOracleDB\nPostgreDB"}]}