{"data":[{"id":1,"text":"00. EMP HISTORY"},{"id":2,"text":"01. Why have you applied for this position? \n\nAns: I had been looking for something in a slightly bigger organisation for a few months, and yours was one of the companies I was checking pretty frequently. I was delighted when I saw this advertised because it matches my management skills really well, but gives me some new responsibilities too."},{"id":3,"text":"02. How did you get your last job? \n\nAns: It was my first job after graduation, so I had made several applications, but all in the same field. I sent my CV to several companies, but when I wasn't having any luck, I approached two or three that I was really interested in to see if I could do some work experience. At my first interview, I was offered some temporary work; then it became permanent."},{"id":4,"text":"03. Why are you leaving your current job? \n\nAns: I have been with them for more than two years and learned a lot there. The department was very small and I would like to work in a larger team. I enjoy get fired-up by exchanging ideas with a lively group of people. I think it brings out the best in me."},{"id":5,"text":"04. How useful was the part-time data entry work you did when you were a student? \n\nAns: It was the final year of my course, so I did not want to take on something that was too intellectually challenging and I did need the money. Actually it taught me a great deal about being thorough and being able to cope with repetition when you have to. I was made supervisor for some shifts and I got on really well with other staff and saw how important it is for a team under pressure to work well together. My knowledge of IT meant I could do a little bit of troubleshooting for them too and that was really satisfying."},{"id":6,"text":"05. Did you do any work experience while you were at school? \n\nAns: Yes, I did two weeks at a local transport company booking coach tours; I spent a lot of time on the telephone and learned how to give quotes. It was great; it made a change from school, but it also made me realise it really was worth working for my exams."},{"id":7,"text":"06. I see that your business studies course included one year's work experience. What are the three most significant things you learned from that year? \n\nAns: I was delighted to get a placement in the customer relations department of such a large telecommunications company and it really taught me so many things, but the most significant three were how to work as part of a team, to ask the right questions so that I could become effective quickly and, above all, common sense. You can never predict exactly what form an enquiry will take and you don't always have a standard reply, so you have to think on your feet and come up with something sensible."},{"id":8,"text":"07. You have applied for a permanent position with us, but you have been doing temporary jobs for several different companies over the past three years. Why is that? \n\nAns: Since deciding to go into hotel management I have always liked the idea of working for an independent operator rather than one of the big chains, so I decided to get as much valuable experience as I could in all aspects of hotel work, while I waited for the right opportunity to come along. As you can see, many of my temporary jobs have been with the big chains and I have learned a lot, but it has confirmed that I do want to work somewhere where there is more scope for individual flair and some very traditional values of old-fashioned customer service too."},{"id":9,"text":"08. You have applied for a permanent position with us, but you have been doing temporary jobs for several different companies over the past three years. Why is that? \n\nAns: My main reason for temping was that I had not made a really definite decision. I thought I could gain experience of different work environments and the different types of administrative work within various organisations. The experience was really useful and has shown me that I much prefer to work for a smaller company like yours, where I feel far more involved and understand several aspects of your work and your customers. I like being part of a busy team and it brings out the best in me."},{"id":10,"text":"09. We can only offer you some short-term contract work at the moment; are you still interested? \n\nAns: Yes, very much so, especially as I have been really impressed with what I have learned about you this morning. I would hope that you are soon able to offer me something more, but I am quite happy to take that kind of risk. I was very lucky the last time I took on a 'short? contract."},{"id":11,"text":"10. I understand you worked without pay for three months for a London law firm; don't you think you are worth a salary? \n\nAns: If I had not been confident that I am worth a good salary I would not have worked on such terms. The law is so competitive at the moment and I saw it more as a chance to gain experience, and demonstrate my levels of skill and my enthusiasm. If the firm had not had to start making redundancies, I believe they would have offered me a post on a salary. Things went really well there and they have said they will give me a very good reference."},{"id":12,"text":"11. You have been with your current employer for only 18 months. Why have you decided to make a move now? \n\nAns: I took the job because I have an overall interest in product design and it was a really good start for me, even though I had never thought much about lawnmowers before. I had always wanted to get into the motor vehicle industry because rebuilding old cars is a real passion of mine. When I saw that you were advertising I knew it was an opportunity not to be missed. In fact I have learned a lot working with the design team for the past 18 months."},{"id":13,"text":"12. You have been with your current employer for 22 years. What has made you decide to apply elsewhere now? \n\nAns: That 22 years might have been with one company, but the company has grown, my role within it has changed several times and I have had several promotions while working there. I started off in their accounts department with a manual accounting system and now I am deputy head of purchasing and took responsibility for installing our latest electronic purchasing system. I like the company and I respect the way they work, but I am certainly ready and qualified to take on a job as head of purchasing and I could bring a great deal of experience to your company. I could go on to outline some of my particular skills if you wish."},{"id":14,"text":"13. You have been with your current employer for 22 years. What has made you decide to apply elsewhere now? \n\nAns: It sounds a long time when you put it like that and I suppose 22 years in a government department is a long time, but my work has been varied and I now manage a department of more than 100 staff. My experience in policy development and as a policy adviser puts me in an ideal position to take on this position with you. My experience in the Civil Service has helped me become very resilient, very thorough and good at interpreting complex information. I am sure I could use these skills very effectively for you."},{"id":15,"text":"14. You ran your own business for three years. How do you feel you will deal with a situation where you won't have total responsibility for all the decisions, and where work will be delegated to you by somebody else? \n\nAns: It was exciting running my own catering business and it went well. I built up a substantial base of satisfied customers but it became more and more difficult to compete with new legislation and I think, even more significantly, I actually missed working with other people. I worked for catering companies before I ran my business and when I left I was still enjoying it _ I like working in teams and as this is a management job I shall have considerable responsibility, I am sure."},{"id":16,"text":"15. I notice you ran a business that had to fold up after two years; what do you think was behind the failure? \n\nAns: It was the recession _ that may sound predictable, but we simply ran into problems with too many other small businesses owing us money. I still gained a lot from the experience; it has taught me to think on my feet and to be resilient under pressure. It has also made me somewhat harder about chasing up money owed, which I am sure you would appreciate in the role I have applied for here."},{"id":17,"text":"16. What would your current manager say about your work? \n\nAns: She would say I was a very committed and enthusiastic member of the department. I believe she would mention in particular that I keep calm when there is a lot of pressure and that I don't let attention to detail slip when we are close to a deadline."},{"id":18,"text":"17. That all sounds very promising, but if she was then asked to come up with any faults or weaknesses, what might she say? \n\nAns: She might say that I sometimes get involved in too many projects at once _ that I can get a little bit carried away with enthusiasm and I have to discipline myself to curb that and be even more willing to delegate some projects to others. I have become much more effective at delegation during the past 18 months."},{"id":19,"text":"18. You have been in management for five years now. What might staff who are managed by you say if they were asked to appraise you? \n\nAns: I have a great relationship with my staff and I am sure they would pick out the fact that I always try to listen to people's ideas and suggestions regardless of their position within the department. They would say I encourage them to take individual responsibility, but that I am approachable (usually) if they are running into any problems."},{"id":20,"text":"19. Would they all be that positive?  There must be aspects of your management style that some of them would be less enthusiastic about.\n\nAns: I'm not sure that it's my style they sometimes find difficult. I have had to implement some unpopular decisions, for example, introducing evening work rosters that were completely new to our department, and that upset a lot of staff and caused genuine problems for many of them. I think that offering people a full and truthful explanation about why the decision had been made and trying to offer some flexibility in implementing it helped staff to accept the situation, but there are some who are still annoyed about it."},{"id":21,"text":"20. If you have had a recent performance appraisal, what has it highlighted as work goals for the coming year? \n\nAns: Yes, we do have an annual performance appraisal; my most recent one was done four months ago. The main point that came up was that I was ready to take on greater management responsibility and also more responsibility for training new staff. As a follow-up to the appraisal, I have already attended one course on effective management styles and another on dealing with staff disciplinary issues."},{"id":22,"text":"21. Have you ever found yourself in a position where you don't get on with a colleague, and how have you tackled this? \n\nAns: Yes, in the job before my current one I really didn't hit it off with our head of public relations; we were both on the same level, so neither of us could pull rank to solve the problem. In the end I grasped the nettle and persuaded him that we should have a talk and try to work out an effective strategy for us to work together _ we really needed to with me working in marketing. We had a pretty frank discussion and, although I can't say we ended up the best of friends, we did gain more respect for one another's roles and we certainly worked more productively together. I was really glad I had taken the initiative."},{"id":23,"text":"22. If we asked a colleague of yours to describe a fault you have, what would they come up with? \n\nAns: My last manager might say I was sometimes a little impatient with other staff. I find it very frustrating when people don't do their bit, especially if we are trying to meet a deadline. I have learned that taking a bit of time to explain why things must be done now and also reminding people of their obligations to the team does pay off and I get a better response by working in that way, so I have learned a lot about how to get the best out of people and benefited from feeling far less stressed myself."},{"id":24,"text":"23. How do you cope under pressure?  This is a very busy department you have applied to join.\n\nAns: I enjoy a certain amount of pressure _ it makes me alert and very motivated. There are limits and I try to avoid pressure becoming too great by planning my workload well ahead, but sometimes the unexpected crops up, however well you plan. In my current job as production editor I can have everything ready for the magazine deadline and a client suddenly decides they want to change an advert or a picture _ I have to decide whether it's realistically possible to do this without making the magazine late, and if it isn't I have to keep calm and try to ensure that we don't lose the client. That is always a very pressured situation."},{"id":25,"text":"24. How do you cope under pressure?  This is a very busy department you have applied to join.\n\nAns: I have worked in social services for eight years now and every department I have worked for has been busy and I have managed a heavy caseload. It is stressful when you are dealing with several difficult cases at once, but I find the most useful way of coping is to talk to colleagues and managers to gain some support and also to learn to switch off and leave work behind when I leave the office. I used to find that difficult, but I find that going for a swim at the end of the day and also doing an evening class in something completely different to the job _ I am doing a course in Italian at present _ really helps me to switch off and be more effective again the next morning."},{"id":26,"text":"25. How do you cope under pressure?  This is a very busy department you have applied to join.\n\nAns: Marking examination papers is always one of the most pressured times of year because I have to do it thoroughly and yet there is an absolute deadline. I cope by developing a really clear routine for my marking and by keeping the rest of my life very simple during those weeks. Of course, that's a kind of planned pressure; there's also the unexpected pressure, such as when staff suddenly go off sick or leave and I have to plan all the extra cover for the department and inevitably put pressure on others. Involving people and remembering to thank them helps to soften the blow."},{"id":27,"text":"26. describe your working style  \n\nAns: Discerning \n\nReceptive \n\nAssessing \n\nObserving \n\nProductive \n\nReflecting \n\nRisk-taking \n\nCareful \n\nPractical \n\nQuestioning \n\nActive \n\nResponsible \n\nCooperative \n\nAnalytical \n\nDecisive \n\nSupportive \n\nCreative \n\nThorough \n\nMeasured \n\nDynamic \n\nEfficient \n\nIndependent \n\nImaginative \n\nCommitted"},{"id":28,"text":"27. Tell me how your experience to date makes you suitable for this job.\n\nAns: I started as a junior reporter on the local paper I am working for now and it was an excellent way to learn the basic skills of chasing stories, interviewing, writing and following stories up. Education became quite an issue in our area because of various school closures and mergers and that gave me a chance to get really involved in an issue and build up a network of useful contacts and be well informed. I know all of this would be relevant to a national daily like yours. I feel ready to make the move; it is something I have always wanted and my current editor has been really encouraging, even though he says he does not want to lose me."},{"id":29,"text":"28. Tell me how your experience to date makes you suitable for this job.\n\nAns: Among the many things I have learned from my time as a store manager, I have learned a great deal about our fashion product range: what sells well and items that you think will be great, but just don't seem to have that vital appeal to customers. I enjoy many aspects of management, especially anything connected with display and merchandising, and I think I would contribute really well to the buying department. I think I have a real feel for what customers want and a realistic approach to cost."},{"id":30,"text":"29. Tell me how your experience to date makes you suitable for this job.\n\nAns: I have been a nurse at this hospital for six years now and, because I also have a degree, I am in an ideal position to take advantage of your management training scheme. I love working with patients, but I suppose one of my greatest satisfactions is training and supporting new staff on the ward and helping them to understand how their contribution is essential to both efficiency and high standards of patient care. I would like the opportunity to take this part of my work further and the management scheme would certainly allow me to do this. I think it pays dividends to have some managers who have come up through the grass roots of nursing."},{"id":31,"text":"30. What would you say is your greatest strength? \n\nAns: I am sure it is dealing with people _ my interpersonal skills are very good. I seem to be able to pitch myself at just the right level, whether I am presenting something to the management board or solving a problem with a customer on the telephone. I am good at persuading people around to my point of view without bullying them. I always enjoyed debates and discussions at university and I have become a good negotiator."},{"id":32,"text":"31. What would you say is your greatest strength? \n\nAns: I am really good at spotting ways in which a process can be carried out more efficiently to save time and money. I managed to cut back the number of procedures involved in our internal ordering system in my current job and, although colleagues said it wouldn't work at first, it is going really well now."},{"id":33,"text":"32. What is your time management like?  How do you plan your working week, for example? \n\nAns: At the end of the week I make a list of the most important tasks that lie ahead for the following week and decide which I shall tackle first. I usually organise a brief team meeting first thing on a Monday morning, so that anyone can bring up anything they are concerned about or where they feel there are likely to be real pressure points during the week."},{"id":34,"text":"33. How do you set about prioritising your workload? \n\nAns: Perhaps I should give you an example. As the head of a department in a large recruitment consultancy, a great deal of post is addressed to me and, although it is partly sorted by other staff, I still face a full in-tray every morning. I quickly sort everything into three piles. The first is things that need to be followed up straight away, for instance vacancies to be processed or new clients to be followed up. I have a second pile of relatively important items, invitations to conferences, internal memos, etc., and a third heap that may well be destined for the rubbish bin _ irrelevant product adverts and endless questionnaires."},{"id":35,"text":"34. What action do you take if you have members of staff working for you who really don't get on with one another, to the point where this is affecting other staff? \n\nAns: I make my own assessment of where faults might lie, but I get those staff together in a meeting and give them an opportunity to raise what they find difficult about their colleague, without allowing blatant insults, and then I ask them to suggest things to make the situation work better. Of course, this is assuming they are both good employees and that there are faults on both sides. If it is simply a case of one person behaving unreasonably, then I would outline my dissatisfactions and ask them to make some improvements."},{"id":36,"text":"35. What sort of contribution do you make to a team or work group? \n\nAns: Having graduated last year, I am fairly new to work teams, but I took part in two group projects while on my engineering course. On one project I was asked to lead and I found it quite a challenge motivating other team members so that they all pulled their weight. I learned how vital it is for people to really understand their specific tasks and to realise how these relate to the whole project. In my second group project I had specific responsibility for industrial liaison, gathering data from employers and working closely with them. I got a lot out of this, but I preferred the role of team leader."},{"id":37,"text":"36. What is the most difficult situation you have had to deal with at work and how successful were you in dealing with it? \n\nAns: When I was working as head of finance in an educational organisation, I had to implement a 3 per cent cut in our annual budget across all departments, and it was my task to work out how this cut should be shared across all departments: whether some should bear greater or smaller reductions, rather than simply implementing a blanket cut. It was hard because I was new; it was an unpopular policy and everyone was trying hard to convince me that they should be spared from the burden of the cuts. I kept a clear head, undertook a thorough analysis of the previous year's cuts and potential income-generating activities in each department and I ensured that my decision was transparent and understood by everyone. I was not popular with all departments, but our finances improved in the following year, which really vindicated my actions."},{"id":38,"text":"37. What is the most satisfying aspect of your current job? \n\nAns: Managing to get a really major client on board to advertise with us has been a real thrill. We had tried several times in the past and they had always eluded us, but I must have put together just the right package and offered them the right price, because they are now a big source of income for us and the relationship with them is going really well."},{"id":39,"text":"38. Is there anything you don't like about your current job? \n\nAns: I have to confess that I don't like some of the routine paperwork, especially since, in my opinion, a lot of it could be replaced with an on-screen system. I have developed the attitude of getting it done quickly, so that it doesn't pile up or get behind and that's the way I?ve tried to make it more palatable, even if I can't say it's exactly exciting."},{"id":40,"text":"39. Describe a situation where you have had to deal with an angry customer/client/member of the public. How did you cope and what was the outcome? \n\nAns: My last company built some specialist software for a client to handle its database. The client kept altering their requirements and as a result we had not got the system up and running for them by the agreed date. As I was the sales consultant who?d dealt with them to begin with, it fell to me to placate them and it was not easy. I think being prepared to apologise straight away helped and I also arranged a deal where we offered some additional systems support _ a little more than had been agreed in the original contract. Of course, I got clearance to do this from my managing director."},{"id":41,"text":"40. What would you do if someone uncovered a mistake you had made? \n\nAns: If I was genuinely unaware that I had made this mistake, then I would apologise straight away and offer to do anything I could to put the matter right or minimise any negative effects that my actions had caused. I mean, if it meant apologising to a client, then I would do this rather than try to pass the buck or pretend it was not my fault. That's how I would want people who work for me to behave and I would set exactly the same standards for myself."},{"id":42,"text":"41. What would you do if you realised you had done something with potentially serious consequences for your employer? \n\nAns: Fortunately, this is not an experience I have had and I hope it never will be. If this did happen, then the first thing I would do would be to go and speak to my line manager and be really up-front about what I had done, or forgotten to do, and be as helpful and open as I could about the situation. I would try not to blame other people, but if I had been let down by colleagues in various ways, then I would have to be open about this too. I would certainly offer to do anything I could to rectify the situation. If there were systems failings that had contributed to the problem, then I might suggest changes. Fundamentally, though, if I were in the wrong, I would own up to it."},{"id":43,"text":"42. How do you go about building relationships with new work colleagues? \n\nAns: I think the key when you join a new group or meet other groups of colleagues is to listen and pay attention to what they say and what their concerns are. It is important to make some contributions, suggestions or comments fairly early on, but I don't express too many opinions until I have done some careful listening and reflected on what I have heard. Taking opportunities to be helpful is also useful: you get to know individuals and you find out about any problems, busy times and possible causes of stress."},{"id":44,"text":"00. PERSONAL INFO"},{"id":45,"text":"01. Tell me something about yourself? \n\nAns: Perhaps I should begin by telling you why I have chosen to apply to you for this job at this stage in my career and outline how my experience in my current and previous jobs relates to this post. I really enjoyed my degree course and being course rep made me realise I really enjoyed using my negotiating skills. That was something I was able to use in the first job after graduating."},{"id":46,"text":"02. What is your greatest achievement? \n\nAns: Being asked to manage the department I currently run has been extremely significant for me. I had been working there for only two years and I had assumed that someone with more experience than me would be asked. I had worked hard and put a lot of energy into developing and expanding our customer base. But I had not anticipated a reward coming quite so soon. The real achievement for me is that I have managed to do this and avoid resentment from other staff who might have assumed that they would be asked to do the job."},{"id":47,"text":"03. Can you elaborate on the interests you mention on your CV? \n\nAns: Well, I could begin by describing the sort of person I think I am, or at least how friends and colleagues would describe me and then I can give you a bit more about my history if that is helpful."},{"id":48,"text":"04. What is the most interesting thing you have ever done? \n\nAns: The six months I spent travelling, and especially the time I spent in India, was a completely new and different experience for me and made a lasting impression. As well as learning a lot about a different culture and seeing different sights, I learned to be a lot more observant and a lot more personally resourceful."},{"id":49,"text":"05. What are your three greatest strengths? \n\nAns: Dealing with people, keeping calm when people around me are getting agitated and finding imaginative solutions to problems. Imaginative solutions I have come up with have included using our office space more effectively; I think I have a little bit of a flair for design. I also developed motivation courses for junior staff because we were suffering from a rather high staff turnover."},{"id":50,"text":"06. If we asked a friend of yours to describe your character, what would they say? \n\nAns: I think they would say I am easy to get on with and outgoing. They would say I have a good sense of humour and am generally cheerful. I think they would also say I am good in a crisis _ I am often the person who gets telephoned or called on if someone has a problem."},{"id":51,"text":"07. If we asked one of your friends to pick out a weakness of yours, what do you think they might say? \n\nAns: I suppose they might say that I can sometimes be a bit impulsive _ I get very fired up by a new idea and sometimes a little frustrated if I don't get the chance to carry it through. The plus side of it is that I do have some exciting ideas and many of them do really work."},{"id":52,"text":"08. What would you say is your most significant fault? \n\nAns: Getting involved in other people's work. Because I do have considerable experience, colleagues quite often come to me for advice and I am happy to give it; but I have had to learn, and I really have addressed this issue, that it is still their responsibility, I mustn't try to take over. It stems from wanting to be helpful and wanting to see things done well, I suppose."},{"id":53,"text":"09. How do you cope with disappointment? \n\nAns: Of course, I don't like it, but I have learned to be philosophical. I was really disappointed when I didn't get into my first-choice university and yet I ended up enjoying myself and doing well. There is a real difference between disappointments that are beyond your own control and those where you can learn something and try to improve your situation. My disappointment over university made me start applying early to the companies that interested me so that I could avoid disappointment."},{"id":54,"text":"10. You say you are a ?people person?; what do you understand by this? \n\nAns: I mean I like being in an environment with plenty of opportunities to discuss ideas with other people and test out my ideas on them. In my current job there are five other people in my team and we are all motivated: our current project has been really successful."},{"id":55,"text":"11. Can you say ?no?? \n\nAns: If I think I have been asked to do something that is really beyond my responsibility or remit, or if I could do it but not within the timeframe that is expected, then I will say ?no?. It is better than agreeing to do something and then finding that you can't deliver or that you have to spend time renegotiating or getting behind with other work. People who have worked with me in the past have acknowledged that I only say ?no? when I really do have a good reason, not just to avoid work or to be unhelpful. I am always open to discussing something and trying to help find a resolution to a situation, though."},{"id":56,"text":"12. Are you easy to get along with? \n\nAns: I really enjoy working with other people and I don't find myself getting into confrontations. If I think trouble is brewing, I am likely to mention it pleasantly at an early stage. I managed to get a colleague who was always late to get to work on time by making a joke of it. I was not the manager, so I could not pull rank, but my method worked."},{"id":57,"text":"13. You have talked about your current and past jobs and what you got out of education, but you haven't said much about your interests. How do you spend your leisure time? \n\nAns: I would certainly say I was a very sociable person; I enjoy company and like entertaining or relaxing with friends. I suppose I have a pretty broad range of interests rather than one overriding passion, but I enjoy music of many different kinds _ I play a little bit of guitar, though nothing brilliant. I enjoy reading, especially modern fiction, and I take an interest in current affairs, especially those that affect my own local community, for example the plans to close down our local swimming pool."},{"id":58,"text":"14. You say you read a lot of non-fiction as well as fiction. What is the latest non-fiction work you have read and how would you recommend it, or not, to others? \n\nAns: I'm really interested in science, and it made me think much more critically and be more sceptical about articles that I read on the Internet. It was also very entertaining. I would certainly recommend it, even if you are not that interested in science; I think it could awaken interest and awareness."},{"id":59,"text":"15. I see that you play for your local football team. What sort of a player are you? \n\nAns: I usually play at least once a week and I suppose I'm one of the better players. I captain the team when our usual captain is away and I like to encourage young players."},{"id":60,"text":"16. I see you are interested in amateur dramatics. Do you think this will be useful to you at work? \n\nAns: Well, it has certainly given me a lot of confidence. I used to worry about public speaking, whereas now I really enjoy it. For instance, when giving presentations to small groups, I find I am quite good at holding my audience's attention and I have learned to use visual aids sparingly, rather than relying on them."},{"id":61,"text":"17. I notice that you are chair of your local tenants? group. How much work does that involve? \n\nAns: Apart from monthly meetings, which I chair, we are involved in meetings with the local council and other community groups to work towards improving the quality of life on the estate _ less litter, better street lighting, more activities for young people, etc. I was reluctant to take on the chair at first, but it is a role I have really got into now. More than the actual chairing of the meetings, I enjoy playing a leading part in some of the negotiations we are undertaking with the local council, and we have already had a successful result _ the street lighting is much better than it was six months ago."},{"id":62,"text":"18. Looking at your CV, your interests appear rather solitary: hill-walking, reading, etc. How do you think this reflects your personality? \n\nAns: I like to think they suggest a sense of balance. In my current post I spend a lot of time out meeting potential customers, and in the office we are a busy team of ten. I enjoy socialising, but it can be good to relax completely sometimes and do something different. In any case, hill-walking is something I quite often do in company."},{"id":63,"text":"19. If you were to take up a new activity, what would it be? \n\nAns: I have always liked the idea of sailing. I love swimming and the water and I like the idea of the challenge, having to think and plan according to weather and tides as well as the physical activity. It was my New Year's resolution to start this year and, as it is only February, I am determined to make it a reality."},{"id":64,"text":"20. What are your interests outside work? \n\nAns: I enjoy reading, music, films, theatre, most sports, travel, cooking, gardening and much more."},{"id":65,"text":"21. What would you do if you did not have to work for a living and had unlimited leisure time? \n\nAns: It's hard to imagine. It's something everyone says they would like, but when it came to it, it would probably be more difficult. I would certainly spend more time improving my piano playing and I would like to learn a foreign language _ I regretted dropping languages at school. I think I would have to become involved quite heavily in some voluntary community work, though, rather than doing things for myself all the time."},{"id":66,"text":"22. How good are you at dealing with people? \n\nAns: It is something I really enjoy. I like contact with colleagues and clients and would generally describe myself as a sociable person. I am good at getting the level of my communication right; it doesn't matter whether it is the finance director or someone who has come to fix the computer system."},{"id":67,"text":"23. So you spend a great deal of your time talking. Does this leave you time to get on with the job you are supposed to be doing? \n\nAns: I know, I did make it sound rather like that, didn't I? No, I take my responsibility for running the customer accounts section very seriously, but I have found that when you are chasing customers for money, you often get on better by being pleasant than by becoming the kind of person whose telephone calls they want to ignore."},{"id":68,"text":"24. How good are your writing skills? \n\nAns: My main strength is that my writing skills are adaptable. Through my course I developed academic writing skills, but they are obviously not what are required in business situations. I have been secretary for a local social club for a year or two, which means I am good at taking notes and also writing basic business correspondence. I don't just rely on the spell-checker on my computer, I'm quite happy to use a dictionary."},{"id":69,"text":"25. How good are your writing skills? \n\nAns: My business studies course at school meant we had to write business letters of various kinds and I always got good marks for those and for my English assignments. I am already the one in our family who ends up writing official letters if anyone needs to write them _ actually it's something I really enjoy."},{"id":70,"text":"26. What level and range of ICT skills do you have? \n\nAns: I am quick and efficient with Microsoft Word and Excel. I am more used to a PC, but I have spent a bit of time using Macs. Of course all the data systems at work are on computer; but I have a home computer, and keeping up with helping my children with their homework really got me interested, so I did an evening course 18 months ago."},{"id":71,"text":"27. Tell me something about your financial management skills.\n\nAns: I was always quite good at basic arithmetic and I find it easy to manage my own budget _ though obviously I wish it were a larger one I had to manage. I was treasurer for our local church f'te last year, and I maintained all the records in Excel as well as presenting the final figures to the committee."},{"id":72,"text":"28. How good are your numeracy skills? \n\nAns: I feel quite happy working with numbers, although I would not want to do it all the time. I can certainly make sense of spreadsheets: for example, I can examine my department's budget and understand it. I have often presented annual reports for my department where quite a lot of information is given as statistics, and I have never had any problem with this. How much time would you anticipate I would be working with figures in this particular post? Your advert mentioned that a reasonable facility with figures would be useful, so I would certainly expect it to form part of the job."},{"id":73,"text":"29. What are you like at speaking to a group of people, giving a presentation to a small or fairly large group? \n\nAns: I have been used to it ever since my student days. We had to present papers in seminars regularly and in all my jobs I have had to give presentations to groups of clients. At first, I found the larger groups more difficult, but I find that as long as I plan what I am going to say carefully, make sure I have good visual aids and stick to an agreed time limit, it goes well _ I prefer smaller groups, but that is because there is a greater opportunity for audience participation, discussion, etc."},{"id":74,"text":"30. Describe an occasion when you have had to be diplomatic.\n\nAns: It was actually a work situation and one member of staff was always complaining, to the extent that she got on everybody's nerves, but she was also incredibly sensitive and she was good at her job. I was not her manager, so it was not a case of using authority. I did have to be as tactful as I could, but I began by asking her how she thought her actions might affect others and we took it from there."},{"id":75,"text":"31. What is the most recent skill you have acquired? \n\nAns: I have done a short course in Spanish because we have a lot of dealings with Spanish-speaking countries. I could not say I am fluent, but it has increased my confidence and given me a taste to learn more."},{"id":76,"text":"32. Have you ever done anything entrepreneurial? \n\nAns: When I was a student I had been doing one or two dog-walking jobs and thought there might be other animal-care needs out there. I leafleted the area, offering holiday services looking after cats, fish ponds, rabbits, etc. It was quite successful and fitted in well with the summer holidays. Because I had already done the dog-walking, it was easy to get good personal references."},{"id":77,"text":"00. CAREER PATH"},{"id":78,"text":"01. What has been the most significant influence on your career decisions so far? \n\nAns: I really wanted to be able to apply some of the scientific research skills I had acquired on my course, but I did a placement in a technical laboratory and it made me realise I also wanted to work more directly with people. Being able to combine those two factors has been a strong influence on my decisions. Environmental health draws on all my interests as well as my strengths and experience."},{"id":79,"text":"02. Have your career aspirations changed much over the years? \n\nAns: They have certainly developed and become more ambitious. When I was at school I had a vague idea that I wanted to do something connected with business, even though at the time it was a fairly nebulous concept to me. My business studies degree and my two years with my current company have refined my interests and I am strongly drawn to corporate finance. I am a good communicator, especially when it comes to handling negotiations _ I worked with the mergers team for my current employer."},{"id":80,"text":"03. What has brought about this change in career direction? \n\nAns: I have really enjoyed my years in marketing and I learned a lot working my way up from the bottom. Part of my role has been to select and organise training for a few new entrants to our department and I have begun to realise that I was enjoying this as much as or more than the marketing side. I have had a good success rate in retaining good staff, so a move towards human resources seems very natural."},{"id":81,"text":"04. You say you know a job in advertising is right for you. Why? \n\nAns: When I was still at school one of my projects involved helping design programmes for a fundraising day for the school and I got very interested in the look of the programme and what would make people want to buy it. After that, I managed to get a few days? work experience with an ad agency and that showed me how much more there is to it behind the scenes before an ad ever appears on TV, in a magazine, or on a poster. Most of my employment has been in sales, but always with a view to getting into advertising and capitalising on the communication skills the sales jobs have developed. I am fascinated by what makes customers (including me) choose particular brands; what are the selling points that people go for?"},{"id":82,"text":"05. Why do you want to go to medical school? \n\nAns: I suppose to begin with it was something of a fantasy career, something I had always said I would do. Actually, all through school I was very strong on the sciences, but interested in people and social issues too and, more and more, medicine has begun to seem like a really suitable choice for me and one that I feel highly committed to. I have done some voluntary work at my local hospital and, although that isn't medical experience, I feel quite comfortable in the hospital environment and enjoy talking to patients."},{"id":83,"text":"06. How do you think you would handle the stress, the emotional side of the work, dealing with people who are very ill or dying, breaking bad news to them? \n\nAns: I know that would be difficult and that I haven't yet been tested in those types of situation, but I know just from my own limited experience of being a patient with minor complaints how being listened to and having things explained carefully helps. I hope that during my training I would learn to cope better and better with painful situations, without losing an attitude of caring about patients and being interested in them as people. I would really like to be able to use the fact that I am strong on sciences in a socially worthwhile context."},{"id":84,"text":"07. You say you are interested in a career in investment management. Explain your understanding of what investment management entails.\n\nAns: My understanding is that I would be managing funds for corporate and private clients, researching the performance of particular funds and reporting on those funds. I know that as well as my report-writing and research skills I would have to be decisive, knowing when to buy, when to sell and when to just stay put for the time being. I like taking decisions; I do weigh up pros and cons, but I do it quickly, even if it is a simple thing like choosing a holiday destination or a car."},{"id":85,"text":"08. How did you reach your decision to become an occupational therapist? \n\nAns: For some time I had been considering a career in medicine, and at school I was not aware of much beyond nursing or becoming a doctor. Then through visiting a relative in hospital I came into contact with physiotherapy and occupational therapy and began to look at the two carefully, talking to people in both professions. I like the amount of community work, home visits and the chance to support patients in so many aspects of their lives that occupational therapy provides. I love working with different people; it is a profession where I think I would be very happy and where I could give a lot."},{"id":86,"text":"09. What skills do you think a teacher needs? \n\nAns: To enjoy working with young people and to have an infectious love of their own subject. I remember from my own time at school how easy it was to tell whether a teacher really enjoyed what they were teaching, and I certainly learned much better when they did. I don't think there is just one personality type who is successful, but you need to be a strong person, assertive and fair without being a bully. Respecting your students is important too. I have done a fair bit of community work with teenagers and I find my sense of humour goes a long way in building up good relationships."},{"id":87,"text":"10. How do you stay well informed and up to date on what is happening in your field? \n\nAns: I am an active member of my professional association; I was area secretary the year before last. As well as attending meetings and seminars I have run some training sessions myself. It's a real incentive to keep current if you are going to start imparting information to other people. I enjoy my profession; I see it as an interest as well as a career, so reading and discussing developments and issues is never a chore."},{"id":88,"text":"11. How do you stay well informed and up to date on what is happening in your field? \n\nAns: I always read relevant articles in the press _ well, on the Internet now _ this is a great way to keep informed about what competitors are doing."},{"id":89,"text":"12. Have you taken advantage of any staff development or training activities over the past 12 months? \n\nAns: I have attended several conferences on long-term care to keep myself up to date with issues in the sector and I have also been on a team-building course, as well as two customer-care courses. I try to take advantage of courses and conferences when they are on offer; you learn so much from networking as well as from the events themselves."},{"id":90,"text":"13. What training needs, if any, do you have at the moment? \n\nAns: I feel really comfortable about taking on this job straight away, but I am delighted to see that you run staff induction programmes _ it always helps to get a quick overview of everything that is going on. Longer term, I would be interested in marketing training _ I have seen some excellent short courses advertised."},{"id":91,"text":"14. How would you recommend your profession to someone who is considering joining? \n\nAns: I still find lecturing extremely satisfying, always dealing with new groups of students, human nature coming up with an infinite variety, and I like my subject. I would have to warn anyone considering entering it now that it is very competitive and hard to get a permanent contract, so they would have to be resilient as well as enthusiastic."},{"id":92,"text":"15. How do you think your profession will change in the future? \n\nAns: I know the Internet is already really significant, but I am quite sure it will become even more so, especially as a way of making direct contact with current and potential customers. I know people talk about 'the paperless office? and it never seems to happen, but I think with a customer base like ours, we are heading that way."},{"id":93,"text":"16. Tell me why you chose to go to university after you had been working in retailing for 15 years.\n\nAns: Most of all, because I wanted to. At the back of my mind I had always regretted not staying on at school and continuing with my education. I had been successful in my retail career; I started as a junior assistant and I was manager of a large branch before I went back into education. I also believed it would help me make the break into another business and move away from the retail trade."},{"id":94,"text":"17. How difficult did you find it returning to education as a mature student? \n\nAns: It was hard at first and I certainly missed the salary. I had the idea that most of the course would be full of young students who had just left school but, as it turned out, there was a very broad mix on my course. I found a lot of my work and life experience was relevant to issues that we discussed on the course, and I was often able to give real examples of situations, rather than relying on textbook answers."},{"id":95,"text":"18. Before you did your degree, you were working as a nurse and now you are applying for work in management consultancy. How do you explain such a change of direction? \n\nAns: I don't regret the seven years I spent in nursing, but I believe I made a career decision before I was ready and as the result of considerable family pressure. My years in nursing have not been wasted. I developed excellent interpersonal skills, coped with stress and worked well under pressure; I also acquired good administrative skills and experience in training and managing other staff. There are so many problems to be solved when you are dealing with people and their health, and I am sure seeing your way to the heart of a problem is something that will be immensely useful to me in management consultancy. I think my calm attitude and common-sense approach would go down well with clients."},{"id":96,"text":"19. Journalism is extremely competitive. Your background in engineering is, to say the least, unusual, so what makes you think you could succeed in this profession? \n\nAns: Before I trained as an engineer I had considered technical journalism as an option. I always did well in English as well as the technical subjects at school, but I was very drawn to designing and producing something tangible rather than talking about it. As I have progressed at work I have looked far more at the trade press and often thought I could write a more readable article than some of the material I have come across. I have had articles published in a motorcycle magazine and several of my letters have appeared in the local press and occasionally the national press. My CV outlines my IT skills and I know how important they are in journalism today."},{"id":97,"text":"20. How do we know this change of career direction won't be just a passing phase?  You might have another change of heart after we have invested time and money in your training and progress.\n\nAns: I have used IT a great deal in my current and previous jobs and, although my job description might say ?administrator?, I am always the one in the office who troubleshoots if we have problems with the computer side of things, and if I can't solve it I liaise with our technical department. I usually end up training new staff on our systems too. I think I have already made the career change by stealth, but obviously I would like a job where I could develop these skills to a higher level. My interpersonal skills are also good and I think this is a skill that is sometimes neglected by staff working mainly with machines and electronic systems."},{"id":98,"text":"21. Would you honestly have considered work in this field if you hadn't been made redundant? \n\nAns: It is true that sales is a new direction for me, but I am very keen and I certainly get on well with people. Being a good supervisor means getting people to do what you want without bullying them and I guess in some ways sales might be similar to that _ you want a customer to buy your office supplies, but you want them to feel it's a good decision that they have taken themselves. Having a practical and technical background also means I would be confident demonstrating anything I was selling. I am not saying I was pleased to be made redundant, but a move like this could be good for me and, of course, for my new employer."},{"id":99,"text":"22. It sounds as if you are disillusioned with your career in social work/electronics/health and safety. Is there an element of you running away from it rather than actually making a positive choice now? \n\nAns: I am sure there is an element of that, but that means I have had to think very hard about this change and that I feel really motivated. I am making a carefully reasoned and, I think, wise decision about what I should do next. The skills I have acquired and the qualities I have developed have changed me enormously over the past ten years and I know there are parts of me that are not being used half as effectively as they could be."},{"id":100,"text":"23. How do you feel about having to start at the bottom again, becoming a trainee, when you have had considerable responsibility in your last job? \n\nAns: I don't mind at all. I have always been interested in book publishing, in anything to do with books really, and the years I spent in teaching have given me a discerning eye when it comes to spotting a good educational book. I am sure I shall enjoy my training and learn quickly, and I see it as a really exciting opportunity."},{"id":101,"text":"24. Because of your limited experience in this field, we couldn't pay you what you are being paid in your current accountancy job. How will you handle taking a drop in salary? \n\nAns: Well, at least my accounting experience means I am good at making the best of any budget and, of course, I looked very carefully at the financial implications of my decision. I hope my contribution to the company will mean my salary is reviewed in the not too distant future, but I can definitely accept the job on what you are currently able to offer."},{"id":102,"text":"25. If you were starting your career all over again, what would you do differently? \n\nAns: I am very happy with the way my career has turned out, and my current job in the legal department is a position where I find almost all aspects of my work interesting and enjoyable. I suppose that if I were starting out all over again I might choose to commit to a career connected with commercial law earlier than I did. It was hard work taking extra qualifications part-time. Apart from that, I don't think I would change anything."},{"id":103,"text":"26. You have never worked for a small business before; give me three reasons why I should offer you the job.\n\nAns: I have plenty of ideas about how you could develop your export base; I love working with people and I am sure I could help you be more profitable."},{"id":104,"text":"27. You have worked in local government up until now; do you expect things to be very different in this private engineering company? \n\nAns: I enjoyed my design work and I was always working to tight deadlines and working within strict budgets, but I do expect a bit less paperwork and more time to put into the design side of things. I think if you are part of a good and motivated team, which I was, that is actually more important than which sector you are working in."},{"id":105,"text":"00. CLIMBING THE LADDER"},{"id":106,"text":"01. How far do you intend to go with this organisation? \n\nAns: All my previous research and the impression I have gained today have confirmed my interest and enthusiasm for this job. I do feel that I am at a point in my career where I would really like to develop with one company, so I would like to go as far as I possibly can. At this stage, I would be very happy if you offered me the post of project manager; I think I could handle this very well for you. I would like to think that, with greater understanding of your company from the inside, I could progress to the most senior levels of management. I don't feel too impatient, though; your current projects look demanding and interesting."},{"id":107,"text":"02. How did you get your first job? \n\nAns: I qualified just when the job market and the economy were at a real low point, so I had to make a lot of applications, email dozens of CVs and make what felt like hundreds of telephone calls, though it probably wasn't that many. Eventually I got into a local law firm by offering to do some voluntary work, just photocopying, taking over on reception, that sort of thing, but they ended up taking me on and putting me through the rest of my qualifications."},{"id":108,"text":"03. What salary are you expecting? \n\nAns: My current salary is x million and I do expect to better that when I take up a new post. Looking at your job description I see the job with you as having more responsibility _ that is one of the key reasons I have applied for it. Given the current market and my experience I would hope to be paid in the region of n million."},{"id":109,"text":"04. Are you looking for a temporary or a permanent job? \n\nAns: As I would be leaving a permanent job, I would really prefer to move into something else permanent, especially something like this where there seem to be real opportunities for me to develop with the organisation. Now that I have passed all my professional exams, I would really like to commit to a company that I like and stay there for the foreseeable future."},{"id":110,"text":"05. Are you looking for a temporary or a permanent job? \n\nAns: I would be quite happy with a temporary post at the moment. I think it would be a good opportunity for me to get a bit more experience in market research. If things worked out well from your point of view and mine, and something permanent were to be on offer in the future, then I would certainly consider applying for it."},{"id":111,"text":"06. Are you looking for a temporary or a permanent job? \n\nAns: I would like to move out of supply teaching and into a permanent post now. I have learned a great deal from working in different schools and I have worked in some that face real problems as well as some that are doing well. Establishing rapport with classes quickly and maintaining discipline is really good experience. Having been round the school today, the atmosphere is really excellent and I would love a permanent post here."},{"id":112,"text":"07. Why have you decided to leave your current job? \n\nAns: I am still enjoying my work and my last appraisal suggested I am ready to take on more management responsibility, but it seems unlikely that the business will grow for the next year or two _ I don't want to get into the position where I am just coasting."},{"id":113,"text":"08. What could you do to make your job more interesting, then, if you are saying it isn't really challenging you? \n\nAns: I have already taken some measures. I have volunteered to take on more responsibility for staff training and I recently initiated a new customer satisfaction survey, but I still feel I could be doing more, especially in managing and motivating larger sales teams."},{"id":114,"text":"09. What could you do to make your job more interesting, then, if you are saying it isn't really challenging you? \n\nAns: I had anticipated and been told that a major part of my current job would involve redesigning, developing and maintaining the organisation's website _ this was what really grabbed me about the job and also what my qualifications and my previous job had prepared me for. I was quite happy to help out with other administrative tasks within the department _ I accept that we all need to help out _ but administration has ended up taking up about 70 per cent of my time; the website seems to be a low priority and I don't want to lose my skills through lack of use."},{"id":115,"text":"10. What could you do to make your job more interesting, then, if you are saying it isn't really challenging you? \n\nAns: I hadn't been planning to leave; it is only when I saw this position advertised that I really felt it was an opportunity not to be missed. I really welcome the idea of being able to use my writing skills as well as my IT skills _ they are my major work interests _ so I just had to give this one a go."},{"id":116,"text":"11. How do you react if a colleague criticises your work? \n\nAns: It depends how valid I believe the criticism to be and to some extent how it is put to me, but I do listen to the point being made and try not to be too sensitive. I like to share ideas and suggestions with other people and sometimes what seems like an adverse comment has taught me something very useful."},{"id":117,"text":"12. How do you react if a colleague sends you an e-mail that you consider to be discourteous? \n\nAns: That's interesting, because I think people often are more careless or less considerate when firing off e-mails than in the days when you had to compose a memo. On the whole, though, I try to brush off minor discourtesies while remaining polite myself. If the issue became serious, e.g. harassing or abusive, I would obviously have to take the matter further."},{"id":118,"text":"13. How do you react if you don't get your way over a work issue? \n\nAns: It would depend on how crucial I think that issue is to our business. One of our senior managers wanted to bring in changes that would have altered everyone's jobs and responsibilities and I felt that this would actually mean a far less effective service to our clients with a lot of specialist knowledge being lost. I was very much against the idea, but I put my arguments down thoroughly, and I hoped quite persuasively, on paper so that management would have ample opportunity to consider my point of view. To my delight it worked and the plans were shelved. Of course, it does not always work in my favour like that, but I know I can make a persuasive argument when I have to and I can also accept the decisions of others if necessary."},{"id":119,"text":"14. When did you last lose your cool at work? \n\nAns: Not since I was very new and inexperienced. I have learned to be firm without blowing my top and I think it sets a poor example when any staff, but especially senior managers, are out of control."},{"id":120,"text":"15. When did you last lose your cool at work? \n\nAns: The day a new computer system failed to do what it had been designed to do. I had had no part in the commissioning, but I was not the only one who was really frustrated. It has taught me to ask lots of questions at a very early stage in any project planning."},{"id":121,"text":"16. What do you think of your current manager? \n\nAns: She is very effective, especially at delegating the right tasks to the right people and I have learned a lot from her. If I were to make a criticism it is that I think she could achieve more by involving wider groups of staff in consultation before decisions are made _ sometimes she loses goodwill from an otherwise highly motivated staff team."},{"id":122,"text":"17. What do you think of your current employer? \n\nAns: As an employer, they are fine and I have no complaints, but I would like to see them being a little more imaginative about the range of fashion clothes we sell. Working on the buying side, it can be frustrating when you feel you have good ideas and there is not really an outlet for them. Of course, you have to accept that not all your ideas will be good ones, but our sales figures were not brilliant for last year, as you know, so we do need to do something."},{"id":123,"text":"18. How do you maintain your interest in your current job? \n\nAns: Quite easily. I am working on several accounts each for different clients and so my work has a lot of variety, both on a daily and on a more long-term basis. No two accounts are ever the same even if, in theory, the process that you go through is almost identical."},{"id":124,"text":"19. Tell me about a work target you have set yourself.\n\nAns: It sounds simple, but a few months ago I decided I would always complete relevant paperwork at the end of the day, even if it made me a bit late. It has made a real difference to my level of energy and I have become far more productive. I am trying to spread this good practice among colleagues now."},{"id":125,"text":"20. Tell me about a work target you have set yourself.\n\nAns: I noticed that some people weren't saying anything at our section meetings, so I decided to make a point of asking everyone something, without making them feel too put on the spot. I set it as my objective to get everyone to contribute. It has worked well, though I think one or two quieter members of the team found it a little daunting at first."},{"id":126,"text":"21. What is your current salary? \n\nAns: At the moment I am paid x million though if I remain with my current employer I am expecting an increase in three months? time. Pay rises are linked to annual performance reviews and I have received an increase every year so far."},{"id":127,"text":"22. What is your current salary? \n\nAns: I currently receive x million but I would hope to better that if I were to be offered a post here."},{"id":128,"text":"23. Do you think you are being paid enough? \n\nAns: I know that what I am paid equates favourably to others on a similar level in my profession, but I am prepared to put in extra time and extra effort and I believe it is reasonable that I should be rewarded for this."},{"id":129,"text":"24. Do you think you are being paid enough? \n\nAns: Not really. I took on the position at a fairly low salary because at that stage I did not have much direct experience in the field, but I caught up quickly and I have a good track record. I intend to negotiate for more money if I remain in my current situation and I expect a degree of success in my negotiations."},{"id":130,"text":"25. Where do you see yourself in three years? time? \n\nAns: As I have only just entered the physiotherapy profession, part of me would like to keep my options open, learn as much as I can and gain from the different specialisms I shall come into contact with over the coming years. I really enjoyed my work on neurology during my training, so that may be a direction I choose. Management does interest me in the longer term, but I want several years of working with patients before I move in that direction."},{"id":131,"text":"26. Where do you see yourself in three years? time? \n\nAns: This is a lively and expanding company by all accounts, and from what I have learned so far I very much hope that I shall still be here in three years? time. I chose to apply for your customer operations division because it seems to me a great way to learn a lot about your services, your customers and your finances. I do, however, have an open mind about moving into other divisions, if this helped me learn more and prepared me more effectively for senior management."},{"id":132,"text":"27. What do you want out of this promotion? \n\nAns: Of course, I want the opportunity to take on more responsibility but, specifically, I know that a job at this level will mean more opportunity to contribute to decisions. I like the fact that the job would require me to get involved in strategic planning. My past project-planning experience will prove very useful in this respect."},{"id":133,"text":"28. What do you want out of this promotion? \n\nAns: I know this job will involve less direct contact with customers, but I think I can serve our customers better by taking responsibility for training other staff in customer care and for developing policies that enhance customer support. I have enjoyed my customer contact and used it to learn about what they see as good service and what really irritates them _ I would love the chance to act on this. I can give you some ideas if you like"},{"id":134,"text":"29. We have several internal applicants for this post. If we do offer you the job, how would you cope with any possible resentment from these disappointed candidates about an outsider being brought in? \n\nAns: Whenever I take up a new job, I try to listen and learn, so that I get a good idea of what the issues, problems and personalities are in the team that I am working with. I would certainly adopt a professional approach to everyone I worked with and, of course, I would hope that other staff would do the same. On the other hand, disappointment can be hard to cope with and if resentment seemed to be affecting the way someone worked, or the way we worked together, then I think I would have to talk to him or her about it and offer reassurance and encouragement. If their behaviour became totally unreasonable, then I might have to consider other approaches."},{"id":135,"text":"30. You are probably aware that two of your colleagues have applied for this job. If you are successful, how will this affect the way you work? \n\nAns: It won't, at least not in my attitude to working with them, and I would hope we would all take that approach. If I take on the job I would use the opportunity to ensure that everyone in the department was motivated and getting a chance to take on tasks and responsibilities where they excel. I am sure this would help smooth any ruffled feathers."},{"id":136,"text":"31. What new ideas would you bring to the job that other candidates would not? \n\nAns: I would spend some time getting to know the department, so that I could assess what was already working well, but also see whether there were areas where we could be more efficient. My recent management diploma gave me the opportunity to look closely at how to get the best skills mix in work groups, getting better results for the company and higher job satisfaction among staff members. I see that you do have project groups within the department, so some of my ideas could be very effective here."},{"id":137,"text":"32. What new ideas would you bring to the job that other candidates would not? \n\nAns: I became good at finding creative solutions to problems both logistical and practical when I did two years of voluntary service overseas. Quite often it was impossible to get either the equipment or the personnel that you would ideally have liked, so you just had to work with whatever was available. I was involved in building projects, so obviously we could not compromise on safety, but I certainly learned to be flexible."},{"id":138,"text":"33. How do you handle disciplining a staff member? \n\nAns: It is a situation I have had to deal with in my current job where I had a staff member with a very poor time-keeping record. We tried to be flexible because of his domestic situation, but being flexible is very different from allowing someone to take advantage. I would be as firm as was necessary, double-check the rules and regulations and legal situation before I jumped in, but I would also be sure I was being fair. Where necessary I would consult with other appropriate staff."},{"id":139,"text":"34. You haven't been in your current post very long. Do you think you are ready for this promotion? \n\nAns: Of course; I feel confident and very excited about the prospect of becoming a deputy head. I may not have been in teaching for that many years, but I came into the profession as a mature person, with considerable work experience behind me. Also, having my own children in school before I started teaching has given me a well-grounded understanding of the issues that face the profession, the changing demands and pressures that we face. I believe I am the kind of leader who draws colleagues with me, rather than one who pushes them from behind."},{"id":140,"text":"35. How will you feel if you don't get this promotion? \n\nAns: Naturally it will be a disappointment _ it is something I really want, I feel ready for it and I think I have had plenty of experience in all aspects of the hotel business and this particular hotel. However, I still enjoy my current job as deputy manager so I don't imagine I would immediately become disillusioned and lose interest in my work."},{"id":141,"text":"36. Why haven't you applied for something at this level before? \n\nAns: I did think about it a year or two ago, but there was a project I really wanted to see through to the end and I was still enjoying what I was doing. In fact, I still am, but I really do want to manage a larger team now."},{"id":142,"text":"37. This position would make considerable demands on your qualities as a leader. What would you say is your leadership style? \n\nAns: I am a strong leader and I suppose I would describe myself as a bit of a shaper, good with new ideas and quick to spot how to delegate effectively and take on appropriate work myself. I have learned a lot about my management style from working on joint projects with managers of other departments where I have had to work in a more cooperative way. This has been useful: I am still a strong leader, but I have learned the value of consultation and of making the best use of the skills every team member has."},{"id":143,"text":"38. This job looks quite similar to the one you are currently doing _ why have you applied for it? \n\nAns: It is true that your job description looks quite similar to the one I am working to at present, but I really don't believe any two jobs are the same: different customers, different projects and different approaches. I am ambitious, but I believe one of the ways to realise that ambition is to gain a thorough understanding of the business first. I see this move as a very exciting one."},{"id":144,"text":"39. What motivates you in your current job? \n\nAns: I chose to become a healthcare assistant because I believed I would enjoy working with people and I liked the idea of working in a healthcare setting. I did not have many formal qualifications, and my previous work experience had been mostly in retail. In retail, I liked dealing with customers, but I wanted to do something where I worked more closely with people and felt I was helping them. I really enjoy my work; although a lot of the time I am giving physical care, you get to know patients and sometimes have a bit more time to talk to them and make them feel better, whereas some of the professional staff simply don't have time for this. I do like working as part of a team too. I have taken my first healthcare qualification and in time I would like to take more qualifications."},{"id":145,"text":"40. We are seeing several candidates today. What makes you stand out from the others? \n\nAns: All my qualifications and experience relate directly to what your job description says you require but, more than that, your plan to expand into Europe ties in very well with my recent spell in Paris. The staff I have met here today and this interview have convinced me that I would fit in extremely well here and would really enjoy it, which is always a great motivator."},{"id":146,"text":"41. Give me the three main reasons why we should give you this job.\n\nAns: As I already manage a health centre with real success I can certainly demonstrate that I can do the job. In addition, I am good at coming up with and acting on new ideas. For example, I developed a scheme where more of our patients could access different complementary therapies and yet this had little effect on our overall budget. Team skills are one of my real strengths. It is so easy, when several groups of professionals are involved, for work situations to become divisive or competitive in an unhelpful way. I am good at fostering understanding and cooperation between different work groups. On top of those reasons, I am really enthusiastic about this post; I would put a great deal of energy into it."},{"id":147,"text":"42. Would you take this job if we offered it to you? \n\nAns: Yes, definitely. I was keen as soon as I saw your advert and your job description fits my skills and experience very well. More than that, actually meeting potential colleagues and finding out more about your current activities has clarified what an exciting challenge it would be to work here."},{"id":148,"text":"43. Your CV looks good, but we have several people on our books who are just as well qualified _ what makes you stand out? \n\nAns: I think the fact that I have worked for both a large and a very small firm has given me a really good perspective on getting the best out of people and spotting small problems before they become large ones. I noticed, for example, that several small customers left us when we changed our IT system, so we were quickly able to encourage them back again."},{"id":149,"text":"00. YOUR PAST"},{"id":150,"text":"01. You have requested us not to approach your current employer for a reference. Why aren't you happy for us to do this?\n\nAns: My current company may be looking at some cost-cutting measures and if they think I am looking elsewhere I may turn out to be one of them. I am quite happy with my work there, but I have been at that level for two and a half years now and I think the job you are offering is ideal. I feel sure I would enjoy it, but I can't guarantee that I shall be the successful candidate and I don't want to unsettle things with my current firm at present."},{"id":151,"text":"02. Have you ever been asked to resign?\n\nAns: No, but I have come close enough to it to resign of my own accord rather than waiting to be asked. We had undergone a restructuring with a new manager; we had very different ideas on how the department should develop. I had worked successfully and productively there for ten years. I knew that cost-cutting and streamlining measures were on the cards and I just had to accept that I was not flavour of the month. It was hard, but it was a useful lesson and I spent an interesting 18 months working as an independent consultant."},{"id":152,"text":"03. Have you ever been asked to resign?\n\nAns: Yes. It was the first job I had after I left school. I really wanted to get into anything to do with cars and somehow I ended up working for an insurance company _ I don't think it was ever going to work out. With hindsight I could have adopted a more mature attitude to my work. It taught me a lesson though _ I hated being out of work."},{"id":153,"text":"04. I see that you got very good GCSE results and yet your A-level results are poor. What happened?\n\nAns: I was unsure of whether I wanted to stay on at school and do A levels; it was something my parents pushed for, but my heart was not really in it. I had become too interested in other things and I just didn't put in the effort I should."},{"id":154,"text":"05. Can I take it, then, that if you don't like something, you stop working hard at it? What if we give you a job and you find there are parts of it you don't enjoy?\n\nAns: I have had a good work record for the past three years since I left school and I have had no difficulty in handling routine and repetitive tasks during that time. I have grown up a lot since I was 17 and I seem to learn better at work, rather than in a school environment. I am doing an evening course in website design though, and I am really enjoying that."},{"id":155,"text":"06. There appears to be an eight-month gap on your CV. What were you doing during this time?\n\nAns: I had been temping for the previous two years and I really wanted something with more of a sense of direction. With hindsight, I might have done better to wait until I had something permanent before I gave up the temporary work, but I really wanted to concentrate on my job search and concentrate on it 100 per cent. I wasn't expecting the job market to plummet so badly during that time. I got my act together by doing a short, intensive course in secretarial skills and was very pleased to get back into the work environment."},{"id":156,"text":"07. From your CV, it looks as if you have taken six years out of the job market. How do you think you will fit in coping with the routine and the demands of work?\n\nAns: Yes, I took a break from paid work to have my children and see them settled into school. I have not had salaried employment for the past few years, but I have actually been working very hard. Bringing up a family has ensured I can deal with the unexpected as well as the routine and I often work a much longer day than I did when I was in paid employment. Besides, I certainly haven't forgotten all the skills I used in the drawing office. I keep up to date with the relevant trade press and, more significantly, by doing some drawing work for friends."},{"id":157,"text":"08. Yes, I took a break from paid work to have my children and see them settled into school. I have not had salaried employment for the past few years, but I have actually been working very hard. Bringing up a family has ensured I can deal with the unexpected as well as the routine and I often work a much longer day than I did when I was in paid employment. Besides, I certainly haven't forgotten all the skills I used in the drawing office. I keep up to date with the relevant trade press and, more significantly, by doing some drawing work for friends.\n\nAns: Getting some kind of work was more important to me than anything else. Actually I learned a lot about myself, how much I enjoy imparting information to people. I also discovered some gaps in my knowledge and experience, especially about working under pressure; there is not one job I have done that has not taught me something, even if it is only never to do that kind of work again."},{"id":158,"text":"09. I see that you were made redundant by your last employer nine months ago. How have you coped with this?\n\nAns: It was not a complete surprise because the company had been in financial difficulties for a while and many of us were aware that our jobs might be under threat. Nevertheless, it was a shock and very hard at first. I?ve always been someone with an optimistic attitude, but this field is competitive. I enrolled on an IT course to give me some new design skills very soon after I lost my last job and I have also been doing some voluntary work for my local secondary school, helping with computer skills classes. My CAD skills have certainly developed significantly since leaving my last company and I am very eager to get back into full-time work."},{"id":159,"text":"10. You don't think you will have lost a bit of your edge and slipped out of the work routine during that time?\n\nAns: Quite the opposite. I have filled my time constructively and increased my skills, but I really enjoyed work. I think my energy levels and enthusiasm are on top form and I intend for them to stay that way."},{"id":160,"text":"11. I notice that you were made redundant after only eight months in a previous post: why do you think this happened?\n\nAns: It was basically a last-in-first-out policy and the company folded completely six months after I left. It was a pity; they had had some good ideas and our design team worked well together. It was the smallest company I had worked for and I gained a lot from having to be very flexible."},{"id":161,"text":"12. You have changed jobs frequently in the last few years. Does this mean you get restless if you are in any job for a considerable length of time?\n\nAns: Some of my recent moves have been because I have needed to relocate to different places for personal reasons. I am now settled here and have bought a property. Of all the jobs I have done in the past three years, I really enjoyed my work at the finance company. I have very good references from them and the work I was doing looks very similar to the responsibilities you list in your advert and job spec."},{"id":162,"text":"13. You have changed jobs frequently in the last few years. Does this mean you get restless if you are in any job for a considerable length of time?\n\nAns: Many of those jobs were temporary anyway and my employers in those situations were not expecting me to stay long, for example when I was providing Christmas or holiday cover. I did not want to commit myself to a career until I was more sure of the direction in which I wanted to go. My temporary job in the local planning department gave me my first real involvement with work that touched on environmental issues, and I have done a great deal of voluntary work with urban and rural environmental improvement projects, so I hope that demonstrates my enthusiasm and commitment to a career with your organisation _ it feels like the opportunity I have been waiting for."},{"id":163,"text":"14. You have changed jobs frequently in the last few years. Does this mean you get restless if you are in any job for a considerable length of time?\n\nAns: In an ideal situation I would not have chosen to change jobs so often, but at the moment it has been easier to get short-term contracts than anything permanent. It has certainly meant I get up to speed in new situations very quickly, but I would prefer a more secure situation and the opportunity to gain more management experience."},{"id":164,"text":"15. How have you motivated yourself to keep looking for work since you were made redundant?\n\nAns: I have tried to build a lot of structure into my job hunting and the most important thing I have done is to keep in touch with a regular network of contacts. This not only keeps my name out there, it also keeps me in touch with any new developments and ideas. That is how I heard that you may be looking for someone with my experience."},{"id":165,"text":"16. What is your time-keeping like?\n\nAns: Good, I am usually the first to arrive in the mornings and I dislike being late for a meeting, training session or anything. I think you owe it to your colleagues as well as your manager to be punctual."},{"id":166,"text":"17. You left your last job without having another one lined up to go to. Wasn't that a bit risky?\n\nAns: Yes, I suppose it was, but I had never intended to stay in sales for that long and it felt like the right decision. There had been a lot of change there recently and very few staff were happy. It takes a great deal for me to become discouraged. But I felt my wisest option was to leave and start looking for something else. The sales work was useful, especially dealing with people and working under pressure _ two things that I have become very good at. I'm sure they would be valuable in your customer-support department."},{"id":167,"text":"18. One of your references suggests that you sometimes lose your cool in the office. What is your reaction to this?\n\nAns: It has happened very occasionally, but I have always been quick to apologise if I have been unreasonable and it has certainly never happened in front of a client. I am aware of it, so I make an effort to keep calm and explain what is annoying or frustrating me. I think most of my colleagues would say that, although I can be a little volatile, I am a helpful and supportive member of the department for the vast majority of the time."},{"id":168,"text":"19. You work for a company that has been involved in secret merger talks with another company. You are aware of this because it is your job to know, but you don't have any authority in these talks, or this deal. You are the last person in the office and you get a call from a member of the financial press saying that they have heard that this merger is taking place. What would you do?\n\nAns: I would say that they would have to speak to one of the directors of the company and that unfortunately none of them was available at the moment. I would check the diaries and give them the earliest possible time when they could call back. If they pressed me, I would simply repeat my previous answer very calmly and very politely."},{"id":169,"text":"20. You run the research and development section for your company and you have one designer in your section who is brilliant at his job, but very difficult to work with, unpredictable, bad-tempered and unable to conform to the company rules on many occasions. Yet there is no doubt he helps you make a lot of money because on a good day his ideas are brilliant. How do you deal with this?\n\nAns: I would have to look at whether we were losing other good staff because of him, how likely he would be to join one of our competitors if we got rid of him but, most importantly, whether there were things we could do to get him to work more effectively as a member of the whole team. I would start by talking to him and possibly involving the human resource department in this discussion, and together we would all agree clear targets for improvements with a specific review period. I might also offer training and support if this seemed appropriate."},{"id":170,"text":"21. current affairs questions\n\nAns: How would you improve the public transport system in this town/city? \n\nWhat steps would you take to integrate the student population more effectively into the local community? \n\nIf you were suddenly given a million pounds to spend on improving this town, how would you spend it? \n\nHow would you encourage more young people to continue with their education? \n\nDo you think people should be given incentives to recycle their rubbish, or be penalised if they don't? \n\nWhich story grabbed your attention in the news today? \n\nWhat new law would you introduce? \n\nWhat current law would you repeal? \n\nHow would you improve the state of the country's finances?"},{"id":171,"text":"22. If you really don't know the answer to a question\n\nAns: I am sorry, but that isn't an area I am familiar with at present, so I can't really give you any details on that.\n\nI am not familiar with that particular data management system, though I would imagine it is quite similar to others that I have used and I am usually quick to get to grips with new systems.\n\nI am sorry, but I haven't come across that particular term before. Would you mind clarifying it for me? \n\nI am afraid that is an area we did not cover on the course, but it is something I am very keen to learn more about.\n\nI am afraid that isn't a situation I have ever had to deal with, but I believe I would deal with it in the following way.\n\nThat is a new area for me, so I am afraid I can't really answer that, but I enjoy acquiring new knowledge and I do learn quickly.\n\nThat is not an area with which I am very familiar at the moment, but I see from your recruitment brochure that you offer a thorough induction programme and training opportunities, so I would like to take advantage of one of these if I were to be offered a position with you.\n\nI am not familiar with that legislation, but it is something I would make sure I brought myself up to speed on very quickly if you were to offer me this job.\n\nI have never used that software before, but I would be happy to do any necessary training either through your training department or on an external course if that was more appropriate.\n\nI am sorry, I am not quite sure what you are asking. Could you ask me that question again, please? \n\nI am not sure where I should start with that. Please could you give me a little bit more of an explanation? \n\nThat's an interesting question; may I have a moment or two to collect my thoughts? \n\nThere is quite a lot I could say about that; can you bear with me while I think about that for a minute? \n\nIs there anything you would like me to add? \n\nShould I go on to tell you a little about how my previous job gave me some useful experience of dealing with these types of problems?"},{"id":172,"text":"00. YOUR FUTURE"},{"id":173,"text":"01. You graduated a while ago and you don't appear to have worked at all since then?\n\nAns: I had applied for several jobs before I left university, so I was quite optimistic at first, even taking a few weeks? holiday. The reality was harder than I had expected, but I have kept on applying. I have also arranged some work shadowing to keep me up to date, but that is not due to start for a week or two. I have tried to be open minded, but still focused on what I want. It has not always been easy, but this job looks really ideal."},{"id":174,"text":"02. Do you think you are overqualified for this job?\n\nAns: No, I don't. I think my experience and qualifications will mean that I can do the job very effectively from day one and be a very useful member of the department straight away. I have been keen to work in a smaller company like this ever since I left university. I would enjoy the job and you would get a good new member of staff."},{"id":175,"text":"03. Do you consider this to be a ?graduate? job?\n\nAns: I know you don't ask for a degree in your advert, but what seems most important to me is whether it is a job I feel I could do well and want to do. My degree has given me great experience of planning my workload, finding answers to questions and working with other people on group projects. This matters more to me than the qualifications you require."},{"id":176,"text":"04. You are studying biotechnology, but you have applied for a job as a human resources trainee with us _ why?\n\nAns: I was good at science at school and I thought biotechnology would be an interesting area to work in. I found, though, especially through my various periods of work experience, that I am far more interested in dealing with staff issues and solving business problems than I am in finding scientific solutions. It was a surprise to me, but other people have also commented on my business awareness and how I seem to have a good grasp of personnel issues. My manager in my last work placement mentioned this on my placement report."},{"id":177,"text":"05. Do you think being a graduate should affect your starting salary?\n\nAns: I would like to think so, but I am actually more interested in the opportunity for good career progression which would, of course, affect my salary. I think my course is very relevant to this position and I am sure I would enjoy working here."},{"id":178,"text":"06. Do you see yourself getting bored in this job?\n\nAns: I think a job is what you make it. While I accept the work is going to be routine, I have done similar work in my holidays and I was always willing to help other people if they needed it. I would also use the time to learn more about the whole business."},{"id":179,"text":"07. Do you regret going into higher education?\n\nAns: No I don't. Of course it has been frustrating at times, but I had thought about it carefully before I started my course, especially with the costs it entailed. I knew there would be tough competition for jobs and it has been hard. I have learned so much from my course, especially about working in teams and taking responsibility for my own work. I did have a really great time too."},{"id":180,"text":"08. You haven't had much work experience compared to other applicants _ do you think this disadvantages you?\n\nAns: I did think about working for a year before I went to university and I had intended to take on a part-time job while I was studying. In fact, my father was very ill for a major part of my course and I ended up helping out a lot at home and spending time with him and my family. My course was quite practical and, as you can see, I got a good result even with all the stress going on outside. I really believe I am capable of doing this job and doing it well, and you do emphasise your high standard of training and induction."},{"id":181,"text":"09. Your CV shows that you have done a lot of voluntary work, but not much paid employment. Why is that?\n\nAns: My voluntary work has been very varied, working in a hospital, for a local community youth group and on an environmental project. At one time I was working on all three at once and ended up with a 50-hour working week. I have learned so much about working in teams, negotiating and being well-organised, but above all it was the fund-raising for these projects that enabled me to clarify that it was in fund-raising, promotional work and marketing that I could see my future career."},{"id":182,"text":"10. What do you think has stopped you finding work so far?\n\nAns: I believe it is very much a result of the current job market as there are so many people with similar qualifications chasing positions like this. I am building up a good network of contacts now and that is helping me to remain optimistic, especially since this is something I feel confident I could do well."},{"id":183,"text":"11. How flexible have you been in your job search?\n\nAns: I have certainly tried to be very flexible _ probably more so as time has gone on. I have tried to think about the range of situations in which my good people skills and admin experience would work well, rather than sticking to one employment sector."},{"id":184,"text":"12. How have you coped with this period of unemployment?\n\nAns: It was easy to be positive at first _ after all many of us are in the same boat. As time went on I realised I had to build some structure into my life and my job hunting. I have also done some work shadowing which has kept up my enthusiasm. It has not always been easy, but I still feel optimistic and very clear that the skills I have outlined would bring a lot to your organisation."},{"id":185,"text":"13. How have you used your time?\n\nAns: I have tried to be organised about how I look for work as a start. I have done much more than just trawl the Internet for jobs _ I have been to talk to several employers. I also volunteer at a local school, helping with reading practice. I have learned that planning your week and each day is very important."},{"id":186,"text":"14. How have you stayed motivated?\n\nAns: I have kept in touch with friends already working in this field via social media. I keep up membership of my professional body and have attended a few local business events to help get myself known. The Internet makes it easy to keep up with new developments and important issues for the industry."},{"id":187,"text":"15. Have you considered a complete change of direction?\n\nAns: I have, because I want to work and I know I need to remain realistic, but I did well on my course and it confirmed my passion for this sort of work. I know I have some valuable skills that I could use in other ways, but I still feel determined to pursue this career. I am delighted to have this interview; it has made me even more enthusiastic."},{"id":188,"text":"16. Have you been prepared to lower your sights?\n\nAns: Yes I have _ I have applied for jobs which only require GCSEs and I would be willing to start at that level. I believe my communication and planning skills would mean I could work my way up quickly, and be gaining new knowledge all the time."},{"id":189,"text":"17. Do you have any qualifications?\n\nAns: My main strength is in practical and relevant work experience. I have worked in the hotel sector for seven years and I have taken advantage of a lot of in-house training courses. I started as a receptionist as soon as I left school: I was impatient to be at work and earning a salary. In my current job as assistant manager, I have had experience of dealing with all kinds of issues, on the customer side and the human resources side. I would certainly be happy to take a relevant qualification if the opportunity arose; I think it could help me in the future and it is always useful to take an opportunity to step back and look at what you are doing."},{"id":190,"text":"18. We were hoping for someone with a degree. Can you convince us that, although you don't have one, you are the right person for the job?\n\nAns: I am very confident I could do the job. I did look carefully at the skills you mention in your advert and job description and they seem to match up very well with my experience. My time in administration at the hospital has given me very good organisational skills and a lot of experience in dealing with the public. I worked with some graduate management trainees there and we got on very well. Having a degree, or not, did not seem to be a barrier to working together constructively. Of course, I would be happy to do an evening course in any aspect of management if you felt that this would be useful."},{"id":191,"text":"19. Would you take unpaid work experience with us?\n\nAns: I would prefer not to. I know from the part-time work I did in the summer that I get on well in a customer care environment and I am sure I could make a contribution to your operation straight away. I would consider it if it gave me a thorough introduction to how the department works and if there was a realistic chance of it leading to permanent employment. Do you have any current members of staff who started with you via this route?"},{"id":192,"text":"00. SPECIFIC JOB REQ"},{"id":193,"text":"01. How many hours do you expect to work in a week to get the job done? \n\nAns: I always plan and prioritise work as much as I can, so I should be able to accomplish as much work as possible in a normal working day and make sure that I meet any targets or deadlines that come up. A busy time for me is just before the annual report has to go to print, because I have to provide a lot of statistics for this and they have to be recent, so even if you think ahead, there is inevitably some last-minute work. I am prepared to put in extra hours at hectic times like this, but I try not to make this a daily habit."},{"id":194,"text":"02. Tell me about an occasion when you have had to say ?no? at work.\n\nAns: Quite recently, I had to refuse to give editorial space to an advertising client in one of our magazines. The editorial they had provided was not of a very high standard and I don't like to encourage people into thinking that they can get free space. If they want advertising, then they have to pay for it, unless they provide really good-quality editorial material. My advertising manager was not particularly happy, but I spoke to the client myself and explained the situation and she did take the point. Our conversation ended on friendly and constructive terms."},{"id":195,"text":"03. Describe something you have done that was new and different for your organisation.\n\nAns: I started a series of short training sessions, which were run by different members of my team so they could give some basic ideas of how they worked and what their priorities were to the rest of the team. These sessions took only half an hour and we selected less busy times to do this. It worked very well; all staff understood more about how colleagues worked and communication improved. It also gave some people who had never led a session on anything a chance to do a bit of presenting."},{"id":196,"text":"04. Tell me how you go about solving a problem. Give me an example of a problem you have solved.\n\nAns: First of all, I try to analyse the causes that have led to the problem arising. Having done this, I try to group them together, e.g. are they mainly with people, resources, lack of appropriate information, etc. ? At this stage, it is usually pretty clear where the root of the problem lies, and this makes it much easier to work on a solution that is likely to be successful. We recently had a lot of problems servicing all our customer call-out requests to a really satisfactory level. In an effort to provide excellent service, we had moved to booking really precise time slots; in retrospect, we had probably made these too short. We worked with our service team, our booking staff and our customers to come up with something more flexible. It did involve looking at the problem from two very different perspectives."},{"id":197,"text":"05. Describe a special contribution that you have made to your employer.\n\nAns: For the past two years, I have coordinated our work-experience programme. This is a programme in which undergraduates join us for four weeks during the summer to have some structured work experience in several of our departments. Most people are really happy to help out with this, but it is often hard to find a volunteer to run the whole thing, because it takes a lot of time on top of your normal workload. I think it is a really valuable way to build links between students and us and, although it sometimes drives me mad, I know my work is really appreciated by the firm and by the students."},{"id":198,"text":"06. Describe a situation where you believe your colleagues/company/department really rely on you.\n\nAns: I am often called upon if there is a confrontation with a client. I have a reputation for being calm and for being honest with people, and if there has been a situation where we are at fault I do follow it up and try to put things right. If the customer is being unreasonable, then I can usually talk them round without the situation becoming more heated."},{"id":199,"text":"07. Describe the level of stress in your current job and what you do to manage it.\n\nAns: I am working with quite a high level of stress at present, simply because regulations have come into force recently that affect my industry. I have had to oversee a large number of risk assessments and other new procedures in a very short time and I have to be able to demonstrate that these are in place to external assessors. In terms of managing the stress, I at least had the advantage that I knew these changes were coming, so I had a basic plan in place. I involved colleagues at an early stage and I took the decision to do one task at a time thoroughly, rather than scurrying round trying to do a little bit of everything at once. I certainly feel very busy, but I am in control."},{"id":200,"text":"08. What do you think is the difference between a manager and a leader?  Tell me about an occasion when you have applied your management and leadership skills.\n\nAns: I think that, in my current role, I have had to be both to some extent. I suppose I see managing more as organising work and controlling resources, whereas to me leadership is more about coming up with ideas and above all being able to take people with you, whether that is motivating staff to tackle something new or keeping morale and commitment going through troubled times. I think it is important to be able to see things through, as well as having innovative ideas. We had a merger of two departments recently, and I had to manage the amalgamation of two different administration systems. I think my leadership came in when I had to ensure that new members of staff felt involved and valued in the combined department."},{"id":201,"text":"09. Outline a situation where you had to make a decision that required careful thought. How did you go about this? \n\nAns: Fairly recently, we had to decide whether to outsource all our public relations work to a consultancy. We had been doing it in-house for many years. Although I was not the only one involved in the discussions, my role as head of marketing meant that in the end the final decision came down to me. My decision was based on talking to colleagues, on exploring financial implications and on discussions with consultants who might take on the work. In the end, we decided to continue as we were; part of this decision was based on intuition as well as research."},{"id":202,"text":"10. Outline a situation where you had to make a decision that required careful thought. How did you go about this? \n\nAns: One difficult decision I had to take was whether to try to defer a job offer that I had received just before I graduated, so that I could go travelling for six months. It felt risky to me: if the employer said ?no?, I could cope with the disappointment of not travelling but I was worried that they might think I lacked commitment or would become restless. I instinctively felt that I could be open with the senior person who had interviewed me, but it still worried me. I talked to friends, my personal tutor and my careers adviser. In the end, I decided that honesty was the best policy and that I could genuinely reassure the company that I would not harbour any negative feelings if they refused. As it turned out, they did want me to start work straight away and that turned out to be fine."},{"id":203,"text":"11. Describe an unpredictable situation that you have had to deal with.\n\nAns: Quite recently, a group of overseas visitors was booked for a tour of my department, but the international office had forgotten to let anyone in the department know. I was in the middle of dealing with an enquiry when the group turned up expecting a tour and plenty of useful information. It was tricky because I was unprepared and I was annoyed at other people's inefficiency. I had to think on my feet, get someone else to take over what I was doing and give my tour and presentation. Actually, it went really well; the adrenalin probably helped. People asked a lot of questions and I was on quite a high at the end of it."},{"id":204,"text":"12. Tell me about a time when you changed your priorities to meet the expectations of others.\n\nAns: It is always difficult providing all the staff training you would like, within the time and financial constraints, and as we were just about to go through some restructuring I was very keen that we should have a team-building course of some sort for everyone involved. There was so much uncertainty around that many colleagues wanted a session on managing change. I was concerned that this might end up being a rather vague session that might not achieve much. I decided that, as feelings were so strong, I would have to put what would have been my priority choice to one side on this occasion. Actually, in the end, we got a very good trainer and the course on change led to some really constructive work on team roles."},{"id":205,"text":"13. Tell me about an occasion when you have used a creative approach to solving a problem or improving a situation.\n\nAns: I took a job in customer services soon after graduating. Most of the work was dealing with telephone enquiries. Because we had so many different types of customer from different types of company, selling different products, etc., we were all dealing with every kind of enquiry and I don't think I was the only one who found it difficult. I suggested to my line manager that we might divide into work groups dealing with specific types of enquiry, so that we could give a more thorough service. I thought I might be speaking out of turn because I was fairly new, but I tried to be diplomatic and enthusiastic and actually they did take it on board."},{"id":206,"text":"14. Describe an improvement you personally initiated.\n\nAns: When I was senior laboratory technician at the school of medical sciences, I organised a system to improve the amount of time for which expensive pieces of equipment were in use. I instigated a more formal booking system. Some lecturers and research students were worried at first that they would lose out but actually, after a short settling-in period, equipment was in use for 30 per cent more of the time and everyone agreed that the system was a great success."},{"id":207,"text":"15. Describe a work situation where you have had to deal with something on your own.\n\nAns: Quite recently, I had arranged with another colleague to put on a training event for staff from other sections. We had put some of the material together and the session was booked. Unfortunately my colleague had to go overseas at short notice, so I had to run the session on my own and do quite a lot of the final planning. I enjoy working with groups, but I found I needed to do some last-minute thinking about how to vary my style, so they didn't get bored of just one presenter. It went really well on the day."},{"id":208,"text":"16. What is the most exciting team project you have been involved with? \n\nAns: Last year I was part of a team developing some healthcare drop-in centres. What made it really enjoyable was working with people from many different professional backgrounds _ getting new perspectives that you might not have thought of on your own was really valuable. I had particular responsibility for liaising with local communities and feeding this back to the group."},{"id":209,"text":"17. Do you prefer to work on your own or as part of a team? \n\nAns: I really prefer working as part of a team, where everyone's input can make a contribution to a project or a decision. I have enjoyed working in project groups ever since my university course. If I do have to work on my own, however, I am quite willing to do so; I don't need constant advice and reassurance from others about what I am doing."},{"id":210,"text":"18. Describe an occasion where you have failed to reach a goal you had set yourself.\n\nAns: When I left university, I decided to do a master's course part-time at the same time as I started my first job. When it came to it, I found there was a great deal to learn with my first company and the training was intensive. In the end, I had to drop out of the master's programme for a year or two. In a way, it did not matter, because I did not need it for my work, but at first I did feel disappointed. Having done the course a bit later, it has probably been easier anyway, as I have had far more real experience to back up what I have studied."},{"id":211,"text":"19. Describe a situation when you had to influence different groups of people with different perspectives.\n\nAns: In one previous job, I was involved in organising a community arts festival _ our town had not had one before. At public meetings about the proposed event, there were people who were really keen _ local traders and voluntary arts groups, for example. There were also many local residents who were convinced that it would bring a lot of noise and mess and too much traffic into the area. There were also people who generally were on board but were worried about the financial implications. It was challenging dealing with all these concerns at the one meeting. My main tactic was to anticipate what most of the concerns would be before the meeting, so that I had a lot of factual information about similar events in other places. I also made sure that I listened to everyone's concerns and answered them as honestly as I could, so that people at least felt that their views had had an airing. In the end, the festival went off very well and it has become a biennial event. I notice that with this post there is quite a lot of liaison work with different stakeholder groups, so I may well be able to put some of this experience to good use here."},{"id":212,"text":"20. Have you ever had to work with a manager you simply couldn't get on with?  If you have, why and how did you deal with it? \n\nAns: There's been only one manager that I found it really hard to get on with. His predecessor had been great to work with and for. I had a lot of autonomy, and I felt I could make suggestions and take direction if necessary. Above all, I felt very trusted and it was really motivating. I believe I was doing a good job too. Her replacement wanted to control everything, literally down to how many paper clips we could order for the department, and minor issues were in danger of turning into confrontations. My strategy was to make sure I did discuss every major issue with him when it came up and hope that my open approach gradually would be rewarded. It was an uphill struggle and I was glad when he left, but the situation undoubtedly improved between us. Other than that, I have always had excellent working relationships with my managers."},{"id":213,"text":"21. Tell me about a situation where you have found yourself in conflict with a colleague.\n\nAns: I disagreed strongly with a colleague about whether we should use an external consultant or take on a new marketing initiative ourselves. We both felt strongly and we were on the same level. On that occasion, his argument won the day, but we turned out to be very disappointed with the consultant."},{"id":214,"text":"22. Describe a situation where you have had to negotiate for something you felt was important.\n\nAns: During a time of financial cutbacks, we were no longer able to recruit staff automatically to replace posts if employees left. It meant that every departmental manager had to make an individual case to senior staff to fill posts. You had to begin with a written submission and follow this up with a discussion where you had to make a very good case for why you should be allowed to recruit. I certainly felt really motivated to negotiate as hard as I could and, on the whole, over the 18 months that this policy was in place, I had quite a high success rate."},{"id":215,"text":"23. Tell me about an occasion where you had to take on the role of leader.\n\nAns: At university we did one joint project _ there were six of us in the group _ in which we had to produce a report based on interviews we held with middle managers working in ICT in many different employment sectors, including health, education, leisure, law and local government. As leader, I had to make sure that everyone was allocated a reasonable number of interviews, and I had to follow up to make sure that these were being done. We worked as a group to generate ideas to start with, but it was really down to me to make sure everything came together. I found a big part of my role was in encouraging people to feel confident about approaching organisations to find potential interviewees."},{"id":216,"text":"24. When you go on holiday, what kind of plans do you make, or do you prefer to be spontaneous? \n\nAns: I usually mix some spontaneity with a fair degree of planning. I am quite prepared to book something at fairly short notice and be flexible about where I go, but after this I do start to plan in a bit more detail. I like to do research about where I am going, find out places of interest, what the transport system is like, etc. This way, I can book for attractions or events that I know are going to be popular and ensure I don't miss out. There's so much you can do ahead on the Web now, though I am still prepared to use a book. I don't like to plan every last detail though; it's good to have some space just to follow your mood."},{"id":217,"text":"25. Tell me about something you have learned and applied recently.\n\nAns: Certainly, over the past two years I have learned more and more about the value of praise and encouragement to people who work for me. I suppose I have always known this at an intuitive level, but a course I attended on staff motivation really spelled this out and I have made more of a conscious effort to include this in my dealings with people. As well as staff seeming to appreciate it and being more motivated, it does make it much easier to criticise or question where this is necessary or appropriate. People are much more willing to take this on if they don't feel got at and they do feel valued."},{"id":218,"text":"26. Tell me about something you have learned and applied recently.\n\nAns: A few months into my first job and about six months ago, I attended a customer-care course. I was a bit negative about it because I was busy and I thought it was going to be full of obvious clich_s. In fact, doing a lot of role-play exercises was really helpful, challenging and tremendously entertaining at times. There are aspects of that course _ trying to solve a problem where possible by talking to someone more senior than myself and then getting back to the customer rather than just passing on the customer straight away _ that have been really useful. This has increased my confidence, I have a better rapport with customers and I know my manager is happy with the change."},{"id":219,"text":"27. Tell me about a situation where you have had to be tactful.\n\nAns: When I was working for one mid-range fashion store, a customer returned a skirt because she said she had noticed a slight stain near the hem that she had not seen when she bought it. The mark was very small and I was also pretty certain that she had worn the skirt and then possibly spilt something on it. It was possible, however, that she was telling the truth, so on that occasion I decided to give her the benefit of the doubt. We were really busy, but it was not that I could not make time to deal with it; I did not want potential new customers to get a bad impression of the place. Besides, it would have been completely undiplomatic to say I simply didn't believe her."},{"id":220,"text":"28. Give me an example of your persistence.\n\nAns: At one of the recruitment organisations I worked for, we had quite long waiting lists of people who wanted to book interviews with us. I was concerned that sometimes we were losing potential clients because they had to wait. I suggested that we start up a system of really quick drop-in interviews, particularly first thing in the morning, at lunchtime and at the end of the day, so that people could pop in for a five- to ten-minute chat and then book something more in-depth. Colleagues were really worried about this at first; they thought that it would end up creating more problems than it solved and that they would feel rushed and stressed. We shared out these drop-in sessions and it did work out really well. Clients could at least go away with something to think about or work on, even if they had to wait. I really had to work hard to get people to give it a try; it took several meetings, a lot of encouragement and a preparedness to do the first session myself."},{"id":221,"text":"29. What would your colleagues say about your attention to detail? \n\nAns: I believe that they would say it was one of my strong points and something that one or two of them find quite irritating at times. When I have done any of those management-style questionnaires, I always come out with ?completer/finisher? as fairly near the top, although 'shaper? and ?ideas person? are high up as well. When I was a student, I did various data-input and statistics-gathering work and you had to be very careful to get things right. I think the impression that job made has affected my approach to what some people might see as dull routine."},{"id":222,"text":"00. EQOPPOFSUC"},{"id":223,"text":"01. With this job there are sometimes occasions when you have to work until 7.30 p.m. at short notice. Would you be able to do that?\n\nAns: I understood this from your job description and it would not be a problem at all."},{"id":224,"text":"02. I see you have children. What arrangements would you make for their care if you were required to work late?\n\nAns: I considered all these issues carefully before I applied for this job, so I would be quite prepared to undertake this late work when it was necessary."},{"id":225,"text":"03. If English is not your first language and you have only been in the UK for two years, I wonder whether you could do this job?\n\nAns: I had studied English at school, so my written English was reasonable before I arrived here. I have much preferred learning by using it, though, and I feel happy to hold a conversation on any subject. Actually, in one of my temporary administrative jobs I was complimented on my good command of the English language. I would be happy to learn other European languages too; it is something I enjoy and comes very easily to me."},{"id":226,"text":"04. You don't mention your age on your CV.how old are you?\n\nAns: I am in my early 40s and I have had more than twenty years? work experience, the last five years in a human resource department, and I believe all the experience I have had is very useful for this post. I have had so many opportunities to develop my interpersonal skills, working with other colleagues, different work teams and members of the public."},{"id":227,"text":"05. You are older than most of the staff we employ here. How do you think you would fit in?\n\nAns: I think fitting in is all about personality and about a real interest in the job and has little to do with age. I noticed that most of the staff in this agency, probably in most advertising agencies, are younger than me. I am comfortable working with any age group. I was the oldest student on my course, but I fitted in socially as well as academically _ I have some creative ideas and, after all, I have been a consumer for longer than most of your staff and know what makes me buy something."},{"id":228,"text":"06. The manager here is a lot younger than you. How do you feel about being managed by a younger person?\n\nAns: I am far more interested in their qualities as a manager than in their age. I have had managers of various ages in the past and I have never found it to be an issue. I think it can be highly beneficial to have a mix of ages and types of experience _ it provides a good opportunity for learning."},{"id":229,"text":"07. We hadn't realised you were so young when we called you for interview. Do you think you could do the job?\n\nAns: Of course; the job really appeals to me. I love sport and the idea of working at a leisure centre. I have had a lot of unpaid but really good experience, helping out with my family's retail business. I have often looked after the place on my own and I am very used to dealing with people."},{"id":230,"text":"08. Would you expect to go on working beyond your mid-sixties?\n\nAns: I would certainly consider it, especially if I am enjoying work as much as I am at present and remained fit and healthy. I enjoy sharing ideas with colleagues of different ages and I find it hard to imagine suddenly switching off."},{"id":231,"text":"09. From your CV, I see that you arrived in this country only three years ago. How are you fitting into the job market here?\n\nAns: I am doing very similar work to that which I did before I came here _ working on major construction projects _ and I have been qualified as a quantity surveyor for five years now. I am enjoying work here and if you were to offer me a job I could be a great asset on some of your overseas projects later on."},{"id":232,"text":"10. You have met staff in the office here. How well do you think you would fit in with us?\n\nAns: The staff I met seemed very friendly and very committed to family and community law. I would imagine that many of your clients in this locality are from different ethnic groups, so I would probably do your image a lot of good."},{"id":233,"text":"11. What experience have you had of working with diverse groups of people?\n\nAns: I have had plenty of opportunities and I have always enjoyed working with different people. On my course at university, there were students from 17 different countries in my year and our oldest student was 57. I found that learning from people who had different cultural perspectives and different life experiences was really valuable, and it made seminar discussions very interesting. It did open my eyes to cultural issues that I had never thought about, such as different ways of handling confrontation, disclosing personal information, etc. I have tried to keep that awareness going during my working life. I think it is essential that any company that wants to be successful in a global market has a really diverse staff group, and I would feel more uncomfortable if this were not the case."},{"id":234,"text":"12. We are exploring the option of relocating our headquarters to another city. Would you be able to relocate if we did?\n\nAns: Yes I would. I am established here and I am buying a local property, but if the job was right for me I would definitely be prepared to consider relocating. What kind of assistance do you provide for your staff in terms of a relocation package?"},{"id":235,"text":"13. If we offered you this job in our IT support department it would be necessary for you to provide some weekend cover and also to be on call for emergencies on a rota. Do you have any problems with that?\n\nAns: That would be fine. In my current job I provide some weekend cover and I would be quite happy to continue this; I had anticipated it anyway. It would be useful to know how far in advance you plan your rotas, but I can usually be flexible."},{"id":236,"text":"14. How geographically mobile can you be?\n\nAns: I realise that this post could involve transfers and I bore that in mind when I applied. I like this area, but for the right opportunity I would undoubtedly consider moving."},{"id":237,"text":"15. There is a lot of travel involved with this job, and you would be away from home a lot. Do you have any problems with that?\n\nAns: None at all. I simply see it as part of the work. I know it is not always as glamorous as it sounds, but I am pretty adaptable, good at getting on with work when I am not at my desk. I had to do a fair bit of that in my previous job."},{"id":238,"text":"16. We like staff to attend our social functions: how do you feel about this?\n\nAns: In principle I am quite happy about it. Of course it depends what the function is and what other commitments I have at the time, but it can be really good to get to know colleagues in contexts other than the day-to-day working environment."},{"id":239,"text":"17. How long do you intend to work for us?\n\nAns: I see this move as clear career progress and if all goes well I would like to work here for the foreseeable future. I know that staff turnover can present real difficulties in social services and I feel it is important to stay put, to get to know the area, the clients and the department and the way it works. Ultimately, I would like to take on more management responsibility here."},{"id":240,"text":"18. I see you have been working part-time for the past three years. This is a full-time post. Have your circumstances altered in some way that requires you to look for full-time work?\n\nAns: I was doing an evening course in interior design and, although it was only two evenings a week, I had to do quite a lot of private study as well. Now that I have finished that course, I am certainly able to take on full-time work."},{"id":241,"text":"19. Do you find it difficult to manage your time, then, if you have demands coming from several directions?\n\nAns: Not at all. I rather enjoy having more than one project on the go. I worked alongside my time at university and I was a course rep in my final and busiest year. I think you often find imaginative ways of dealing with problems by dealing with different issues in various areas of your life. The design course was very important to me: I had to save up to do it, and I wanted to do well. It has certainly encouraged me to be more creative and imaginative, and I already have some really good ideas that I am sure would work well if you offered me this position. I can give you one of my ideas if you like."},{"id":242,"text":"20. Do you have any personal issues outside work that are likely to affect your ability to do this job?\n\nAns: I have always found that I am very good at keeping my personal life and my work life separate. I have often found that if one area of your life is a bit problematic, then it is very useful to be able to concentrate on work, but at present everything is going steadily and wanting to make this career move is my focus. Although I say I keep work and other parts of my life separate, I have always been happy to socialise with work colleagues if it turns out to be that sort of a work team."},{"id":243,"text":"21. Explain what you understand by an equal opportunities policy.\n\nAns: My understanding is that every employee and everyone with whom we deal will be treated fairly, regardless of age, gender, sexual orientation, ethnic and cultural background, disability or social background."},{"id":244,"text":"22. What steps would you take to help implement our equal opportunities policy if we offered you a job in this department?\n\nAns: First of all, I would look at all the information we supply for our clients to answer two questions. First, is it accessible to everyone and, second, does it carry positive images to represent all the different client groups we have? If the answer to either of these questions was ?No?, then I would look at ways of improving access, not just on disability issues but on things like leaflets in different languages and more information on our website. Those are just some initial thoughts."},{"id":245,"text":"23. Is there anything you would like to ask me?\n\nAns: Thank you, but I have been able to find so much out from your website _ it has been a really useful way to find answers to all my questions. It is a very well designed site and so easy to navigate."},{"id":246,"text":"24. Is there anything you would like to ask me?\n\nAns: Your graduate recruitment online information is really informative and it answers all the questions I have about the company and about your training scheme. I found the profiles of recent graduates really useful. I would like to know a bit more about what professional qualifications I could work towards."},{"id":247,"text":"25. Is there anything you would like to ask me?\n\nAns: I was able to find out so much from your colleagues when we had our tour of the production line and offices this morning that I don't think there is anything else I need to ask you at the moment, thank you."},{"id":248,"text":"00. ABOUT ORGANIZATION"},{"id":249,"text":"01. Why have you applied to this organisation? \n\nAns: I read your entry in Advertising World Annual Directory and noticed that, for a comparatively small firm, you deal with an interesting range of clients. I visited your website and found out more about some of your campaigns for small charities and pressure groups. I could say more about what caught my attention about those campaigns if you would like me to."},{"id":250,"text":"02. What do you think we do well? \n\nAns: I have seen this organisation grow over the past three years and you always seem to come up with new ideas that work. I have read articles by your CEO that show how interested you are in working with your customers and that is why your new products are so successful. I am a customer and I think your latest models are well ahead of their competitors."},{"id":251,"text":"03. What do you think we could do better? \n\nAns: On the whole I think you market yourselves really effectively. I am surprised that I don't see your products mentioned more frequently in some of the relevant business-to-business media. I know you have a strong customer base, but it can never be a bad thing to extend that."},{"id":252,"text":"04. Are we your first choice? \n\nAns: Yes, although I am applying to other similar firms, I had really hoped to do a work placement with you after I met one of your managers at a recruitment event. You appear to give people a lot of responsibility early on and that does appeal."},{"id":253,"text":"05. How did you research us? \n\nAns: I had read a short article about you in an IT magazine and this caught my interest a while ago. I found one of my old university contacts on LinkedIn who it turned out had worked for you for a while. I contacted her and she had really enjoyed working with you and told me a lot more about your work. Obviously I looked at your website and Twitter and then decided I would approach you on the off-chance that you might have a suitable vacancy now, or in the near future."},{"id":254,"text":"06. Have you followed us on social media? \n\nAns: Yes, that was how I first found out about your new fair trade policy and I have contributed to your Twitter updates."},{"id":255,"text":"07. Are you familiar with any of our products/services/projects? \n\nAns: Yes, several, but particularly your microwave meals and your soft drinks range _ I'm a real fan of some of your flavoured mineral waters. Since I started taking an interest in your company, I have taken note of where your products are placed on supermarket shelves and observed which groups of customers seem drawn to them. I could say a little more if you wish."},{"id":256,"text":"08. Are you familiar with any of our products/services/projects? \n\nAns: I first found out about your local youth theatre projects during our local arts week last summer when I saw your production of Blood Wedding. I was interested in arts and theatre administration then, so I took the opportunity to talk to some of the cast and some of the staff backstage. Since then I?ve followed up on several of your community projects."},{"id":257,"text":"09. Are you familiar with any of our products/services/projects? \n\nAns: At present I am not as familiar with your product range as I would like to be, but I am quick at assimilating knowledge and information and I would certainly enjoy learning more about all the products you supply."},{"id":258,"text":"10. How would you rate us against our competitors? \n\nAns: I certainly think you?re the best of the three free newspapers that are delivered around here. You all have to make money from advertising and yet you manage to include far more interesting editorial and many more stories that really do concern local issues _ I think that makes a real difference."},{"id":259,"text":"11. How would you rate us against our competitors? \n\nAns: Well, once I had decided I wanted to get into management in the fast-food industry I looked at several of the major players and considered their products, their premises, their customer groups and their business performance. Compared with the other pizza chains, I think your outlets look really clean and bright, the service is friendly and you do seem to try to preserve a slightly more authentic Italian feel and that really appeals to me."},{"id":260,"text":"12. If you had a free hand, how would you like to see us develop over the next three years? \n\nAns: I know that you are investing heavily in research and development and I would certainly continue to develop that emphasis. I would like to see you develop further into some of the European markets where Germany and Italy seem to have quite a strong grip at the moment _ perhaps you should have more European satellite offices."},{"id":261,"text":"13. If you had a free hand, how would you like to see us develop over the next three years? \n\nAns: The growing market for organic and environmentally friendly products is very significant, I believe, and it is not an area that your company has touched on all that much. I would like to investigate the production costs and the feasibility of developing some of these _ I am sure that market will grow significantly over the next few years."},{"id":262,"text":"14. What do you think is the most exciting aspect of our work? \n\nAns: I am very interested in your African development. My father worked in Africa for a while when I was in my early teens and I have a real feeling for the place and, of course, it is a really interesting new market too."},{"id":263,"text":"15. What do you think is the most exciting aspect of our work? \n\nAns: I have read several articles in the press about your recent projects in inner cities working with homeless families. The projects looked really innovative and this was a subject I researched and wrote about for my final-year dissertation at university. I?d be really interested to see how those projects work in the longer term and I would love to be involved with that kind of work."},{"id":264,"text":"16. What do you think is the most exciting aspect of our work? \n\nAns: So many City law firms seem to concentrate only on commercial clients, but you have departments dealing with a whole range of different aspects of the law. My particular interest in environmental law makes you an obvious choice for me and you have been involved in some really high-profile cases in that area."},{"id":265,"text":"17. What advantages do you think we have in the market place? \n\nAns: You have a smaller range of products than some of your competitors, but those products have a deserved reputation for being of a high quality, and your advertising and promotion campaigns mean that people are well aware of these products. I am sure it has been cost-effective for you to gear your production in this direction and last year's figures certainly bear that out, especially given the current problems in the market."},{"id":266,"text":"18. What advantages do you think we have in the market place? \n\nAns: Living in the town, I know exactly which other restaurants around here are your main competitors and I must confess to having eaten at all of them at one time or another. It says a great deal that you always have to book here at least two weeks ahead for a Friday and Saturday night and it goes without saying that I think the cuisine is wonderful _ really interesting with plenty of use of fresh local produce. That is one of the many reasons I have applied to be your assistant chef."},{"id":267,"text":"19. How do you think we can remain successful? \n\nAns: You have a strong client base and it is important to keep those clients very happy so that they return to you for their business. Good follow-up service is key here. Of course, you want to extend that client base too and effective marketing is important, but then you need to continue to ensure that every aspect of the business backs up those sales and marketing promises. Every employee has their part to play in this, I believe."},{"id":268,"text":"20. How do you think we could save money? \n\nAns: I know this is on everyone's minds at the moment. I wonder how much you spend on external PR consultants and whether we could do that in-house in the marketing department? Perhaps you could look at advertising in fewer magazines _ I would need to have more details, but think you could make some savings here. From what I know, you have pared your admin side down already, so we would have to look at other areas."},{"id":269,"text":"21. What do you think is the main reason why some companies fail? \n\nAns: I am sure there are many reasons, but one is probably poor communication between people who design products or develop ideas and the organisation's customers. This really means ensuring excellent internal communication _ I am sure this is key to solving very many problems."},{"id":270,"text":"22. Why do you want to work for us? \n\nAns: I had an open mind at the beginning of my final year at university, apart from knowing that I wanted to join a large company with a good reputation, and I was simply looking at a range of recruitment information and websites. One of the things that stood out about you was the flexibility you have in offering new staff training in several areas before they are definitely committed to one area."},{"id":271,"text":"23. What is it about this company/organisation that makes you think you will remain interested and enthusiastic over a long period of time? \n\nAns: Communications technology is changing so rapidly and, as you are a small company working in a highly specialised area of the market, I can foresee that the new developments here are going to happen frequently for some time to come. I am really committed to the idea of working on research and development for a smaller company _ I'm sure it provides a really good opportunity to work closely with other departments and get customer feedback more quickly. I like the atmosphere here too; everyone seems really keen and busy, but there is a real feeling that people are enjoying themselves and everyone has been very friendly."},{"id":272,"text":"24. We have several clubs and a lot of social activities for staff here. How do you feel about socialising with colleagues? \n\nAns: I think that always says something good about a company _ people will only do this if they want to. I am still friends with colleagues from some of my former posts, and I think it is great to get to know people outside the office and see another side to them. I would describe myself as a sociable person anyway, and I am always happy to join in anything like quiz nights, meals out, or whatever. What social clubs do you have at the moment?"},{"id":273,"text":"25. Who else are you applying to? \n\nAns: All the other leading firms of accountants, but I would far rather work for you if I had the choice. I attended one of your recruitment events and had a chance to talk to staff who you have taken on recently and I am really impressed with the support you give for professional training and qualifications. Even more important to me though, is knowing you have such a large and successful computer-auditing department. That is something which really interests me and would really bring my IT skills and my interest in accounting together."},{"id":274,"text":"26. Who else are you applying to? \n\nAns: I have really applied for anything that might help me get my foot in the door. Anything to do with arts and theatre is so competitive that I don't think I can be too choosy _ I accept I will have to work my way up. That's not to say I am not a very strong applicant _ I have helped out voluntarily with our last two local arts weeks and of course there's the box office job I had last summer at the Wild Side Theatre. I am really interested in this administrative job you are offering _ my experience to date suits it very well."},{"id":275,"text":"27. Who else are you applying to? \n\nAns: No, I have drawn up a list of other companies that would interest me and I have my CVs all ready to go but, after having had a part-time job with you for a while last year, I felt I would really like to work for you. Although it is taking a bit of a risk, I would rather see how things went with my application to you, before I send off any more CVs."},{"id":276,"text":"28. Have you received job offers from anyone else? \n\nAns: No, not so far, although I do have another interview to go to on Friday."},{"id":277,"text":"29. Have you received job offers from anyone else? \n\nAns: Yes, I have just received an offer from Spring Fresh Foods to join their product development division, but I am more interested in your product range and I'm also impressed by your record on environmental issues."},{"id":278,"text":"30. If one of our competitors offered you a job now, would you accept? \n\nAns: I would have to look very carefully at exactly what they were offering, not simply in terms of financial reward, but how relevant it was to my experience and how it might develop my career, but I would really much prefer to work here if I were given the opportunity."}]}