{"data":[{"id":1,"text":"1. Tell Me About Yourself\nA typical question for an interview is a great way to break the ice and conversate. But you can get important information about the candidate’s past experiences, skills and education. You can also get a feel of how well this individual will adapt to the project manager role at your organization. A good way to do this is to ask him to tell you a little about his past, present and future job expectations."},{"id":2,"text":"2. What’s your background, personally and professionally?\nIt’s important to get a snapshot of the applicant to bring their project manager resume into sharper focus. Knowing a bit about their life story can inform about their soft skills and how they might respond to issues at work, and whether they will fit into the corporate culture. The same goes for their project management experience. Staying at a single job for a long time can be either bad or good for project managers, but you won’t know until you put their choice into context."},{"id":3,"text":"3. Have you worked in this industry before?\nDoes the candidate have project management experience in your industry? That’s important because they might excel at the project management methods your company uses or may have the right risk management skills to manage your projects. If they don’t, it’s not a game-closer. Much of project management is the same from industry to industry. Perhaps they have strong project management skills that relate to your industry, such as project management software skills even if they don’t have direct experience. However, if they do have experience in your field, that’s a plus, so ask how those relevant projects panned out. Note how confidently they answer behavioral interview questions. You want an authentic person who is comfortable in the position."},{"id":4,"text":"4. Do you have budget management experience?\nIt helps to drill down into specific aspects of the project management experience of your candidates. Naturally, if the candidate has specific skills they’ll be briefly sketched in the resume, but here’s your opportunity to get a deeper sense of where they stand in terms of their experience with project management processes such as budget management. Project managers are known as planners. They create a project schedule and lead teams to success. But there’s often money involved, so they better know how to handle a project budget."},{"id":5,"text":"5. Have you managed remote teams?\nNot all projects are executed under one roof and remote teams are very common. With more dynamic project management tools and a global workforce to choose from, many project managers might never meet the members of their team, at least in person, but they’ll be able to work together using project management software. Then there are the necessary resources that will be outsourced, which involves a different resource management technique than when working with employees. Knowing how they have managed people and resources can help you get an overview of their leadership skills and be a crucial point in your decision to hire or not to hire."},{"id":6,"text":"6. How did your last project end?\nThis question is about discovering any lessons they learned from that project. Everything about project management is a learning experience, and each project offers lessons from which a good project manager grows.\n\nProjectManager has email and in-app notifications so you’ll never lose the thread of the conversation."},{"id":7,"text":"7. How do you prioritize tasks on a project?\nTask management is important. There’s going to be more work in a day than can be accomplished, so any good project manager is going to have to determine what is crucial and what could be left undone if necessary. It will prove interesting and informative to see how the candidate makes these time management and task management decisions."},{"id":8,"text":"8. How do you foster team collaboration?\nThis behavioral question is a great way to gauge the candidate’s basic leadership and team management knowledge as well as their ability to use modern work management software and team collaboration apps. Project managers need to be able to use tools to communicate with their team members whether they’re traditional, remote or hybrid teams."},{"id":9,"text":"9. How Do you seek help outside of the project team?\nThis project manager interview question gives you information about the leadership and communication skills of your project manager candidate. Some project managers are going to think you want a person who is wholly independent and pulls from an inner reservoir. Fair enough. But more resourceful is the project manager who knows when they’re over their head and asks for help from a mentor or a network of professionals."},{"id":10,"text":"10. Do you delegate?\nThey are better! The last thing you want is a project manager who carries everything on their shoulders. That’s nuts. But this is a bit of a trick question or at least one that has an implicit question embedded in it. What you really want to know is not whether they delegate, but how they delegate work to their team members. This is a great way to weed out the micromanagers.\n\nThat doesn’t mean a project manager is absent from the process. Project management software has features to keep them aware of what their team is doing but not in the way. For example, ProjectManager has a board view that visualizes the workflow. The kanban allows managers to oversee their team as they work and make sure things are moving forward. Even better, if a potential block is spotted in the production, the manager can reallocate resources to keep the work moving forward."},{"id":11,"text":"11. What was a challenging project, and how did you manage it?\nThis behavioral question takes the conversation from the theoretical to the practical. You can see how the project managers responded to real-life problems, which helps you determine how they would manage projects at your organization. This question also provides a sense of the person’s project management experience, such as how they lead teams and deal with conflicts. By asking about a challenging project, you can see how they apply their hard and soft skills when pushed to their limits and beyond."},{"id":12,"text":"12. How do you manage team members that are not working to their full potential?\nSometimes, no matter how much due diligence you put into assembling a skilled and experienced project team, someone underperforms or creates conflicts. While the project is rolling, you don’t have time to stop and tweak your team. Rather, the project manager must use problem-solving techniques and communication skills to deal with the problem. This comes up with even the best project team, so any capable project manager would know how to nip underperformance in the bud."},{"id":13,"text":"13. How do you deal when you’re overwhelmed or underperforming?\nIt’s easy to forget that project managers are people, too. They are hired to perform project management processes and lead a project to success, but they can suffer the same setbacks as anyone on the team over the course of the project life cycle. The difference between a good and great project manager is the ability to monitor oneself and respond proactively to any drop-offs in performance."},{"id":14,"text":"14. How do you work with customers, sponsors and stakeholders?\nEven project managers have to answer to someone. Responding to executives, project sponsors and stakeholders requires a different approach than the one they would use with teams and vendors. Part of their duties includes managing stakeholders who hold a position of authority over the project manager. That takes a subtle touch."},{"id":15,"text":"15. What’s your leadership style?\nTalking about managing a project will inevitably lead to a discussion of leadership style. There are many ways to lead, and all have their pluses and minuses. Depending on the project, a project manager might have to pick and choose how they lead, ranging from a top-down approach to servant leadership. See how well-versed they are on leadership techniques and how they apply them to project management."},{"id":16,"text":"16. What’s your communication style?\nThis is another classic project management interview question that directly stems from asking about managing projects and leadership. A project manager is nothing if he has poor communication skills. They need to be able to speak to team members, stakeholders, vendors, etc. Each group will need a slightly different approach. Stakeholders want the broad strokes of the project management plan, while team members will need more detail. If a project manager can’t clearly communicate, the project is doomed before it has begun.\n\nBeing a good communicator is only the start. Project management software helps you better target that communication with your team and stakeholders. ProjectManager has project management tools like Gantt charts, kanban boards and project calendars to clearly communicate your project plan. Our cloud-based software allows you and your team to collaborate in real-time. If someone has a question, they only need to tag another person on the team to get them into the conversation. Our email and in-app notifications make sure you’re never late for a meeting or an important stakeholder presentation. Try our tool for free today."},{"id":17,"text":"17. How do you know the project is off-track?\nEvery project hits a snag along the way, but not every project manager is aware of that delay until the project budget or project schedule is affected. The ability to monitor and track the progress of a project and tell immediately when it’s not meeting the benchmarks you set in the project planning phase is perhaps the most important duty of a project manager. Then it’s also important to see if the project manager candidates have experience implementing a risk management plan to mitigate risks and keep projects on budget and schedule. ProjectManager has project dashboards to help project managers spot issues before they become serious problems."},{"id":18,"text":"18. What’s the biggest mistake you’ve made on a project?\nEveryone makes mistakes; character is defined by how you deal with them. This project management interview question will allow you to first gauge the candidate’s honesty. If they say that they’ve never made a mistake, you can rest assured that they’re not being truthful and their resume can go into the circular file. However, when they tell you about the mistake they’ve made, note if they take responsibility for it (that will reveal their level of maturity) and, of course, how they resolved it."},{"id":19,"text":"19. How do you gain agreement with teams?\nWhere there are people, there are conflicts, and even the best projects have people’s problems. Good teams collaborate and trust one another. If there’s a problem between two or more project team members, it must be resolved quickly. But this can also apply to stakeholders, vendors, etc. A project manager is a bit of a psychologist who must know how to resolve conflicts quickly."},{"id":20,"text":"20. If the project is not adhering to schedule, how do you get it back on track?\nKnowing that a project is not keeping to its schedule is only as important as being able to get the project back on track. Once a project manager is aware of the discrepancy between the actual project schedule and the schedule baseline estimated in the project plan, they need to take action, such as project crashing or fast-tracking. Any project manager worth hiring will be able to answer this with practical specifics. On these types of questions, it’s best to answer with the STAR method."},{"id":21,"text":"21. What’s your ideal project?\nThe ideal project is the one that you’re hiring for of course! But seriously, try to get them to answer honestly. It will let you know what sort of projects they prefer to work on. In doing so you’ll get a better feel for what kind of project management methodology excites them and maybe even what they excel at. This can help you place the project manager with the right project, or help them adapt to the project team you’re hiring them to manage."},{"id":22,"text":"22. What project management software do you prefer?\nA project manager needs project management tools to plan, monitor and report on the project. There are many, from simple to more complex. This question reveals first how up-to-date the candidate is regarding software and project management tools. Additionally, it provides a picture of what tools and processes they use to manage a project.\n\nMost project managers heavily rely on Gantt charts when it comes to project planning and scheduling. ProjectManager has award-winning online Gantt charts that allow project managers to plan every phase of their projects. Managers can create dependencies, add milestones, assign tasks, manage workload and more—all from one screen. Any project manager you hire would appreciate the power of our planning tools."},{"id":23,"text":"23. What’s your preferred project management methodology?\nThere are almost as many ways to manage a project as there are projects. From traditional methods like waterfall to hybrid methodologies, you want a project manager who understands the many ways to work. And more importantly, can they use the project management methodology that best suits the work at hand?"},{"id":24,"text":"24. How tall are the pyramids in Egypt?\nTalk about not being prepared. Who is going into a job interview with this information in their head? You don’t really want an accurate answer to this question, but you do want to see how the project manager deals critically and seriously with the question. Because during the project they will be sidelined with unexpected challenges and questions."},{"id":25,"text":"25. What’s something you don’t want us to know?\nOuch. Yes, you need to go there and make the candidate uncomfortable. It’s not that you want to learn some secret or catch them in an unethical act. Less important than the content of their answer is the way they deal with the question. You’ll get a better picture of the person instead of the persona they’re presenting. It also shows their communication skills while under pressure. It might seem cruel, but it’ll help you get to the heart of the person that you’re going to trust with the management of your project."}]}