{"data":[{"id":1,"text":"What is the Agile Manifesto?\nFour values and principles behind the Agile philosophy\nIndividuals and interactions over processes and tools\nWorking software over comprehensive documentation\nCustomer collaboration over contract negotiation\nResponding to change over following a plan\nThat is, while there is value in the items on the right, we value the items on the left more."},{"id":2,"text":"What is empiricism?\nDecisions are made based on observation, experimentation and experience rather than on detailed upfront planning. Simply, learning by doing."},{"id":3,"text":"What are the three pillars of Scrum and why are they important?\nThe pillars are Transparency, Inspection and Adaptation\nThese pillars form the basis of Scrum"},{"id":4,"text":"What are the Five events in Scrum?\nThe Sprint\nSprint Planning\nThe Daily Scrum\nSprint Review\nSprint Retrospective"},{"id":5,"text":"What are the Three roles in Scrum?\nThe Scrum Master\nThe Product Owner\nDevelopers"},{"id":6,"text":"What are the Artifacts in Scrum?\nThe Product Backlog\nThe Sprint Backlog\nThe Increment"},{"id":7,"text":"What events must the Scrum Master be present in?\nSprint itself\nSprint Planning\nSprint Review\nSprint Retrospective"},{"id":8,"text":"What events must the Product Owner be present in?\nSprint itself\nSprint Planning\nSprint Review\nSprint Retrospective"},{"id":9,"text":"What events must the Developers be present in?\nSprint itself\nThe Daily Scrum\nSprint Planning\nSprint Review\nSprint Retrospective"},{"id":10,"text":"What is the Product Goal?\nThe Product Goal is the objective of the Sprint and usually results in releasable value"},{"id":11,"text":"How long is a Sprint?\nFixed length events of one month or less to create consistency."},{"id":12,"text":"What is the outcome of the Sprint?\nA releasable increment of value"},{"id":13,"text":"How does a Sprint control risk?\nBy limiting work, releasing value early and often and enabling frequent learning"},{"id":14,"text":"What is the purpose of the Daily Scrum?\nInspect progress toward the Sprint Goal and adapt the Sprint Backlog as necessary, adjusting the upcoming planned work."},{"id":15,"text":"What are the outcomes of the Daily Scrum?\nA plan for the day and a list of impediments to be resolved by either the team or the Scrum Master"},{"id":16,"text":"What is the timebox for the Daily Scrum?\n15 minutes"},{"id":17,"text":"What is the purpose of Sprint Planning?\nSprint Planning initiates the Sprint by laying out the work to be performed for the Sprint. This resulting plan is created by the collaborative work of the entire Scrum Team."},{"id":18,"text":"What are the outcomes of Sprint Planning?\nThe Sprint Goal\nAn initial Sprint Backlog"},{"id":19,"text":"What is the timebox for Sprint Planning?\nSprint Planning is timeboxed to a maximum of eight hours for a one-month Sprint. For shorter Sprints, the event is usually shorter."},{"id":20,"text":"What is the purpose of the Sprint Review?\nThe purpose of the Sprint Review is to inspect the outcome of the Sprint and determine future adaptations. The Scrum Team presents the results of their work to key stakeholders and progress toward the Product Goal is discussed."},{"id":21,"text":"Who attends the Sprint Review?\nThe Scrum Team\nInvited Stakeholders"},{"id":22,"text":"What is the timebox for the Sprint Review?\nTimeboxed to a maximum of four hours for a one-month Sprint. For shorter Sprints, the event is usually shorter."},{"id":23,"text":"What are the outcomes of the Sprint Review?\nDuring the event, the Scrum Team and stakeholders review what was accomplished in the Sprint and what has changed in their environment. Based on this information, attendees collaborate on what to do next. The Product Backlog may also be adjusted to meet new opportunities."},{"id":24,"text":"What is the purpose of the Sprint Retrospective?\nThe purpose of the Sprint Retrospective is to plan ways for a team to increase its quality and effectiveness. The team does this by reviewing its past performance and generating concrete actions for improvement, to be executed in the next Sprint."},{"id":25,"text":"What is the timebox for the Sprint Retrospective?\nTimeboxed to a maximum of three hours for a one-month Sprint. For shorter Sprints, the event is usually shorter."},{"id":26,"text":"What are the outcomes of the Sprint Retrospective?\nActions for improvement to be executed in subsequent Sprints."},{"id":27,"text":"Who must attend the Sprint Retrospective?\nThe Scrum team"},{"id":28,"text":"What are the five values of Scrum?\nSuccessful use of Scrum depends on people becoming more proficient in living five values:\nCommitment, Focus, Openness, Respect, and Courage."},{"id":29,"text":"Who owns the Product Backlog?\nThe Product Owner"},{"id":30,"text":"Who owns the Sprint Backlog?\nThe Developers"},{"id":31,"text":"Who can tell the Developers how to do their work?\nThe Developers self organise, no one tells them how to do their work."},{"id":32,"text":"What skills are needed across the Developers to do their work?\nThey must be cross functional."},{"id":33,"text":"What is an increment?\nThe result of a Sprints worth of work; potentially releasable value that builds on previous releases."},{"id":34,"text":"Who decides whether an increment should be released or not?\nThe Product Owner"},{"id":35,"text":"What is the best way to order a Product Backlog?\nBy Value"},{"id":36,"text":"Who is accountable for delivering every Sprint?\nThe Scrum Team"},{"id":37,"text":"Who is accountable for creating a plan for the Sprint?\nThe Scrum Team in planning"},{"id":38,"text":"What is the Definition of Done?\nA checklist which details what a complete piece of work looks like"},{"id":39,"text":"Who creates the Definition of Done?\nThe Developers or the Development Organisation"},{"id":40,"text":"Who orders the Product Backlog?\nThe Product Owner with support from collaborators"},{"id":41,"text":"How many people manage the Product Backlog?\nThe Product Owner manages the Product Backlog"},{"id":42,"text":"Who can write Product Backlog Items\nThe Product Owner can do this themselves or delegate – the Product Owner remains accountable for clear expression of Product Backlog Items"},{"id":43,"text":"Who can cancel the Sprint?\nOnly the Product Owner"},{"id":44,"text":"How does the Scrum Master serve the Product Owner?\nHelping find techniques for effective Product Goal definition and Product Backlog management;\nHelping the Scrum Team understand the need for clear and concise Product Backlog items;\nHelping establish empirical product planning for a complex environment; and,\nFacilitating stakeholder collaboration as requested or needed."},{"id":45,"text":"What is a Product Backlog Item?\nA unit of work in that results in value"},{"id":46,"text":"What is the Product Owners responsibilities?\nEnsuring that Product Backlog Items are transparent and well understood by the developers\nDeveloping and explicitly communicating the Product Goal\nCreating and clearly communicating Product Backlog items\nOrdering Product Backlog items; and,\nEnsuring that the Product Backlog is transparent, visible and understood."},{"id":47,"text":"What work can the Product Owner delegate?\nThe Product Owner may do the above work (q46) or may delegate the responsibility to others. Regardless, the Product Owner remains accountable.\nThere are multiple teams working towards delivery of ONE product, how many product owners should there be?\nOne\nDuring the Sprint new work is discovered, when should it be added to the Sprint Backlog?\nAs soon as its discovered"},{"id":48,"text":"What is Backlog Refinement?\nProduct Backlog refinement is the act of breaking down and further defining Product Backlog items into smaller more precise items.\nThis is an ongoing activity to add details, such as a description, order, and size. Attributes often vary with the domain of work."},{"id":49,"text":"What is the timebox for Backlog Refinement?\nAs much time as is needed"},{"id":50,"text":"What is the outcome of Backlog Refinement?\nA well understood, ordered Backlog"}]}