{"data":[{"id":1,"text":"What is DevOps?\nDevOps stands for Development and Operations. It is a software engineering practice that focuses on bringing together the development team and the operations team for the purpose of automating the project at every stage. This approach helps in easily automating the project service management in order to aid the objectives at the operational level and improve the understanding of the technological stack used in the production environment.\n\nThis way of practice is related to agile methodology and it mainly focuses on team communication, resource management, and teamwork. The main benefits of following this structure are the speed of development and resolving the issues at the production environment level, the stability of applications, and the innovation involved behind it."},{"id":2,"text":"DevOps Tools\nDevOps is a methodology aimed at increased productivity and quality of product development. The main tools used in this methodology are:\n\nVersion Control System tools. Eg.: git.\nContinuous Integration tools. Eg.: Jenkins\nContinuous Testing tools. Eg.: Selenium\nConfiguration Management and Deployment tools. Eg.:Puppet, Chef, Ansible\nContinuous Monitoring tool. Eg.: Nagios\nContainerization tools. Eg.: Docker\nDevOps Tools\n\nOrganizations that have adopted this methodology are reportedly accomplishing almost thousands of deployments in a single day thereby providing increased reliability, stability, and security with increased customer satisfaction."},{"id":3,"text":"DevOps Interview Questions For Freshers"},{"id":4,"text":"1. Who is a DevOps engineer?\nA DevOps engineer is a person who works with both software developers and the IT staff to ensure smooth code releases. They are generally developers who develop an interest in the deployment and operations domain or the system admins who develop a passion for coding to move towards the development side.\n\nIn short, a DevOps engineer is someone who has an understanding of SDLC (Software Development Lifecycle) and of automation tools for developing CI/CD pipelines."},{"id":5,"text":"2. Why DevOps has become famous?\nThese days, the market window of products has reduced drastically. We see new products almost daily. This provides a myriad of choices to consumers but it comes at a cost of heavy competition in the market. Organizations cant afford to release big features after a gap. They tend to ship off small features as releases to the customers at regular intervals so that their products don't get lost in this sea of competition.\n\nCustomer satisfaction is now a motto to the organizations which has also become the goal of any product for its success. In order to achieve this, companies need to do the below things:\n\nFrequent feature deployments\nReduce time between bug fixes\nReduce failure rate of releases\nQuicker recovery time in case of release failures.\nIn order to achieve the above points and thereby achieving seamless product delivery, DevOps culture acts as a very useful tool. Due to these advantages, multi-national companies like Amazon and Google have adopted the methodology which has resulted in their increased performance."},{"id":6,"text":"3. What is the use of SSH?\nSSH stands for Secure Shell and is an administrative protocol that lets users have access and control the remote servers over the Internet to work using the command line.\n\nSSH is a secured encrypted version of the previously known Telnet which was unencrypted and not secure. This ensured that the communication with the remote server occurs in an encrypted form.\n\nSSH also has a mechanism for remote user authentication, input communication between the client and the host, and sending the output back to the client."},{"id":7,"text":"4. What is configuration management?\nConfiguration management (CM) is basically a practice of systematic handling of the changes in such a way that system does not lose its integrity over a period of time. This involves certain policies, techniques, procedures, and tools for evaluating change proposals, managing them, and tracking their progress along with maintaining appropriate documentation for the same.\n\nCM helps in providing administrative and technical directions to the design and development of the appreciation.\n\nThe following diagram gives a brief idea about what CM is all about:"},{"id":8,"text":"DevOps Configuration Management"},{"id":9,"text":"5. What is the importance of having configuration management in DevOps?\nConfiguration management (CM) helps the team in the automation of time-consuming and tedious tasks thereby enhancing the organization’s performance and agility.\n\nIt also helps in bringing consistency and improving the product development process by employing means of design streamlining, extensive documentation, control, and change implementation during various phases/releases of the project."},{"id":10,"text":"6. What does CAMS stand for in DevOps?\nCAMS stands for Culture, Automation, Measurement, and Sharing. It represents the core deeds of DevOps."},{"id":11,"text":"7. What is Continuous Integration (CI)?\nContinuous Integration (CI) is a software development practice that makes sure developers integrate their code into a shared repository as and when they are done working on the feature. Each integration is verified by means of an automated build process that allows teams to detect problems in their code at a very early stage rather than finding them after the deployment.\n\nContinuous Integration (CI)\n\nBased on the above flow, we can have a brief overview of the CI process.\n\nDevelopers regularly check out code into their local workspaces and work on the features assigned to them.\nOnce they are done working on it, the code is committed and pushed to the remote shared repository which is handled by making use of effective version control tools like git.\nThe CI server keeps track of the changes done to the shared repository and it pulls the changes as soon as it detects them.\nThe CI server then triggers the build of the code and runs unit and integration test cases if set up.\nThe team is informed of the build results. In case of the build failure, the team has to work on fixing the issue as early as possible, and then the process repeats."},{"id":12,"text":"8. Why is Continuous Integration needed?\nBy incorporating Continuous Integration for both development and testing, it has been found that the software quality has improved and the time taken for delivering the features of the software has drastically reduced.\n\nThis also allows the development team to detect and fix errors at the initial stage as each and every commit to the shared repository is built automatically and run against the unit and integration test cases."},{"id":13,"text":"9. What is Continuous Testing (CT)?\nContinuous Testing (CT) is that phase of DevOps which involves the process of running the automated test cases as part of an automated software delivery pipeline with the sole aim of getting immediate feedback regarding the quality and validation of business risks associated with the automated build of code developed by the developers.\n\nUsing this phase will help the team to test each build continuously (as soon as the code developed is pushed) thereby giving the dev teams a chance to get instant feedback on their work and ensuring that these problems don’t arrive in the later stages of SDLC cycle.\n\nDoing this would drastically speed up the workflow followed by the developer to develop the project due to the lack of manual intervention steps to rebuild the project and run the automated test cases every time the changes are made."},{"id":14,"text":"10. What are the three important DevOps KPIs?\nFew KPIs of DevOps are given below:\n\nReduce the average time taken to recover from a failure.\nIncrease Deployment frequency in which the deployment occurs.\nReduced Percentage of failed deployments."},{"id":15,"text":"Intermediate Interview Questions"},{"id":16,"text":"11. Explain the different phases in DevOps methodology.\nDevOps mainly has 6 phases and they are:\n\nPlanning:\n\nThis is the first phase of a DevOps lifecycle that involves a thorough understanding of the project to ultimately develop the best product. When done properly, this phase gives various inputs required for the development and operations phases. This phase also helps the organization to gain clarity regarding the project development and management process.\n\nTools like Google Apps, Asana, Microsoft teams, etc are used for this purpose.\n\nDevelopment:\n\nThe planning phase is followed by the Development phase where the project is built by developing system infrastructure, developing features by writing codes, and then defining test cases and the automation process. Developers store their codes in a code manager called remote repository which aids in team collaboration by allowing view, modification, and versioning of the code.\n\nTools like git, IDEs like the eclipse, IntelliJ, and technological stacks like Node, Java, etc are used.\n\nContinuous Integration (CI):\n\nThis phase allows for automation of code validation, build, and testing. This ensures that the changes are made properly without development environment errors and also allows the identification of errors at an initial stage.\n\nTools like Jenkins, circleCI, etc are used here.\n\nDeployment:\n\nDevOps aids in the deployment automation process by making use of tools and scripts which has the final goal of automating the process by means of feature activation. Here, cloud services can be used as a force that assists in upgrade from finite infrastructure management to cost-optimized management with the potential to infinite resources.\n\nTools like Microsoft Azure, Amazon Web Services, Heroku, etc are used.\n\nOperations:\n\nThis phase usually occurs throughout the lifecycle of the product/software due to the dynamic infrastructural changes. This provides the team with opportunities for increasing the availability, scalability, and effective transformation of the product.\n\nTools like Loggly, BlueJeans, Appdynamics, etc are used commonly in this phase.\n\nMonitoring:\n\nMonitoring is a permanent phase of DevOps methodology. This phase is used for monitoring and analyzing information to know the status of software applications.\n\nTools like Nagios, Splunk, etc are commonly used."},{"id":17,"text":"12. How is DevOps different than the Agile Methodology?\nDevOps is a practice or a culture that allows the collaboration of the development team and the operations team to come together for successful product development. This involves making use of practices like continuous development, integration, testing, deployment, and monitoring of the SDLC cycle.\n\nDevOps tries to reduce the gap between the developers and the operations team for the effective launch of the product.\n\nAgile is nothing but a software development methodology that focuses on incremental, iterative, and rapid releases of software features by involving the customer by means of feedback. This methodology removes the gap between the requirement understanding of the clients and the developers."},{"id":18,"text":"13. Differentiate between Continuous Deployment and Continuous Delivery?\nThe main difference between Continuous Deployment and Continuous Delivery are given below:\n\nContinuous Deployment\tContinuous Delivery\nThe deployment to the production environment is fully automated and does not require manual/ human intervention.\tIn this process, some amount of manual intervention with the manager’s approval is needed for deployment to a production environment.\nHere, the application is run by following the automated set of instructions, and no approvals are needed.\tHere, the working of the application depends on the decision of the team.\nContinuous Deployment and Continuous Delivery"},{"id":19,"text":"14. What can you say about antipatterns of DevOps?\nA pattern is something that is most commonly followed by large masses of entities. If a pattern is adopted by an organization just because it is being followed by others without gauging the requirements of the organization, then it becomes an anti-pattern. Similarly, there are multiple myths surrounding DevOps which can contribute to antipatterns, they are:\n\nDevOps is a process and not a culture.\nDevOps is nothing but Agile.\nThere should be a separate DevOps group.\nDevOps solves every problem.\nDevOps equates to developers running a production environment.\nDevOps follows Development-driven management\nDevOps does not focus much on development.\nAs we are a unique organization, we don’t follow the masses and hence we won’t implement DevOps.\nWe don’t have the right set of people, hence we cant implement DevOps culture."},{"id":20,"text":"15. Can you tell me something about Memcached?\nMemcached is an open-source and free in-memory object caching system that has high performance and is distributed and generic in nature. It is mainly used for speeding the dynamic web applications by reducing the database load.\n\nMemcached can be used in the following cases:\n\nProfile caching in social networking domains like Facebook.\nWeb page caching in the content aggregation domain.\nProfile tracking in Ad targeting domain.\nSession caching in e-commerce, gaming, and entertainment domain.\nDatabase query optimization and scaling in the Location-based services domain.\nBenefits of Memcached:\n\nUsing Memcached speeds up the application processes by reducing the hits to a database and reducing the I/O access.\nIt helps in determining what steps are more frequently followed and helps in deciding what to cache.\nSome of the drawbacks of using Memcached are:\n\nIn case of failure, the data is lost as it is neither a persistent data store nor a database.\nIt is not an application-specific cache.\nLarge objects cannot be cached."},{"id":21,"text":"16. What are the various branching strategies used in the version control system?\nBranching is a very important concept in version control systems like git which facilitates team collaboration. Some of the most commonly used branching types are:\n\nFeature branching\n\nThis branching type ensures that a particular feature of a project is maintained in a branch.\nOnce the feature is fully validated, the branch is then merged into the main branch.\nTask branching\n\nHere, each task is maintained in its own branch with the task key being the branch name.\nNaming the branch name as a task name makes it easy to identify what task is getting covered in what branch.\nRelease branching\n\nThis type of branching is done once a set of features meant for a release are completed, they can be cloned into a branch called the release branch. Any further features will not be added to this branch.\nOnly bug fixes, documentation, and release-related activities are done in a release branch.\nOnce the things are ready, the releases get merged into the main branch and are tagged with the release version number.\nThese changes also need to be pushed into the develop branch which would have progressed with new feature development.\nThe branching strategies followed would vary from company to company based on their requirements and strategies."},{"id":22,"text":"17. Can you list down certain KPIs which are used for gauging the success of DevOps?\nKPIs stands for Key Performance Indicators. Some of the popular KPIs used for gauging the success of DevOps are:\n\nApplication usage, performance, and traffic\nAutomated Test Case Pass Percentage.\nApplication Availability\nChange volume requests\nCustomer tickets\nSuccessful deployment frequency and time\nError/Failure rates\nFailed deployments\nMeantime to detection (MTTD)\nMeantime to recovery (MTTR)"},{"id":23,"text":"18. What is CBD in DevOps?\nCBD stands for Component-Based Development. It is a unique way for approaching product development. Here, developers keep looking for existing well-defined, tested, and verified components of code and relieve the developer of developing from scratch."},{"id":24,"text":"19. What is Resilience Testing?\nResilience Testing is a software process that tests the application for its behavior under uncontrolled and chaotic scenarios. It also ensures that the data and functionality are not lost after encountering a failure."},{"id":25,"text":"20. Can you differentiate between continuous testing and automation testing?\nThe difference between continuous testing and automation testing is given below:\n\nContinuous Testing\tAutomation Testing\nThis is the process of executing all the automated test cases and is done as part of the delivery process.\tThis is a process that replaces manual testing by helping the developers create test cases that can be run multiple times without manual intervention.\nThis process focuses on the business risks associated with releasing software as early as possible.\tThis process helps the developer to know whether the features they have developed are bug-free or not by having set of pass/fail points as a reference."},{"id":26,"text":"21. Can you say something about the DevOps pipeline?\nA pipeline, in general, is a set of automated tasks/processes defined and followed by the software engineering team. DevOps pipeline is a pipeline which allows the DevOps engineers and the software developers to efficiently and reliably compile, build and deploy the software code to the production environments in a hassle free manner.\n\nFollowing image shows an example of an effective DevOps pipeline for deployment.\n\nThe flow is as follows:\n\nDeveloper works on completing a functionality.\nDeveloper deploys his code to the test environment.\nTesters work on validating the feature. Business team can intervene and provide feedback too.\nDevelopers work on the test and business feedback in continuous collaboration manner.\nThe code is then released to the production and validated again."},{"id":27,"text":"23. How does Ansible work?\nAnsible has two types of servers categorized as:\n\nControlling machines\nNodes\nFor this to work, Ansible is installed on controlling machine using which the nodes are managed by means of using SSH. The location of the nodes would be specified and configured in the inventories of the controlling machine.\n\nAnsible does not require any installations on the remote node servers due its nature of being agentless. Hence, no background process needs to be executed while managing any remote nodes.\n\nAnsible can manage lots of nodes from a single controlling system my making use of Ansible Playbooks through SSH connection. Playbooks are of the YAML format and are capable to perform multiple tasks."},{"id":28,"text":"24. How does AWS contribute to DevOps?\nAWS stands for Amazon Web Services and it is a well known cloud provider. AWS helps DevOps by providing the below benefits:\n\nFlexible Resources: AWS provides ready-to-use flexible resources for usage.\nScaling: Thousands of machines can be deployed on AWS by making use of unlimited storage and computation power.\nAutomation: Lots of tasks can be automated by using various services provided by AWS.\nSecurity: AWS is secure and using its various security options provided under the hood of Identity and Access Management (IAM), the application deployments and builds can be secured."},{"id":29,"text":"25. What can be a preparatory approach for developing a project using the DevOps methodology?\nThe project can be developed by following the below stages by making use of DevOps:\n\nStage 1: Plan: Plan and come up with a roadmap for implementation by performing a thorough assessment of the already existing processes to identify the areas of improvement and the blindspots.\nStage 2: PoC: Come up with a proof of concept (PoC) just to get an idea regarding the complexities involved. Once the PoC is approved, the actual implementation work of the project would start.\nStage 3: Follow DevOps: Once the project is ready for implementation, actual DevOps culture could be followed by making use of its phases like version control, continuous integration, continuous testing, continuous deployment, continuous delivery, and continuous monitoring.\nDevOps Interview Questions For Experienced"},{"id":30,"text":"26. Can you explain the “Shift left to reduce failure” concept in DevOps?\nIn order to understand what this means, we first need to know how the traditional SDLC cycle works. In the traditional cycle, there are 2 main sides -\n\nThe left side of the cycle consists of the planning, design, and development phase\nThe right side of the cycle includes stress testing, production staging, and user acceptance.\nIn DevOps, shifting left simply means taking up as many tasks that usually take place at the end of the application development process as possible into the earlier stages of application development. From the below graph, we can see that if the shift left operations are followed, the chances of errors faced during the later stages of application development would greatly reduce as it would have been identified and solved in the earlier stages itself.\n\nShift Left To Reduce Failure\n\nThe most popular ways of accomplishing shift left in DevOps is to:\n\nWork side by side with the development team while creating the deployment and test case automation. This is the first and the obvious step in achieving shift left. This is done because of the well-known fact that the failures that get notices in the production environment are not seen earlier quite often. These failures can be linked directly to:\nDifferent deployment procedures used by the development team while developing their features.\nProduction deployment procedures sometimes tend to be way different than the development procedure. There can be differences in tooling and sometimes the process might also be manual.\nBoth the dev team and the operations teams are expected to take ownership to develop and maintain standard procedures for deployment by making use of the cloud and the pattern capabilities. This aids in giving the confidence that the production deployments would be successful.\nUsage of pattern capabilities to avoid configurational level inconsistencies in the different environments being used. This would require the dev team and the operation team to come together and work in developing a standard process that guides developers to test their application in the development environment in the same way as they test in the production environment."},{"id":31,"text":"27. Do you know about post mortem meetings in DevOps?\nPost Mortem meetings are those that are arranged to discuss if certain things go wrong while implementing the DevOps methodology. When this meeting is conducted, it is expected that the team has to arrive at steps that need to be taken in order to avoid the failure(s) in the future."},{"id":32,"text":"28. What is the concept behind sudo in Linux OS?\nSudo stands for ‘superuser do’ where the superuser is the root user of Linux. It is a program for Linux/Unix-based systems that gives provision to allow the users with superuser roles to use certain system commands at their root level."},{"id":33,"text":"29. Can you explain the architecture of Jenkins?\nJenkins follows the master-slave architecture. The master pulls the latest code from the GitHub repository whenever there is a commitment made to the code. The master requests slaves to perform operations like build, test and run and produce test case reports. This workload is distributed to all the slaves in a uniform manner.\n\nJenkins also uses multiple slaves because there might be chances that require different test case suites to be run for different environments once the code commits are done."},{"id":34,"text":"30. Can you explain the “infrastructure as code” (IaC) concept?\nAs the name indicates, IaC mainly relies on perceiving infrastructure in the same way as any code which is why it is commonly referred to as “programmable infrastructure”. It simply provides means to define and manage the IT infrastructure by using configuration files.\n\nThis concept came into prominence because of the limitations associated with the traditional way of managing the infrastructure. Traditionally, the infrastructure was managed manually and the dedicated people had to set up the servers physically. Only after this step was done, the application would have been deployed. Manual configuration and setup were constantly prone to human errors and inconsistencies.\n\nThis also involved increased cost in hiring and managing multiple people ranging from network engineers to hardware technicians to manage the infrastructural tasks. The major problem with the traditional approach was decreased scalability and application availability which impacted the speed of request processing. Manual configurations were also time-consuming and in case the application had a sudden spike in user usage, the administrators would desperately work on keeping the system available for a large load. This would impact the application availability.\n\nIaC solved all the above problems. IaC can be implemented in 2 approaches:\n\nImperative approach: This approach “gives orders” and defines a sequence of instructions that can help the system in reaching the final output.\nDeclarative approach: This approach “declares” the desired outcome first based on which the infrastructure is built to reach the final result."},{"id":35,"text":"31. What is ‘Pair Programming’?\nPair programming is an engineering practice where two programmers work on the same system, same design, and same code. They follow the rules of “Extreme Programming”. Here, one programmer is termed as “driver” while the other acts as “observer” which continuously monitors the project progress to identify any further problems."},{"id":36,"text":"32. What is Blue/Green Deployment Pattern?\nA blue-green pattern is a type of continuous deployment, application release pattern which focuses on gradually transferring the user traffic from a previously working version of the software or service to an almost identical new release - both versions running on production.\n\nThe blue environment would indicate the old version of the application whereas the green environment would be the new version.\n\nThe production traffic would be moved gradually from blue to green environment and once it is fully transferred, the blue environment is kept on hold just in case of rollback necessity.\n\nIn this pattern, the team has to ensure two identical prod environments but only one of them would be LIVE at a given point of time. Since the blue environment is more steady, the LIVE one is usually the blue environment."},{"id":37,"text":"33. What is Dogpile effect? How can it be prevented?\nIt is also referred to as cache stampede which can occur when huge parallel computing systems employing caching strategies are subjected to very high load. It is referred to as that event that occurs when the cache expires (or invalidated) and multiple requests are hit to the website at the same time. The most common way of preventing dogpiling is by implementing semaphore locks in the cache. When the cache expires in this system, the first process to acquire the lock would generate the new value to the cache."},{"id":38,"text":"34. What are the steps to be undertaken to configure git repository so that it runs the code sanity checking tooks before any commits? How do you prevent it from happening again if the sanity testing fails?\nSanity testing, also known as smoke testing, is a process used to determine if it’s reasonable to proceed to test.\nGit repository provides a hook called pre-commit which gets triggered right before a commit happens. A simple script by making use of this hook can be written to achieve the smoke test.\n\nThe script can be used to run other tools like linters and perform sanity checks on the changes that would be committed into the repository.\n\nThe above script checks if any .py files which are to be committed are properly formatted by making use of the python formatting tool pyfmt. If the files are not properly formatted, then the script prevents the changes to be committed to the repository by exiting with status 1."},{"id":39,"text":"35. How can you ensure a script runs every time repository gets new commits through git push?\nThere are three means of setting up a script on the destination repository to get executed depending on when the script has to be triggered exactly. These means are called hooks and they are of three types:\n\nPre-receive hook: This hook is invoked before the references are updated when commits are being pushed. This hook is useful in ensuring the scripts related to enforcing development policies are run.\nUpdate hook: This hook triggers the script to run before any updates are actually made. This hook is called once for every commit which has been pushed to the repository.\nPost-receive hook: This hook helps trigger the script after the updates or changes have been accepted by the destination repository. This hook is ideal for configuring deployment scripts, any continuous integration-based scripts or email notifications process to the team, etc."}]}