{"data":[{"id":1,"text":"The Five Categories of Interview Questions\nCategory One: Who Are You and What Do You Have to Offer?\nCategory Two: Why Do You Want to Work Here?\nCategory Three: Sensitive or Negative Questions\nCategory Four: What Are Your Salary Expectations?\nCategory Five: Miscellaneous Questions"},{"id":2,"text":"The Summary\nThe Tools and Techniques of Interviewing\nThe Three Categories of Skills, Abilities, and Traits\nInterview Principles and Rules to Discuss Salary\nThe Five-Point System\nYour Examples and Stories\nThe Five Categories of Interview Questions\nThe Quiz\nWhat to Say in Every Job Interview\nTell Me About Yourself\nWALK ME THROUGH YOUR RÉSUMÉ\n \n\n“What do you do?”\n\n“What’s your background?”\n\n“Where are you from?”\n\n“What do you like to do?”\n\n“Where do you work?”"},{"id":3,"text":"THE FIVE-POINT SYSTEM\nOne of the best techniques I use to help clients answer this type of open-ended question is a Five-Point System. This is a summary to help you prepare and to remember what you want the interviewer to know. This five-point summary becomes your personal brand and should include (1) your education and years of experience, (2) your area of expertise or knowledge, (3) your strengths, (4) your work ethic and reputation, and, if applicable, (5) some personal information (hobbies, interests, volunteer work). What do you want the interviewer to remember about you when you leave?\n\n• Point One: Your education and years of experience. This includes any special licenses, certifications, or security clearances. (More experienced persons will talk mainly about experience and not focus on education. New students will focus on education with special classes or honors received.)\n\n• Point Two: Your area of expertise. What do you know a great deal about? This is the information from your knowledge-based skills exercise. It is important to emphasize your experience related to the job posting or description. (People with less experience will have to rely on classes taken or coursework done.)\n\n• Point Three: Your key strength. This is usually a trait that you can use in any job. The information from your transferable skills exercise can be used here (i.e., communication skills, relating to others, problem solving, time management).\n\n• Point Four: Your work ethic or work style. Refer to your personal traits list. This is what your coworkers would say about you if they were asked. Third-party endorsements work well here.\n\n• Point Five: Personal facts. Something interesting about you (a hobby, a volunteer job, a sport or activity that is of interest to you). If you can think of something that relates to the job you are applying for, that would be a plus. Use of personal facts can be an optional point, depending on your circumstances and what you have to say."},{"id":4,"text":"Tell me about yourself.\n\nWhat can you bring to the job that other candidates can’t?\n\nWhat are your strengths?\n\nWhat makes you unique?\n\nWhy should we hire you?\n\nWhat do others say about you?\n\nDescribe your personality.\n\nExpertise and Knowledge"},{"id":5,"text":"Business skills/abilities (persuasion, negotiation, managing):\n\nManagement skills/abilities (leadership, visionary, forward thinker):\n\nAdministrative skills/abilities (project management, coordination, follow through):\n\nAnalytical skills/abilities (strategic, analyze, interpret, recommend):\n\nTeaching skills/abilities (knowledgeable, communication, patient):\n\nMechanical skills/abilities (tools/equipment, maintenance/repairs, skill/craft):\n\nSpecial training/abilities (pilot’s license, inventor, military, law enforcement):\n\nTransferable skills: skills that are portable such as communication, listening, decision making, judgment, initiative, negotiation, planning, organizing, time management, some leadership skills."},{"id":6,"text":"Key Strengths\n\nPeople skills:\n\nCommunication:\n\nProblem solving:\n\nAnalytical:\n\nAttention to detail:\n\nFollow-through:\n\nOrganized:\n\nGood listener:\n\nCoaching:\n\nPrecise:\n\nThinking out of the box:\n\nPlanning:\n\nScheduling:\n\nMy strengths are my analytical mind and my research skills, combined with a natural curiosity to find answers. I think the people I have worked with would tell you that they appreciated my skills and my way of thinking through problems.\n\nMy strength is my ability to deal with people. This has a lot to do with the fact that I am a good listener and that I’m good at reading people. I have worked with a diversity of people and have always been able to adapt and get along by adjusting my style and vocabulary to meet the person’s level.\n\nMy strength is my strong leadership ability and style. I believe in being very open in my communications. I work collaboratively with the people who work for and with me. I think my record proves my leadership ability: I was promoted from a staff accountant to a controller, and then to my current position as vice president.\n\nMy strength is my ability to solve problems. Throughout my life, it has been something that I have been able to do by looking at the issue and sorting through what is important and what is not important."},{"id":7,"text":"Your Work Ethic/Loyalty, Achievements\n\nYour work ethic/loyalty, achievements:\n\nPerformance appraisal quotes:\n\nComments from past/current bosses:\n\nComments from your coworkers:\n\nWhat you perceive your coworkers think of you:\n\nExamples of your work ethic, long hours:\n\nExamples of going above and beyond:\n\nReference letter comments:\n\nI have a strong work ethic with an abundance of energy. I can work for hours and days and never tire. I sometimes surprise people who work with me by working for days with no breaks, and being on-call at night.\n\nI consider myself to be very adaptable, and I can usually make friends in new situations. I will go out of my way to help someone who needs help. I try to get to know people on a deeper level.\n\nI am a very hard worker, working an average of 60 to 70 hours a week. I will do whatever it takes to complete a job. I am sure to keep my boss and team workers in the communication loop by setting up time to get their thoughts and their buy-in.\n\nI have a strong work ethic and am very dependable. People who know me and have worked with me would tell you that I am loyal and extremely punctual. They would also tell you that I am fun to be around and that I have a dry sense of humor."},{"id":8,"text":"I have very strong communication skills and know how to make connections with people. Anyone who has worked with me would tell you that I am highly organized and known for my follow-through and attention to detail.\n\nI am a person who thrives on solving problems, particularly “people problems.” For the past five years I have worked in a wide variety of settings—everything from retail to manufacturing—and I never met a problem I couldn’t work through."},{"id":9,"text":"Personal Traits\nPersonal traits are the individual qualities that make you who you are. Are you outgoing, and do you tend to jump right in? Or, do you take time to warm up before you let someone get to know you? Do you always think ahead and meet deadlines before they are due? Or, are you a last minute person who gets that rush when working against the clock to meet a deadline? This is not about what’s good or not good; it’s about you and your character. Some jobs fit one type of personality but would be absolutely boring to another person. The idea is to find the right person for the right job so that everyone wins.\n\nHere are some of the attributes that define a person’s personality: dependable, strong, team player, versatile, patient, friendly, energetic, formal, loyal, self-confident, dynamic, practical, sociable, persuasive, responsible, sense of humor, cheerful, good attitude, aggressive, assertive, determined, honest, humble, productive, conscientious, curious, enthusiastic, precise, detail oriented, compassionate, efficient, emotional, rigid, open-minded, and so on."},{"id":10,"text":"Question: How Would You Describe Your Personality?\nBoring answer: “I am a high energy person.”\n\nThis answer needs more detail and energy.\n\nBetter answer: “I am a person who is energized by challenges and problems.”\n\nBoring answer: “I’m a hard worker.”\n\nThis is the most common phrase used when answering the question about strengths. It shows no imagination.\n\nBetter answer: “I do whatever it takes to get the job done, sometimes working 10-hour days.”\n\nBoring answer: “I am a quick learner.”\n\nThis is a very overused phrase that has lost its effectiveness.\n\nBetter answer: “I can hit the ground running and come up to speed faster than anyone I know.”\n\nBoring answer: “I’m analytical.”\n\nThis is a lackluster answer that doesn’t reveal much information.\n\nBetter answer: “I’m known for my ability to analyze data and transform it into useful information.”\n\nBoring answer: “I’m very organized.”\n\nThis is a very understated answer.\n\nBetter answer: “I am a person who knows how to bring order to chaos.”\n\nBoring answer: “I’m reliable.”\n\nThis answer needs more information to get the point across.\n\nBetter answer: “I pride myself on my record of never missing deadlines, regardless of what it takes.”\n\nBoring answer: “I’m good with customers.”\n\nThe answer needs clarification—good in what way?\n\nBetter answer: “I know how to build great relationships with customers. They always ask for me personally.”\n\n \n\nBetter answer: “I am a person who values others’ qualities and contributions. My team members would tell you that I am a very fair manager who listens when they have something to say.” (Notice the third-party endorsement.)\n\n\nI am a sincere and gentle person. If I sound like I am too serious, I do have a fun side where I like to laugh and make people laugh. My friends would tell you that I have a very funny sense of humor, in appropriate situations.\n\nI have many interests, including music, film, sports, current events, and politics. I have a great sense of humor and can be very witty and sometimes sarcastic. I think something that makes me unique from other candidates is that I am very entrepreneurial. I’ve been investing in the stock market since I was old enough to drive.\n\nLastly, I have a very high sense of integrity. My coworkers would describe me as someone who is very dependable and adaptable. They would also tell you that I am a go-getter who is very organized and can take control of chaotic situations when needed."},{"id":11,"text":"Complete Statement for a Professional\nI’m the kind of person who keeps one eye on the future while taking care of today’s business. I know how to get things done, but at the same time I have the ability to foresee areas that may become problems and put processes in place to prevent the problems from occurring.\n\nI have been in business operations for more than seven years. My experience has been broad in that I have been very successful in developing ways to improve businesses and make them more profitable. I’ve worked in a number of companies in various industries, banking, retail, and the medical fields, and transitioned seamlessly to each.\n\nI believe my success can be attributed to my strong leadership and decision-making style. I talk to employees and managers and share the goals so that everyone is on the same page. I work with the under-achievers and put process improvements in place. I work with management to develop budgets that can be attained.\n\nI would describe my style as open and honest. I share all pertinent information with the employees one-on-one and listen to their ideas, concerns, desires, and needs. I teach them to utilize resources and tools and provide feedback so that they realize their contribution to the organization.\n\nWhen I look at your job posting, I can see myself in the role, bringing my vast knowledge and record of success in improving processes. I am very enthusiastic about your company and know that I could bring my creative and problem-solving ability to this job."},{"id":12,"text":"Complete Statement for a Student\nI am a fourth-year computer engineering major. I have taken an indirect path to what I really want to do, which is to work in finance. I feel that I have added value to offer by bringing the two disciplines together.\n\nMath is my strongest point. I understand what is going on right away. As an example, in physics I see the big picture, where some people need lots of examples. I get it very quickly and understand the problem and what it will take to get to the solution. This is one reason that investment banking is of interest to me.\n\nBetween my part-time work experience and my college classes, I have a good background in basic accounting. In addition, I have taken advanced finance, as this is an area of interest.\n\nI have been working in the food industry as an assistant manager, managing customers and employees while I have been going to school. The people I supervise have given me great feedback about my management style and they would ask for me to be their supervisor if they had a choice. I have moved quickly up the ranks in the restaurant business, and now feel I have a basic understanding of the issues facing clients in the business sector.\n\nThese statements can range from two minutes to four minutes, depending on the situation. If you are prepared, you can adapt your statement as appropriate. If your interviewer seems in a hurry or is checking his watch, that would be a clue to shorten your statement.\n\nI hope you can see that there are many benefits to working through the exercises and writing your five points. A little work can result in a smooth, concise answer to any open-ended question about you. The more work that you put into these exercises, the more succinct and prepared you will be for your next interview. Remember, these are not answers to memorize, but to walk through from point to point."},{"id":13,"text":"A TOOL TO REMEMBER: YOUR FIVE POINTS AND YOUR FIVE FINGERS\nHow can you possibly remember all those points? While you can’t bring a “cheat sheet” into the interview, you can bring your fingers. You can use your fingers as a tool to help you to stay focused. Use each finger as a talking point:\n\nThe thumb (strong base): education and experience.\n\nThe pointer finger (directed): your expertise or knowledge of the job.\n\nThe middle finger (to the point): your strength—transferable or personal.\n\nThe ring finger (loyalty): people skills, communication, “whatever it takes” attitude.\n\nThe little finger (weakest): personal information that is engaging and interesting about you, or how the combination of all these traits together makes you unique."},{"id":14,"text":"“Is there anything else you’d like to add?”\n\nCandidate’s answer: “Before I leave I would like to summarize what I would bring to the job.”"},{"id":15,"text":"THE BASIC PRINCIPLES OF SALARY NEGOTIATION\n\nKeep the following in mind throughout:\n\n1. You can’t negotiate anything until you have an offer. Don’t go there yet.\n\n2. Know your walk-away point—when you can’t afford to take the offer.\n\n3. Know the rules of salary negotiation before discussing salary. (See below.)\n\n4. Know what you want: the whole package and the priorities of wants."},{"id":16,"text":"The Seven Rules of Salary Negotiation\n\nRule One: He who mentions a dollar figure first, loses.\n\nRule Two: Never try to negotiate until you have an offer.\n\nRule Three: Do not accept on-the-spot offers.\n\nRule Four: Always get the offer in writing.\n\nRule Five: Keep it friendly.\n\nRule Six: Consider your position before making deals.\n\nRule Seven: Focus on the base first."},{"id":17,"text":"Rule One: He Who Mentions a Dollar Figure First, Loses\nWait until the subject is broached. Then answer that you are open on salary and are looking for an opportunity or that you would like to postpone that discussion until later in the process. This is a good time to ask what salary range is budgeted for the position. If you are asked what your former salary was, you might state that you would like to hear more about the responsibilities of the job before you compare salaries, or that there were circumstances in your other job that kept your salary below market value. If you are asked what salary you are looking for, depending on where you are in the interviewing process, state that you think it is too early to discuss salary and you would like to hear more about the job before you discuss the particulars of money.\n\nRule Two: Never Try to Negotiate Until You Have an Offer\nYou are in a far stronger position to negotiate after you have the offer. Your chances of getting a higher salary improve if the interviewer is convinced you are the right person for the job. This falls somewhere between “They want you” (they’re ready to make an offer) and “They got you!” (you’ve signed on the dotted line, and it is too late to go back and start over).\n\nRule Three: Do Not Accept On-the-Spot Offers\nSome employers make on-the-spot offers. It is always a good idea to take time to think the offer over. Once you’ve accepted the offer, it’s too late to negotiate any terms of the agreement. If pressed for a decision, tell the employer that you have a personal policy of taking 24 hours to think over major decisions.\n\nRule Four: Always Get the Offer in Writing\nToo many people have been burned after negotiating a sweet deal only to find that when management changes, there is no record of the negotiation. Get it in writing! If you negotiate a change, make sure you get a new offer letter or an addendum memo. An e-mail is acceptable as a formal document.\n\nRule Five: Keep It Friendly\nThe tone of the negotiation should never be confrontational. You should be aiming for a win/win situation.\n\nRule Six: Consider Your Position Before Making Deals\nIf you cannot settle on a salary, perhaps an early performance review/salary increase can be negotiated. Sometimes you can negotiate using vacation or benefits. The answer is always no unless you ask the question.\n\nRule Seven: Focus on the Base First\nIt is in your best interest to negotiate the base salary first. Your future raises will be affected by this sum, not to mention Social Security, unemployment, life insurance, and others.\n\nSometimes the employer’s hands are tied due to internal salary equity. You may be asking for more money than some of the current employees are making. Sometimes you will be offered a hiring bonus."},{"id":18,"text":"Here are examples of salary questions interviewers ask:\n\n“What salary are you seeking?”\n\n“What salary are you making at your current job?”\n\n“What salary were you making at your last job?”\n\nExamples of premature answers:\n\n“I was making $50,000.”\n\n“I am currently making $50,000 a year with a yearly bonus.”\n\n“I am looking for a 15 percent increase over what I am currently making.”"},{"id":19,"text":"Interviewer’s question: “Could you tell me your salary requirement?”\n\nCandidate’s answer: “I’d be glad to talk salary at the appropriate time, but I really don’t have enough facts at this time to discuss salary. I would be interested in hearing the range budgeted for this position as well as the entire benefits package.”\n\nOr, you could say:\n\nCandidate’s answer: “What does your company typically pay someone with my background and experience?”\n\nPostponing the salary discussion is the best step for you, at least until you have the information you need. If the interviewer pushes for a “ballpark” or “what you are making now,” you could talk about ranges as in the following example.\n\nCandidate’s answer: “I’ve done some research and have found an acceptable range for someone with my years of experience and education is (name a range). Is this the range that your company has budgeted for the position?”\n\nBut, what if the representative is having none of your vague answers and pushes you for your “current” or “last salary?” Here are some possible answers, keeping in mind what’s behind this question.\n\nCandidate’s answer: “I’m just not ready to talk salary without some more information from the company and what the job will entail so that I have something to compare it with. Rather than go back and forth, the range I would be interested in is $ [name a starting figure] to $ [name a closing figure].” Be sure the range is broad with an acceptable number at the low end. If you are offered your low-end number, you were the one who named the number, and it may be the number that they consider acceptable for you.\n\nOr, you could say something like:\n\nCandidate’s answer: “The base salary that I received in my last job was combined with an extremely generous benefits package and bonuses. I would need to hear the details of the package that you offer in order to compare.” (If, of course, this is true)\n\n \n\nThe Offer\nIf the employer determines that you are right for the job, the company will take the lead and make an offer. It is now your turn to move the dance to the next stage. But first, you must evaluate the package. Take into consideration the:\n\n• Base rate (always the top priority) and timing of annual reviews\n\n• Alternative compensation: bonus, commission, stock options, profit sharing\n\n• Benefits: premiums for insurance, paid time off, matching 401(k), working conditions\n\n• Other perks: car, education reimbursement, training, laptop computer\n\nSome basic calculations will tell you how closely the offer meets your needs, values, and worth."},{"id":20,"text":"The 10 Most Common Key Factors\n• Honesty and integrity: moral issues\n\nTo be trustworthy; to avoid deceit; to present issues frankly and fully; to make the right decision at any cost, choosing between right and wrong\n\n• Communication: relating to others, convincing others\n\n• Adaptable: open to change, flexible\n\nA willing attitude; adjusts quickly to change; comfortable in new situations; willing to do what is asked; performs above and beyond what the job calls for\n\n• Problem solving: analyze, evaluate, judgments/decisions\n\nTo discern what is appropriate; to make good judgments and decisions; to deal with facts and evaluate, research, and explore options; to look at all aspect of situations before jumping to conclusions\n\n• Initiative: above and beyond, resourceful\n\nTo step forward; to formulate creative alternatives or solutions; to resolve problems thinking out of the box; to show flexibility in response to unanticipated circumstances\n\n• Leadership: motivate, role model, team player\n\nTo recognize and assume responsibility for work that needs to be done; to persist in the completion of a task; to influence group activity; to motivate others to participate in an activity\n\n• Plan and organize: prioritize\n\nTo prioritize and plan tasks effectively; to employ a systematic approach to achieving objectives; to make appropriate use of limited resources; to meet deadlines\n\n• Accountable: results-oriented\n\nAbility to “make it happen”; to meet deadlines; to consistently follow through; to use resources available to achieve results; time management and prioritization; to know when to ask for assistance\n\n• Composure: to stay positive\n\nTo stay calm, poised, and effective in stressful or difficult situations; to think on one’s feet; to adjust quickly to changing situations; to maintain self-control\n\n• Self-motivated: enthusiastic, passionate\n\nDetermined; ability to perform with little or no supervision; to make the most of what is available; to take the initiative and go above and beyond what is asked"},{"id":21,"text":"THE THREE CATEGORIES OF SKILLS, ABILITIES, AND TRAITS\n1. Knowledge-based skills: skills learned through experience or education\n\nExamples: computer programs/languages; graphics; writing skills; training skills; management experience; sciences: chemistry, biology; coaching skills, sales experience; leadership training; project management; operations; marketing; event planning; policy development; legal expertise; strategic planning; liaison; mediator; product management; research skills; business acumen; mechanically adept; and others.\n\n2. Transferable or general skills: skills that can be thought of as “portable skills.” You can take them with you to almost any job. They are broad-based and usually learned or acquired through experience.\n\nExamples: communication; listening; decision making; judgment; initiative; planning; organizing; time management; leadership; work ethic; interpersonal skills; common sense; social skills; creative ideas; sees big picture; analytical; accountable; reliable; high standards; resourceful; action-oriented; intuitive; problem solving; good with numbers; gets along well with others; articulate; handy; artistic; envisioning\n\n3. Personal traits: qualities that make you unique. These traits can sometimes determine whether you are a good fit for the company, the department, or the position.\n\nExamples: dependable; strong; team player; versatile; patient; friendly; energetic; formal; loyal; self-confident; dynamic; practical; sociable; persuasive; responsible; sense of humor; cheerful; good attitude; aggressive; assertive; determined; honest; humble; productive; conscientious; curious; enthusiastic; precise; detail-oriented; compassionate; efficient; emotional; firm; open-minded"},{"id":22,"text":"INTERVIEW PRINCIPLES AND RULES TO DISCUSS SALARY\nThe Basic Principles of Salary Negotiation\n1. You can’t negotiate anything until you have an offer. Don’t go there yet.\n\n2. Know your walk-away point—when you can’t afford to take the offer.\n\n3. Know the rules of salary negotiation before discussing salary.\n\n4. Know what you want: the whole package and the priorities of wants."},{"id":23,"text":"The Seven Rules of Salary Negotiation\nRule One: He who mentions a dollar figure first, loses.\n\nRule Two: Never try to negotiate until you have an offer.\n\nRule Three: Do not accept on-the-spot offers.\n\nRule Four: Always get the offer in writing.\n\nRule Five: Keep it friendly.\n\nRule Six: Consider your position before making deals. Rule Seven: Focus on the base salary first."},{"id":24,"text":"THE FIVE-POINT SYSTEM\nWriting out your five points will be extremely important to answering key questions about you.\n\nPoint One: Your education and years of experience\n\nPoint Two: Your area of expertise\n\nPoint Three: Your key strength\n\nPoint Four: Your work ethic or work style\n\nPoint Five: Personal facts\n\nUsing Your Fingers to Remember\nThe thumb (strong base): education and experience.\n\nThe pointer finger (directed): your expertise or knowledge of the job.\n\nThe middle finger (to the point): your strength—transferable or personal.\n\nThe ring finger (loyalty): people skills, communication, whatever it takes attitude.\n\nThe little finger (weakest): personal information that is engaging and interesting about you or how the combination of all these traits together makes you unique."},{"id":25,"text":"YOUR EXAMPLES AND STORIES\nBehavioral Stories\nDon’t just tell; show the action.\n\n“Tell me about a time …”\n\n“Give me an example …”\n\n“Describe a situation …”\n\nGuidelines for Storytelling\n• The beginning is 20 percent of the story.\n\n• The middle is 60 percent of the story.\n\n• The ending is 20 percent of the story.\n\nSituational Thinking\n“What would you do if …?”\n\nA: The first thing I would do is to analyze.\n\nR: Next, I would do research.\n\nD: Then I would develop …\n\nI: After that I would implement …\n\nE: I always evaluate and reevaluate."},{"id":26,"text":"THE FIVE CATEGORIES OF INTERVIEW QUESTIONS\n1. Who are you? What do have to offer?\n\n2. Why do you want to work here?\n\n3. Sensitive or negative questions.\n\n4. What are your salary expectations?\n\n5. Miscellaneous questions."},{"id":27,"text":"1. Question: “Describe a time when you had a conflict with a coworker.”\n\n2. Question: “How would you plan and organize an event?”\n\n3. Question: “What steps do you take to fix a problem before it becomes a major problem?”\n\n4. Question: “What is your strength?”\n\n5. Question: “Why do you want to work for this company?”\n\n6. Question: “How do you get others to buy into your goals and objectives?”\n\n7. Question: “In your last position, what type of relationship did you maintain with other business departments?”\n\n8. Question: “What salary range would you require to take this job?”\n\n“What are three words that describe you?”"}]}