{"data":[{"id":1,"text":"1. What don’t you want to work on?\nGood because: There are always bits of jobs we don’t like, but project managers typically work on the projects that they are assigned. It’s fine to have preferences, but you’re looking for someone who can respond to business needs even if that isn’t their top choice of project.\n\nBad response: “I like to choose the projects I work on, and I only really want to do the digital media ones. That’s OK, isn’t it?”"},{"id":2,"text":"2. If you had to rate project management as a career, from 1-10 how would you rate it?\nGood because: This will show you how they value their career and whether they see themselves progressing in a PM role. Ask them why they chose that rating.\n\nBad response: “I’d score it a 1 because I’m only doing this to fill in time before I can get a proper job.”"},{"id":3,"text":"3. What’s the most important thing for a project manager to do?\nGood because: It will show you their priorities and whether they have actually thought about what a project manager does. It will also demonstrate whether they are a good cultural fit for your team. If you have a strong focus on process and they think the most important thing is to be flexible and adapt processes as you go, then you probably won’t get on.\n\nBad response: “Well, it’s mainly admin, isn’t it?”"},{"id":4,"text":"4. What do you spend the most time doing each day?\nGood because: This gives you an indication of how they do their job. Someone who spends all day at the PC may suit your environment, or you might be looking for a project manager who gets out and visits clients most days of the week. Remember that they might be prepared to do something other than what they do now, so if you hear something that doesn’t fit with the post you are recruiting for, don’t rule them out before exploring this further.\n\nBad response: “Facebook.”"},{"id":5,"text":"5. How do you work with sponsors? How do you manage up?\nGood because: Managing up means working well with people more senior than you. Project managers do this all the time, so it’s good to find out how they make those relationships work.\n\nBad response: “I prefer not to get my sponsor involved. They’re typically a figurehead, so I don’t bother them.”"},{"id":6,"text":"6. When was the last time you didn’t delegate and what happened?\nGood because: This will help you work out if they are happy to be honest and tell you about a time that something went wrong. This shows their capacity to learn from mistakes and how they deal with information overload. Delegating work packages is key to project work and you’ll want to hire someone who understands that.\n\nBad response: “I never delegate—it’s easier to do it all myself.”"},{"id":7,"text":"7. What was the most difficult ethical decision you’ve had to make on a project?\nGood because: It can demonstrate their awareness of PMI Code of Ethics and even if they aren’t aware of that, their general approach to work. You can also use it to open up an interesting discussion and allow you to judge how they will fit into your business culture.\n\nBad response: “I awarded a contract to my cousin once, even though he was the most expensive. I did get a good holiday out of the kickback though.”"},{"id":8,"text":"8. What criteria are you using to find your next job?\nGood because: It will show you what’s important to them at work: green credentials, career progression, work/life balance, working for a big brand etc. It will also tell you if they are actively job hunting or whether they saw your ad and couldn’t resist (either is fine).\n\nBad response: “Salary, expense policy and the chance to travel abroad.”"},{"id":9,"text":"9. How have you improved project management processes at your current firm?\nGood because: Not everyone has the chance to work on business critical, exciting projects that make for a great CV, but everyone has the chance to offer some suggestions for improvements (even if they aren’t taken up). Look for someone who has ideas and who isn’t afraid to put them forward.\n\nBad response: “It’s all pretty rubbish there but I haven’t bothered to do anything about it as there’s no point.”"},{"id":10,"text":"10. What creative problem solving techniques do you use?\nGood because: It’s worth probing the technical skills of candidates. Can they talk knowledgably about fishbone diagrams, De Bono’s thinking hats, role play? Branch out to talk about the last project issue they resolved with creative thinking.\n\nBad response: “I tend to solve problems myself without involving the team.”"}]}